[{"id":"b7d53d37-c542-4ff8-ba52-2827c148aedb","type":"Full Time","url":"https://web.archive.org/web/20210507025928/https://jobs.github.com/positions/b7d53d37-c542-4ff8-ba52-2827c148aedb","created_at":"Thu May 06 21:13:52 UTC 2021","company":"Bluetree Network ","company_url":"https://web.archive.org/web/20210507025928/https://www.bluetreenetwork.com/join-us/career-opportunities/","location":"Remote ","title":"Full Stack Engineer- Consultant ","description":"\u003cp\u003e\u003cstrong\u003eDivision\u003c/strong\u003e  Consulting \u0026amp; Technology\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eReports To\u003c/strong\u003e:  Enterprise Architect\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eDirect Reports\u003c/strong\u003e:  No\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eFLSA Status\u003c/strong\u003e: Exempt\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eEmployment Eligibility\u003c/strong\u003e:  Must be legally authorized to work in the United States without sponsorship\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWork Location\u003c/strong\u003e: This position is remote.  Must work in a location within the United States\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eTravel\u003c/strong\u003e: Up to 75% when it is safe\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWork Hours\u003c/strong\u003e: Work is generally done during standard business hours for the client(s) that you are assigned to.  This could vary and be spread across time zones.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eCompensation\u003c/strong\u003e: Salary varies based on experience\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eBenefits Eligible\u003c/strong\u003e:  Yes\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eABOUT BLUETREE\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eBluetree Network is a rapidly-growing strategy and support firm in the field of healthcare information technology. We're headquartered in Madison, WI and have more than 350 Blueleaves across the nation helping our customers tackle their biggest challenges and maximize return on their healthcare IT investments. Our results speak for themselves, as 70% of our business comes from referrals and over 80% of clients who recommend us cite the quality of our employees.\u003c/p\u003e\n\u003cp\u003eIn 2019, Bluetree became a part of Tegria: a family of top-tier healthcare technology, revenue cycle management, and professional services firms aligned closely with Providence, one of the largest health systems in the United States. In joining Tegria, we've extended our customer reach, gained a partnership with Providence to pilot our ideas, and are currently expanding into new offerings, new markets, and new geographies.  These relationships allow us to bring enhanced capabilities to the market that differ from our competition to tackle the hardest challenges in healthcare. We are looking for a new internal team member who shares our propensity for innovation to join our Custom Development Solutions team and help us create a real impact in healthcare.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eLIFE AS A BLUELEAF\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eBlueleaves do better. We're smart, driven, and humble. Together we're committed to making a real impact in healthcare by helping our customers tackle their biggest challenges. It's hard work but we balance it with a workplace that is inclusive and friendly; a place where you can be your authentic self. We trust our employees to work autonomously as we supply the direct feedback, transparency, and support needed to take on important work - and crush it. And we make the space for you to do that in a way that works for you by providing best-in-class benefits, 401k with employer matching, generous PTO, remote work opportunities, and flexibility.\u003c/p\u003e\n\u003cp\u003eWant in?  Come join us in our commitment to Done. Better.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eOVERVIEW OF THE ROLE\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eYour work at Bluetree will focus on managing the complete application development process from conception to deployment.  This includes but not limited to gathering requirements, creating user stories, sprint planning, design, development, QA, deployment, and bug fixing.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eJob responsibilities include\u003c/em\u003e:\u003c/p\u003e\n\u003cp\u003eTranslate application storyboards and use cases into functional applications\u003c/p\u003e\n\u003cp\u003eDesign, build, and maintain efficient, reusable, and reliable code with a focus on C#, ASP.NET, associated web technologies, and relational database technologies\u003c/p\u003e\n\u003cp\u003eEnsure the best possible performance, quality, and responsiveness of applications\u003c/p\u003e\n\u003cp\u003eImplement, test, and bug-fix functionality\u003c/p\u003e\n\u003cp\u003eMaintain code quality, organization, and automatization\u003c/p\u003e\n\u003cp\u003eParticipate as a team member in meetings and collaboration with team\u003c/p\u003e\n\u003cp\u003eResponsible for regular communication with others involved in the development process\u003c/p\u003e\n\u003cp\u003eProvide support for customers\u003c/p\u003e\n\u003cp\u003eMeet project deadlines in a remote setting\u003c/p\u003e\n\u003cp\u003eLearn additional technologies as required and appropriate\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eSuccess Criteria\u003c/em\u003e:\u003c/p\u003e\n\u003cp\u003ePeople who are successful in this job display the following:\u003c/p\u003e\n\u003cp\u003eIndependent - Can create and manage workplans individually.  Comfortable operating without predefined deliverables or boundaries.\u003c/p\u003e\n\u003cp\u003eDisplay a bias to action and are energized by, not paralyzed by, problems\u003c/p\u003e\n\u003cp\u003eExcellent Writing and Communication Skills - deliver presentations with confidence and flair. Communicate in a manner that resonates clearly with your intended audience. Are clear and concise in their written and verbal communication\u003c/p\u003e\n\u003cp\u003eCan anticipate issues and escalate effectively. Believe they have input and the ability to influence the process.\u003c/p\u003e\n\u003cp\u003eFlexible - willing to adjust their approach to the scenario. Are willing to push their comfort zone and be a team player.\u003c/p\u003e\n\u003cp\u003eMake commitments – and keep commitments\u003c/p\u003e\n\u003cp\u003eLearn from their mistakes.  Are kind and create a safe environment for others to make mistakes and learn\u003c/p\u003e\n\u003cp\u003eInvest time in people, display compassion, and listen intently. Enjoy teaching and helping others grow\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eQUALIFICATIONS\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eMinimum Qualifications\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e5+ years of experience developing software using the full Microsoft stack (e.g. .NET, C#, ASP.NET, Core)\u003c/p\u003e\n\u003cp\u003e3+ years of experience in developing REST API’s, preferability on .NET MVC WEB.API\u003c/p\u003e\n\u003cp\u003e3+ years of experience with JavaScript frameworks (e.g. VueJS, ReactJS and/or similar libraries)\u003c/p\u003e\n\u003cp\u003e3+ years of experience with HTML and web development frameworks (Bootstrap, jQuery)\u003c/p\u003e\n\u003cp\u003e3+ years of experience developing with Entity Framework or other Code First frameworks\u003c/p\u003e\n\u003cp\u003eDemonstrate the ability to create clean and well-designed code and queries\u003c/p\u003e\n\u003cp\u003eFamiliarity with SQL database design and analysis\u003c/p\u003e\n\u003cp\u003eProven experience with software architecture and the ability to design applications\u003c/p\u003e\n\u003cp\u003eUnderstanding of Cyber Security concepts and coding best practices\u003c/p\u003e\n\u003cp\u003eExperience creating and executing unit tests\u003c/p\u003e\n\u003cp\u003e\u003cem\u003ePreferred Qualifications\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003eBachelor’s Degree in Computer Science, Engineering, or related field – or comparable development experience\u003c/p\u003e\n\u003cp\u003eCertifications in relevant technologies\u003c/p\u003e\n\u003cp\u003eExperience with mobile development\u003c/p\u003e\n\u003cp\u003eExperience with cloud tools and platforms\u003c/p\u003e\n\u003cp\u003eSQL tuning and optimization\u003c/p\u003e\n\u003cp\u003eProcess improvement mindset\u003c/p\u003e\n\u003cp\u003eHealthcare knowledge preferred\u003c/p\u003e\n\u003cp\u003eExperience with Azure DevOps or other project management tools\u003c/p\u003e\n\u003cp\u003eProficiency with code versioning tools\u003c/p\u003e\n\u003cp\u003eExperience with authentication and authorization concepts (e.g. Owin, JWT, IAM)\u003c/p\u003e\n\u003cp\u003eEnjoy solving new and challenging problems\u003c/p\u003e\n\u003cp\u003eCreative mindset with an eye for design\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eOUR COMMITMENT TO DIVERSITY, EQUITY, AND INCLUSION\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eThe world’s most talented professionals come from every background. Bluetree cultivates a diverse workforce and inclusive workplace to enhance the depth, innovation, and quality of the services we offer. It’s also the right thing to do for our customers, our team members, and Bluetree.\u003c/em\u003e \u003c/p\u003e\n\u003cp\u003e\u003cem\u003eBluetree Network is an equal employment opportunity employer and provides equal employment opportunity (EEO) to all persons regardless of age, color, national origin, citizenship status, physical or mental disability, race, religion, creed, gender, sex, sexual orientation, gender identity and/or expression, genetic information, marital status, status with regard to public assistance, veteran status, or any other characteristic protected by federal, state or local law. In addition, Bluetree will provide reasonable accommodations for qualified individuals with disabilities. All qualified candidates are encouraged to apply.\u003c/em\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eEmail your resume to: \u003ca href=\"mailto:dhackett@bluetreenetwork.com\"\u003edhackett@bluetreenetwork.com\u003c/a\u003e\u003c/p\u003e\n","company_logo":null},{"id":"c572222a-1dfb-4ac6-b4bc-f8d09b708024","type":"Full Time","url":"https://web.archive.org/web/20210507025928/https://jobs.github.com/positions/c572222a-1dfb-4ac6-b4bc-f8d09b708024","created_at":"Thu May 06 20:50:00 UTC 2021","company":"The University of Oklahoma","company_url":"http:","location":"Norman, OK","title":"DevOps Engineer (Library Publishing)","description":"\u003cp\u003eThe University of Oklahoma\nUniversity Libraries\nDevOps Engineer (Library Publishing)\nSalary Range: $70,000-$80,000 based on experience\u003c/p\u003e\n\u003cp\u003eThe University of Oklahoma Libraries needs a creative, mission-driven DevOps Engineer to join our Cloud Infrastructure \u0026amp; Development team. As a member of this team, you will apply a modern DevOps approach to the continuous improvement of operational practices, system reliability, and cost-effectiveness of a diverse portfolio of platforms and services supporting the library’s role as the intellectual crossroads of the university.\u003c/p\u003e\n\u003cp\u003eThis position focuses on the development and operation of our document repositories and library publishing platforms. Additionally, the position supports other key infrastructure, collaborating with colleagues across disciplines and organizational boundaries to plan, build, and operate components of the OU Libraries technology strategy.\u003c/p\u003e\n\u003cp\u003eTo see more detail about the Library DevOps Engineer (Library Publishing) position visit libraries.ou.edu/jobs. To apply for this position, go to \u003ca href=\"https://jobs.ou.edu\"\u003ehttps://jobs.ou.edu\u003c/a\u003e and search for job number 211176.\u003c/p\u003e\n\u003cp\u003eThe University of Oklahoma, in compliance with all applicable federal and state laws and regulations, does not discriminate on the basis of race, color, national origin, sex, sexual orientation, genetic information, gender identity, gender expression, age, religion, disability, political beliefs, or status as a veteran in any of its policies, practices or procedures. This includes, but is not limited to: admissions, employment, financial aid and educational services. For inquiries regarding non- discrimination policies, please visit the OU Institutional Equity Office.\u003c/p\u003e\n\u003cp\u003eApplicants must submit an ONLINE application at \u003ca href=\"http://www.jobs.ou.edu\"\u003ewww.jobs.ou.edu\u003c/a\u003e for the appropriate job requisition number. Computers and personal assistance are available at the Office of Human Resources, 905 Asp, Room 205, Norman, OK 73069. Include job requisition number on all correspondence. Deadlines subject to change with or without notice. For further information on this or other University of Oklahoma job opportunities, please call (405) 325-1826 or access our website at \u003ca href=\"http://www.hr.ou.edu\"\u003ewww.hr.ou.edu\u003c/a\u003e. The University of Oklahoma is an equal opportunity institution (\u003ca href=\"http://www.ou.edu/eoo\"\u003ewww.ou.edu/eoo\u003c/a\u003e).\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://jobs.ou.edu\"\u003ehttps://jobs.ou.edu\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://web.archive.org/web/20210507025928/https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcWFpIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--d38afc4eb856b4aa880ef216f3b891cddfaf856c/OU_logo_web_360x180.jpg"},{"id":"fab4ca7a-b9f1-41b0-9c92-7f20dd71aecf","type":"Full Time","url":"https://web.archive.org/web/20210507025928/https://jobs.github.com/positions/fab4ca7a-b9f1-41b0-9c92-7f20dd71aecf","created_at":"Thu May 06 20:19:05 UTC 2021","company":"The University of Oklahoma","company_url":"https://web.archive.org/web/20210507025928/https://www.ou.edu/","location":"Norman, OK","title":"DevOps Engineer (Research Platforms)","description":"\u003cp\u003eThe University of Oklahoma\nUniversity Libraries\nDevOps Engineer (Research Platforms)\nSalary Range: $60,000-$80,000 based on level of experience\u003c/p\u003e\n\u003cp\u003eThe University of Oklahoma Libraries needs a creative, mission-driven DevOps Engineer to join our Cloud Infrastructure \u0026amp; Development team. As a member of this team, you will apply a modern DevOps approach to the continuous improvement of operational practices, system reliability, and cost-effectiveness of a diverse portfolio of platforms and services supporting the library’s role as the intellectual crossroads of the university.\u003c/p\u003e\n\u003cp\u003eThis position focuses on the development and operation of our document repositories and library publishing platforms. Additionally, the position supports other key infrastructure, collaborating with colleagues across disciplines and organizational boundaries to plan, build, and operate components of the OU Libraries technology strategy.\u003c/p\u003e\n\u003cp\u003eTo see more detail about the Library DevOps Engineer (Library Publishing) position visit libraries.ou.edu/jobs. To apply for this position, go to \u003ca href=\"https://jobs.ou.edu\"\u003ehttps://jobs.ou.edu\u003c/a\u003e and search for job number 211234.\u003c/p\u003e\n\u003cp\u003eThe University of Oklahoma, in compliance with all applicable federal and state laws and regulations, does not discriminate on the basis of race, color, national origin, sex, sexual orientation, genetic information, gender identity, gender expression, age, religion, disability, political beliefs, or status as a veteran in any of its policies, practices or procedures. This includes, but is not limited to: admissions, employment, financial aid and educational services. For inquiries regarding non- discrimination policies, please visit the OU Institutional Equity Office.\u003c/p\u003e\n\u003cp\u003eApplicants must submit an ONLINE application at \u003ca href=\"http://www.jobs.ou.edu\"\u003ewww.jobs.ou.edu\u003c/a\u003e for the appropriate job requisition number. Computers and personal assistance are available at the Office of Human Resources, 905 Asp, Room 205, Norman, OK 73069. Include job requisition number on all correspondence. Deadlines subject to change with or without notice. For further information on this or other University of Oklahoma job opportunities, please call (405) 325-1826 or access our website at \u003ca href=\"http://www.hr.ou.edu\"\u003ewww.hr.ou.edu\u003c/a\u003e. The University of Oklahoma is an equal opportunity institution (\u003ca href=\"http://www.ou.edu/eoo\"\u003ewww.ou.edu/eoo\u003c/a\u003e).\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://jobs.ou.edu\"\u003ehttps://jobs.ou.edu\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://web.archive.org/web/20210507025928/https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcUtpIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--a1d52d67c1a1d46556f91354ae9172b728413d7b/OU_logo_web_360x180.jpg"},{"id":"474da886-f411-4fff-a8e1-c0aa05f46292","type":"Full Time","url":"https://web.archive.org/web/20210507025928/https://jobs.github.com/positions/474da886-f411-4fff-a8e1-c0aa05f46292","created_at":"Thu May 06 15:20:52 UTC 2021","company":"Luminovo GmbH","company_url":"https://web.archive.org/web/20210507025928/https://luminovo.ai/","location":"Munich","title":"(Senior) Software Engineer - Rust (m/f/d)","description":"\u003cp\u003eAt Luminovo, we believe that technical progress is the key to solving some of the biggest challenges facing humankind today. We see it as our core purpose to accelerate that technical progress.\u003c/p\u003e\n\u003cp\u003eWhen not working on achieving our mission, you'll find us working on building an incredible company culture for our team. We take our values seriously and work hard to ensure we embody them, as well as foster an environment of psychological safety. This forms the foundation for direct and continuous feedback between Luminerds, something that we encourage on a daily basis, regardless of being an intern, founder, full-time Luminerd or casual bystander. We've seen that direct and continuous feedback translates into continuous learning, and continuous learning is something we all want more of.\u003c/p\u003e\n\u003cp\u003eSince the founding of Luminovo, we've welcomed over twenty different nationalities into our team. With English as our internal operating language, we hope to increase this number as we continue to grow. Saying this, it's also important to us that you bring your whole, authentic self to work every day, and actively teach us what it means to be you.\u003c/p\u003e\n\u003cp\u003eWe love to work with exceptional people on interesting problems. You'll find that some of our team members have graduated from renowned universities, while others have worked for some pretty innovative companies - but this doesn't matter too much to us. What matters most is what you bring to the table everyday and that you resonate with our company values. If you want to know more about the team you could be joining - as well as how we got to where we are now - head over to our About Us page.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eYour role\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe've just shipped the v1 of \u003cstrong\u003eLumiQuote\u003c/strong\u003e - a B2B SaaS application for the electronics industry and Luminovo's first step in redefining the software stack used to bring electronics to life. Read more about what we're up to \u003ca href=\"http://t3u1.mjt.lu/lnk/AMQAAKF-2zMAAAAAAAAAAG3sWXAAAAAA-nQAAAAAAAZPNgBgk7ujXO7Iev28Tfee_fTgEcYscwAGCXo/2/Eh4Vn-U5nV8ZRn2O-CS0iw/aHR0cHM6Ly9tZWRpdW0uY29tL2x1bWlub3ZvL2Etc2hvcnQtcHJpbWVyLW9uLXRoZS1lbGVjdHJvbmljcy1pbmR1c3RyeS1kYjY4YzliMWQ3Nw\"\u003ehere\u003c/a\u003e. We decided to write most of our code in Rust around a year ago and have been loving it ever since. Now we want to pick up steam and need your help.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eHere's what you'll be getting up to\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eTake responsibility for keeping our Rust codebase healthy (easy to understand and easy to change) and provide guidance (through code reviews, pair programming and insight hours) to our other engineers to do the same\u003c/li\u003e\n\u003cli\u003eHelp us deliver value to our users in a speedy and reliable manner by developing and deploying new features. Break down your work into small user stories and make your progress visible. You will own features from conception until and after they are in production. If you are a full-stack developer that's a plus, but a pure backend-focus is also fine for this role!\u003c/li\u003e\n\u003cli\u003eHelp us reduce the number of bugs introduced into our application and make it easier to refactor with confidence by improving our automated tests\u003c/li\u003e\n\u003cli\u003eSolidify our observability setup to monitor, identify and debug performance bottlenecks (such as database connections, locks, TCP sockets, threads, CPU, memory etc.) before they become a problem\u003c/li\u003e\n\u003cli\u003eWe will soon try to find a good boundary in our domain model and split our product team into two to reduce cognitive load on our engineers. Help us break our Rust monolith into two and ensure both teams can deploy independently.\u003c/li\u003e\n\u003cli\u003eKeep learning about new technologies and practices related to using Rust in production; assess whether and how they can be used at Luminovo\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eTech stack\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe always try to use the best tools available for the job. As of now our tech stack looks more or less like this. Don't worry we don't need you to be familiar with all of these.\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eMain monolith written in Rust (using actix-web as our web framework; soon switching from diesel to sqlx); one stateless service in Python (using FastAPI); frontend with React and Typescript\u003c/li\u003e\n\u003cli\u003ePostgreSQL for persisting our data\u003c/li\u003e\n\u003cli\u003eKubestack, terraform, flux and flagger for GitOps\u003c/li\u003e\n\u003cli\u003eLogrocket and Honeycomb for monitoring and observability\u003c/li\u003e\n\u003cli\u003egarden-io for developing on Kubernetes\u003c/li\u003e\n\u003cli\u003eAzure for cloud computing\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWhat we value\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eJust so you know - we purposefully did not create a standard list of minimum qualifications for this role. We care much more about your motivation and ability to help us accelerate technical progress than we care just about your CV. If you're interested to find out more about why we banned requirements from our performance profiles - see \u003ca href=\"http://t3u1.mjt.lu/lnk/AMQAAKF-2zMAAAAAAAAAAG3sWXAAAAAA-nQAAAAAAAZPNgBgk7ujXO7Iev28Tfee_fTgEcYscwAGCXo/3/DSSSqR4VmcBune4b4zxskg/aHR0cHM6Ly9sdW1pbm92by5haS9jb21wYW55LWFydGljbGVzL3doeS13ZS1iYW5uZWQtcmVxdWlyZW1lbnRzLWZyb20tb3VyLWpvYi1kZXNjcmlwdGlvbnM\"\u003ehere\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat to expect\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWe're an ambitious team located in the center of Munich. We do regular 1:1s, retrospectives, and insight hours to make sure we are constantly getting better at what we do.\u003c/li\u003e\n\u003cli\u003eWe greatly value psychological safety and honest feedback. We always expect you to speak up and share your ideas about what we can improve within the company, and take these views to heart.\u003c/li\u003e\n\u003cli\u003eWe offer a flexible working environment, weekly company lunch, and do regular team events together (from rafting on the Loisach in the summer, celebrating at Oktoberfest, keeping our team close through virtual events during Covid, or staying overnight at a winter hut during our hiking trip to the Alps).\u003c/li\u003e\n\u003cli\u003eWe're excited to revolutionize the electronics industry - and we want you to be too. That's why all full-time Luminerds receive competitive salary and strong company stock option packages. We also support you in finding your perfect set-up, and help you choose between team Mac or team ThinkPad.\u003c/li\u003e\n\u003cli\u003eAs cycling crazy as some of our team members? We offer JobRad®.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eAbout Yourself\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe are looking to add more than one engineer to our team, so both applications of experienced and less experienced devs are welcome. We tend to prefer if you can swing by our office in Munich a few times per month, but fully remote is possible as long as you live in the same time zone.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://camo.githubusercontent.com/d807cfb451a1a38d28bb52c1dfad4969433c6a3e/68747470733a2f2f742e676f686972696e672e636f6d2f682f65393238363339343032643733343461623734333533386362333261313837663838303865386236353564326563643362663030653835633639666630613662\"\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://t.gohiring.com/h/7ecb4d57c0982b004e0415f4749172742f7bc5e6c4f74e1d5a98b05b026226c6\"\u003eapplication form\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://web.archive.org/web/20210507025928/https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcUNpIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--55c957f6d3f07843c81be099a01004f858e898c8/Luminovo%20GmbH.png"},{"id":"be922b05-b0d3-4d17-8717-db2e7896b43b","type":"Full Time","url":"https://web.archive.org/web/20210507025928/https://jobs.github.com/positions/be922b05-b0d3-4d17-8717-db2e7896b43b","created_at":"Thu May 06 14:50:28 UTC 2021","company":"Tellonym","company_url":"https://web.archive.org/web/20210507025928/https://info.tellonym.me","location":"Remote","title":"Remote React / React Native Developer","description":"\u003cp\u003eTELLONYM is a fast growing tech company based in Berlin that is Remote-First. We want you to become part of our journey to build the biggest social network for the new generation - and to help us build a world-class tech company on the way.\u003c/p\u003e\n\u003cp\u003eAt Tellonym, you will be joining a young and diverse team with a variety of experience, skills and personal backgrounds. Everybody in our company can bring in ideas that will directly affect millions of users on Tellonym.\u003c/p\u003e\n\u003cp\u003eWe believe in strong teams of self-motivated people, in fast decision-making and empowering you to take charge through a supportive, learning-friendly atmosphere. We work in a flat hierarchy with the opportunity for everybody to weigh in. Every employee takes over own projects from the first day, which ensures quick learning, ownership and skill development.\u003c/p\u003e\n\u003cp\u003eVisit our Tellonym profile about (at)workAtTellonym to checkout the product, ask any questions you have and read about our workplace.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eTasks\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eTake ownership and implement new features and improvements into our React Native codebase\u003c/li\u003e\n\u003cli\u003eWrite tests and robust code\u003c/li\u003e\n\u003cli\u003eDraft architectural decisions together with the Tech Lead and explore new technologies\u003c/li\u003e\n\u003cli\u003eUnderstand user feedback and take own decisions during development\u003c/li\u003e\n\u003cli\u003eHave a direct impact on team processes and conventions by regular retrospectives\u003c/li\u003e\n\u003cli\u003eExchange your knowledge with other developers\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eRequirements\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eLiving in Europe\u003c/li\u003e\n\u003cli\u003eEnthusiastic about React Native with experience over two years\u003c/li\u003e\n\u003cli\u003eExcellent analytical and problem-solving skills\u003c/li\u003e\n\u003cli\u003ePassionate about writing well-structured, efficient and maintanable code and actively improving existing code base\u003c/li\u003e\n\u003cli\u003eValues an environment of candid feedback\u003c/li\u003e\n\u003cli\u003eUsed to work in an English-speaking environment\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eBenefits\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eFlat hierarchies that offer lots of freedom, impact as well as responsibility\u003c/li\u003e\n\u003cli\u003eCompletely flexible working times and location (we are regularly hosting team-events in our office in Berlin but follow a Remote-First environment)\u003c/li\u003e\n\u003cli\u003eThe right environment to learn new things and personally develop yourself\u003c/li\u003e\n\u003cli\u003eCompetitive compensation package and the option to participate in our ESOP system\u003c/li\u003e\n\u003cli\u003eModern working tools, hardware (Macbook) also for private usage\u003c/li\u003e\n\u003cli\u003eState-of-the-art tech stack running on AWS\u003c/li\u003e\n\u003cli\u003eWork with an exceptional team of young and smart people with a diverse background\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://tellonym.join.com/jobs/2198248-remote-react-react-native-developer-for-millions-of-users?pid=357a3b4531918760973f\u0026amp;oid=de9763b1-2dbe-4163-9e1d-71960728bca5\u0026amp;utm_source=github_jobs\u0026amp;utm_medium=paid\u0026amp;utm_campaign=single%2Bposting\u0026amp;utm_content=remote%2Breact%2Breact%2Bnative%2Bdeveloper%2Bfor%2Bmillions%2Bof%2Busers\"\u003ehttps://tellonym.join.com/jobs/2198248-remote-react-react-native-developer-for-millions-of-users?pid=357a3b4531918760973f\u0026amp;oid=de9763b1-2dbe-4163-9e1d-71960728bca5\u0026amp;utm_source=github_jobs\u0026amp;utm_medium=paid\u0026amp;utm_campaign=single%2Bposting\u0026amp;utm_content=remote%2Breact%2Breact%2Bnative%2Bdeveloper%2Bfor%2Bmillions%2Bof%2Busers\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://web.archive.org/web/20210507025928/https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcDJpIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--08d406ceabb1956bd78a8caee001b99524f8ed78/tellonym.png"},{"id":"32f231da-2a72-4c03-a655-b96f143a7519","type":"Full Time","url":"https://web.archive.org/web/20210507025928/https://jobs.github.com/positions/32f231da-2a72-4c03-a655-b96f143a7519","created_at":"Thu May 06 14:41:11 UTC 2021","company":"Lichtblick SE","company_url":"https://web.archive.org/web/20210507025928/https://www.lichtblick.de/","location":"Hamburg","title":"Software Engineer (gn) iOS/Android","description":"\u003cp\u003e\u003cstrong\u003eAbout Us\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eFor 22 years, LichtBlick has been pursuing a single goal: good energy. And everyone can feel that. Because humanity is just as important here as climate neutrality - after all, we ensure a good climate every day.\nLichtBlick doesn't just offer you a job, but one for the future. Because that's exactly the mission: to make a climate-neutral lifestyle normal. To define a new normal that more and more people are following. And it works: An initial 8 electricity consumers have become 1.7 million LichtBlickende. A community that saves 1 million tons of CO₂ a year and sets an example for a climate-neutral, fair tomorrow. Want to make a difference with your work, too? Then welcome to the green side. Let's shape the new normal.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eYour Job:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eIn this role, you will be responsible for developing the new digital heart of our customer experience: Our new native LichtBlick app on which our customers interact with us, e.g. in the areas of e-mobility, carbon offsets, and customer service.\u003c/li\u003e\n\u003cli\u003eYou are involved in every part of the software engineering process and in the lifecycle of your services - design, development, testing, deployment, maintenance, operations and improving software based on user feedback and usage data.\u003c/li\u003e\n\u003cli\u003eThrough unit, integration and UI testing, you will work to ensure the reliability and performance of the LichtBlick apps\u003c/li\u003e\n\u003cli\u003eYou will also support your colleagues in release management or publishing in the app stores\u003c/li\u003e\n\u003cli\u003eImplementing new features in the backend and retrieving data via GraphQL is also part of your tasks\u003c/li\u003e\n\u003cli\u003eYou will exchange your knowledge with other developers and be part of our guilds (e.g. Security, QA, …)\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eYour Skills:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eYou have several years of professional experience in app development for iOS (Swift, SwiftUI and XCTest) or Android systems (Kotlin)\u003c/li\u003e\n\u003cli\u003eYou have already successfully published and operated various apps in the popular app stores\u003c/li\u003e\n\u003cli\u003eIf you have hands-on experience with GraphQL (Apollo Client) and Swift/Kotlin, that's a big advantage.\u003c/li\u003e\n\u003cli\u003eDue to your independent, structured and equally analytical way of working, you are able to develop efficient solution approaches both in a team and independently.\u003c/li\u003e\n\u003cli\u003eYou have an agile mindset and experience with agile development practices (TDD, CI, Pair Programming, Scrum, ...)\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eThe Offer:\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eLichtBlick was one of the first providers for renewable energy in Germany. Today we offer everything related to climate-neutral energy solutions.Together, we want to improve even more. Maybe together with you soon. At LichtBlick, interesting and challenging tasks await you. In the heart of Hamburg - and in a highly motivated and friendly team. You can look forward to flexible working hours and benefits such as home office, sabbaticals, sports activities and much more. All this with plenty of innovation, freedom to take the initiative and make your own decisions, as well as many other offers that will help you grow both professionally and personally.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eYour contact:\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eLichtBlick SE\nPhillip Hingst\n\u003ca href=\"mailto:phillip.hingst@lichtblick.de\"\u003ephillip.hingst@lichtblick.de\u003c/a\u003e\nZirkusweg 6, 20359 Hamburg\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://camo.githubusercontent.com/ba6401ee1ddc3df1fb7e19550dee4d8c4a2143ec/68747470733a2f2f742e676f686972696e672e636f6d2f682f32343830333065636537386335343362386137396637353139646462656139343463323930663632656430303333653564346263386434353339396663373535\"\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://t.gohiring.com/h/d8aa84c4158433d979edecef1e7eb16cedbf2f6bcd6738ed46496b6a819b1ed9\"\u003eapplication form\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://web.archive.org/web/20210507025928/https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcHVpIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--7fe9d95a23ce6b541c5fb8388c018255c8572abb/Lichtblick%20SE.jpg"},{"id":"ddf7e6e4-f89b-4a39-9fe1-b49a4c601538","type":"Full Time","url":"https://web.archive.org/web/20210507025928/https://jobs.github.com/positions/ddf7e6e4-f89b-4a39-9fe1-b49a4c601538","created_at":"Wed May 05 13:55:00 UTC 2021","company":"Mika","company_url":"https://web.archive.org/web/20210507025928/https://www.mitmika.de","location":"Berlin","title":"Senior Android Developer (f/m/d) - Permanent \u0026 full (or part) time","description":"\u003cp\u003eDriven by the vision to improve well-being and therapy outcomes of cancer patients, we are creating a digital companion for cancer patients, the Mika-App. Mika, founded in 2017 by Dr. Gandolf Finke and Dr. Jan\nSimon Raue is a VC-backed e-health company. We are a young and spirited team with the passion to making a difference for those affected by cancer. We care! – Do you?\u003c/p\u003e\n\u003cp\u003eThe development team is small but growing and brings a lot of experience across several platforms. You would work along with another Android developer who works part time. The two of you would be considered the experts on all Android issues and there's a lot of opportunity to have a large impact within the team and the product. Our product is centered around the native Android and iOS Apps with tight integration into the mobile operating system.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eTasks\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eImplement new features and adopt existing features of the Android version of the Mika App\nWork closely with product management, design, the tech lead and the other members of the development team to carry the vision \u0026amp; business goals into the Android version of the Mika App\nCoordinate with the data science team to integrate analytics into the App\nManage submission and release processes to the Play Store infrastructure\nInterface with external DevOps team to manage services supporting new features\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eRequirements\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eRequired tech skills\u003c/em\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExpert knowledge of Fragment lifecycle, state handling, ViewModel/SavedStateViewModel\u003c/li\u003e\n\u003cli\u003eVery good knowledge of Jetpack Navigation and Safe Args\u003c/li\u003e\n\u003cli\u003eGeneral knowledge of the AndroidX ecosystem\u003c/li\u003e\n\u003cli\u003eBe able to design with composition over inheritance\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cem\u003eNice to have tech skills\u003c/em\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eRetrofit + Gson or Jackson\u003c/li\u003e\n\u003cli\u003eAndroid View Binding\u003c/li\u003e\n\u003cli\u003eRxJava (we only use a limited subset)\u003c/li\u003e\n\u003cli\u003eStructuring projects with multiple Gradle modules\u003c/li\u003e\n\u003cli\u003eCreate custom views, themes, and adapt Material Components for Android\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eBenefits\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eTech-wise:\u003c/em\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eChoice of programming language Java or Kotlin\u003c/li\u003e\n\u003cli\u003eDevelop new features with Jetpack Compose once out of beta if you like\u003c/li\u003e\n\u003cli\u003eModular App with minimal dependencies between modules\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cem\u003eCompany-wise:\u003c/em\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eA dynamic environment in which you can make an important contribution to improving cancer care\u003c/li\u003e\n\u003cli\u003eFlat hierarchies, teamwork, an international team and transparent communication\u003c/li\u003e\n\u003cli\u003eAn awesome workplace at the center of Berlin-Mitte (but also the possibility to work from home) and an environment to change people’s lives\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eDoes this sound exciting to you? Do you want to join a dedicated and fast-growing company with the vision to improve patients’ lives? Send your application via join dot mika dot com\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWe are looking forward to getting to know you!\u003c/strong\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://mika.join.com/jobs/2224385-senior-android-developer-f-m-d-permanent-and-full-or-part-time-in-berlin?pid=357a3b4531918760973f\u0026amp;oid=3cfa0ba2-0154-453b-b3fd-9008dad5a2d7\u0026amp;utm_source=github_jobs\u0026amp;utm_medium=paid\u0026amp;utm_campaign=single%2Bposting\u0026amp;utm_content=senior%2Bandroid%2Bdeveloper%2Bf%2Bm%2Bd%2B-%2Bpermanent%2Band%2Bfull%2Bor%2Bpart%2Btime%2Bin%2Bberlin\"\u003ehttps://mika.join.com/jobs/2224385-senior-android-developer-f-m-d-permanent-and-full-or-part-time-in-berlin?pid=357a3b4531918760973f\u0026amp;oid=3cfa0ba2-0154-453b-b3fd-9008dad5a2d7\u0026amp;utm_source=github_jobs\u0026amp;utm_medium=paid\u0026amp;utm_campaign=single%2Bposting\u0026amp;utm_content=senior%2Bandroid%2Bdeveloper%2Bf%2Bm%2Bd%2B-%2Bpermanent%2Band%2Bfull%2Bor%2Bpart%2Btime%2Bin%2Bberlin\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://web.archive.org/web/20210507025928/https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcG1pIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--cc9f8389941fef3a1a3782fce041f35aeafbac1e/mika-logo-xl.png"},{"id":"44093067-2f94-447f-bd96-15c6652b808d","type":"Full Time","url":"https://web.archive.org/web/20210507025928/https://jobs.github.com/positions/44093067-2f94-447f-bd96-15c6652b808d","created_at":"Tue May 04 10:07:08 UTC 2021","company":"Voodoo.io","company_url":"https://web.archive.org/web/20210507025928/https://www.voodoo.io/","location":"Paris (Full remote from FR/SP/NL/GE/UK)","title":"Senior Backend Engineer (Node.js/AWS)","description":"\u003cp\u003eVoodoo is a Tech company that creates and publishes hyper-casual and casual mobile games for a wide audience. It is the worldwide leader in the mobile game market through snackable, innovative, and creative content combining data and new technologies.\u003c/p\u003e\n\u003cp\u003eThe company raised $200M in 2018 and we have been certified a Great Place to Work France 2020 and 2021. In 2020, Tencent became a minority stakeholder in Voodoo, with a role in framing our strategy to dominate the Asia Pacific region.\u003c/p\u003e\n\u003cp\u003e#1 worldwide in mobile game downloads, and regularly at the top of the App Store rankings, our games have about 300 million monthly active users and more than 5 billion downloads since our creation. Voodoo is one of the most impressive examples of hypergrowth in the ecosystem, having multiplied its turnover by 5 over the past few years.\u003c/p\u003e\n\u003cp\u003eWith more than 300 employees around the world, we would love you to apply to join an ambitious, innovative, and international company!\u003c/p\u003e\n\u003cp\u003eWhat is Voodoo’s Culture all about?\nWe recruit passionate and creative profiles, who combine data and new technologies to disrupt the mobile market. Driven by a test-and-learn culture, we welcome wonderfully talented people wishing to undertake and manage unique, ambitious, and challenging projects. Our goal is to foster excellence, both individual and communal, which to us means solving problems by breaking the rules, learning fast and autonomously, and delivering with the best execution.\u003c/p\u003e\n\u003cp\u003eBefore applying, you need to know that the company’s culture is very important to us. Our employees evolve within an environment designed to be a center for fulfillment. Daily life at Voodoo is characterized by numerous events throughout the year that allow you to feel fully integrated into the team and get involved in creative and innovative projects. Among them: onboarding programs, our annual global summit, other company-wide events, hackathons, game jams, wellness events, and more.\u003c/p\u003e\n\u003cp\u003eWhat will be your main challenges?\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDesign \u0026amp; build business-focused backend applications in an innovative and evolving environment\u003c/li\u003e\n\u003cli\u003eTake full ownership of what you do, bringing creativity and helpfulness to your team and the business every day\u003c/li\u003e\n\u003cli\u003eThink without limits and consistently nurture innovation, while solving complex problems\u003c/li\u003e\n\u003cli\u003eBring new and creative approaches in technology into varied problem domains, as a member of an effective and collaborative team\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWhat is your team about?\nThis year, Voodoo is focusing on tech recruitment. When it comes to growth, several bottlenecks we’ve previously experienced involve the projects that our tech teams are working on every day, such as our brand new publishing platform designed to support studios and game launches, our marketing performance and optimization systems based on machine learning, and improving the attractiveness of our games and user retention, all of which we approach using internal data collecting solutions, analysis, and A/B testing.\u003c/p\u003e\n\u003cp\u003eBased on our principles and values, you will have the opportunity to join our strong Growth \u0026amp; Engineering department, composed of around 60 people.  Be a part of a small, independent, helpful, and high-performing team of Software Engineers. Come and work with us to solve complex problems using top-of-the-range technology. You will take full ownership of your role and strive for excellence to deliver innovative and creative projects.\u003c/p\u003e\n\u003cp\u003eDoes this sound like you?\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eYou love what you do, you are able to collaborate effectively and enjoy building lasting partnerships\u003c/li\u003e\n\u003cli\u003eYou have well-practiced experience building backend applications\u003c/li\u003e\n\u003cli\u003eYou have experience with Node.js or Python and Node.js, and a desire to work with Node.js extensively\u003c/li\u003e\n\u003cli\u003eYou are eager to learn new skills and code using new languages\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWhat do we expect?\nYou above! But you will either need experience with the following, or a desire to learn, as this is what you would work with. We don’t expect you to be perfect, because neither are we.\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eAWS cloud hosting with regular ongoing use of EC2, RDS, DynamoDB, S3, ECS, EKS, Route53 and Lambda\u003c/li\u003e\n\u003cli\u003eDevOps/CI is implemented using CircleCI, Airflow, Git (GitHub), Docker/Kubernetes, Prometheus, and Grafana\u003c/li\u003e\n\u003cli\u003eEmphasis is placed on CI/CD\u003c/li\u003e\n\u003cli\u003ePersistent databases are both RDBMS and NoSql and normally implemented via RDS or DynamoDB\u003c/li\u003e\n\u003cli\u003eCaching is implemented via Redis and Memcached\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWhat do we offer for this role?\nCompetitive salary (of course) ⧫ Free shares ⧫ Remote days ⧫ Lunch card ⧫ Wellness activities ⧫ Hackathon ⧫ Grant for Purchase of a Bike ⧫ Seminars ⧫ Global Summit\u003c/p\u003e\n\u003cp\u003eThe salary will depend on the experience and skills a candidate brings to the position in line with the levels outlined in the Voodoo Career Path.\u003c/p\u003e\n\u003cp\u003eWe are offering all Voodoo members of staff a flexible vacation policy, allowing us to take as many paid days off as we need as long as the work is done and objectives are complete.\u003c/p\u003e\n\u003cp\u003eWhat is our recruitment process?\nOur recruitment process typically includes a call with our recruitment team, as well as interviews with your future manager, leadership, and team members focusing on job and values fit. Lastly, our culture of leveraging test and case studies is an integral part of the recruitment process and will be featured at some point in your process.\u003c/p\u003e\n\u003cp\u003eDoes this sound like it was written with you in mind? Excellent! Put in your application and let’s discuss the possibilities!\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://jobs.lever.co/voodoo/c26a280b-2bc0-4fec-bfe0-86eb33755d7c?lever-origin=applied\u0026amp;lever-source%5B%5D=GitHub\"\u003ehttps://jobs.lever.co/voodoo/c26a280b-2bc0-4fec-bfe0-86eb33755d7c?lever-origin=applied\u0026amp;lever-source%5B%5D=GitHub\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://web.archive.org/web/20210507025928/https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBb3FpIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--417cc7eb0e6bc6e4dec92ba9ce5c76c77630428a/logo-voodoo-black-1080x1080.png"},{"id":"611223ac-af5c-4601-b284-3670bfb5d0ea","type":"Full Time","url":"https://web.archive.org/web/20210507025928/https://jobs.github.com/positions/611223ac-af5c-4601-b284-3670bfb5d0ea","created_at":"Wed May 05 00:55:47 UTC 2021","company":"Hello World","company_url":"https://web.archive.org/web/20210507025928/https://www.gethello.org/","location":"United States","title":"Senior Software Engineer, Fullstack (U.S. Based Only, 100% Remote)","description":"\u003cp\u003eWe’re looking for generalists who can dive in wherever needed, including frontend, backend, and some light data work. At our current stage, we’re light on process, so you should enjoy working with a high-level of autonomy and decision-making authority.\u003c/p\u003e\n\u003cp\u003eRead more \u003ca href=\"https://www.gethello.org/post/hello-worlds-unique-engineering-culture\"\u003ehttps://www.gethello.org/post/hello-worlds-unique-engineering-culture\u003c/a\u003e on Hello World's Unique Engineering Culture.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eYour Role\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eWrite code across our stack, including our mobile React Native clients and Rails backend\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eEnsure that our app works globally, including constrained environments such as low power devices or spotty connectivity\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eTackle challenging design and product problems\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eCollaborate with our CTO to architect and evolve a solution that scales. Our tech stack uses Typescript + React Native on the frontend with a light Rails + GraphQL backend running on App Engine. We're still early and nothing is set in stone, so there's lots of room to craft and improve our stack.\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eProvide thoughtful feedback to others on the team\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eHelp create a world-class engineering team and culture that is diverse from day one\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eSome examples of the problems we need your help to solve\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eHow do we showcase the talents of teens around the world in a simple “portfolio” to maximize their chances of finding opportunities?\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eHow can we ensure that uploading videos in our app is as reliable as uploads to YouTube in areas with metered data and poor connectivity?\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eHow can we rapidly build tools to allow scholarships and other opportunities to quickly identify promising teens on our platform?\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eYour Perks \u0026amp; Culture\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eWork on a product with impact, with a high level of autonomy, and solving problems for a global audience\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eWork on a team with a transparent pay structure with equal pay for equal roles (no bias, no behind-the-scenes negotiations)\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eReceive medical, dental, and vision + life insurance\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eUnlimited vacation and generous sick day policies\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eRemote-first organization\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eCompensation\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe salary for this role is $135,000\u003c/p\u003e\n\u003cp\u003eAt Hello World we celebrate and support our differences. We know employing a team rich in diverse thoughts, experiences, and opinions allows our employees, our product, and our community to flourish. Hello World is an equal opportunity workplace. We are dedicated to equal employment opportunities regardless of race, color, ancestry, religion, sex, national orientation, sexual orientation, age, citizenship, marital status, disability, gender identity, or Veteran status.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eYour Skills \u0026amp; Superpowers\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cp\u003eExperience building mobile experiences (eg. React Native/Flutter/Native)\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003ePassion for validating new features by putting them in front of real users early and often\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eSome experience across both backend and frontend or a desire to learn\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eAbility to operate with a lot of autonomy, pragmatism, and a sense of craftsmanship\u003c/p\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003cp\u003eU.S. based and direct applicants will be considered (no recruiters please)\u003c/p\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003eApply on Hello World \u003ca href=\"https://helloworld.recruitee.com/o/senior-software-engineer-generalist\"\u003ehttps://helloworld.recruitee.com/o/senior-software-engineer-generalist\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://web.archive.org/web/20210507025928/https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcFNpIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--3e8db1a6561be2202382de66c7a3eb86bed5b096/linkedin%20profile-yellow.png"},{"id":"e9ffb97c-3488-435b-9772-90056e300300","type":"Full Time","url":"https://web.archive.org/web/20210507025928/https://jobs.github.com/positions/e9ffb97c-3488-435b-9772-90056e300300","created_at":"Tue May 04 19:06:31 UTC 2021","company":"RAND Corporation","company_url":null,"location":"Santa Monica, CA","title":" Research Software Engineer","description":"\u003cp\u003eThe RAND Corporation seeks an experienced Software Engineer to serve as the Senior Technical Programming Lead supporting RAND’s American Life Panel, the RAND Educator Panels, other online data collection services and other multidisciplinary software development activities.  The Senior Technical Programming Lead will work directly with a team of 3-4 research programmers involved in online survey software development and delivery.\u003c/p\u003e\n\u003cp\u003eThe position requires eliciting requirements from users, designing software products with researchers, implementing designs in code, and iterating with users and researchers to ensure functional and quality requirements are met. Qualified candidates will have demonstrated excellence in client engagement skills and experience recommending technical solutions for software and data migration projects.\u003c/p\u003e\n\u003cp\u003eThe selected candidate will work on project teams of research staff and domain experts and must be comfortable acting as the sole software engineer on the project. Technical needs will vary by project so the selected candidate must be a well-rounded generalist able to develop solutions in more than one of the following application paradigms:  desktop, web, mobile, database, modeling \u0026amp; simulation, big data analytics including machine learning, statistical analysis, and visualization.\u003c/p\u003e\n\u003cp\u003eDuties\u003c/p\u003e\n\u003cp\u003e•Proactive communication with project teams\n•Suggesting technical solutions and providing technical advice to the RAND American Life Panel Director and General Manager on how to best execute complex technical survey design projects.\n•Working closely with a small team of research programmers to program and field online surveys designed in Confirmit to collect primary research data for research purposes. In particular, this role will help implement more complex programming elements in survey designs (API connections, PHP, Javascript, etc.)\n•Developing in part or in whole interactive applications including the graphical user interface to back end server components and databases\n•Providing strategic technical inputs into computer programming and software integration, software transition/migration and software management activities\n•Developing applications or scripts to data mine, analyze, and visualize data sets\n•Briefing others on software design, software development progress, and software tool results\n•Providing programming time estimates for proposals and client budgets\n•Participating in software development QA activities\n•Writing documentation of software and software tool results for inclusion in customer briefings and RAND publications\u003c/p\u003e\n\u003cp\u003eBasic Qualifications\u003c/p\u003e\n\u003cp\u003e•Expertise with multiple web programming languages including JAVASCRIPT, PHP, or PYTHON\n•Expertise with at least one database platform such as MONGODB, MYSQL, or POSTGRES\n•Working knowledge of object oriented analysis and design\n•Some expertise in PYTHON, JAVA, C#, R,  C++, OR C\n•Willingness to pick up new technologies on a frequent basis\n•Software testing including unit, integration, and acceptance testing\n•Excellent written and verbal communication skills\n•Works best as part of a collaborative team\u003c/p\u003e\n\u003cp\u003eExperience with:\u003c/p\u003e\n\u003cp\u003e•Server management\n•Web application development\n•UI/UX Design\n•Cloud service providers like AWS or AZURE and tools in those ecosystems\n•Big data analytic platforms like HADOOP or SPARK\u003c/p\u003e\n\u003cp\u003ePreferred Qualifications\u003c/p\u003e\n\u003cp\u003e•Experience working in a research environment\n•Experience with Confirmit survey programming\n•Experience with system administration\u003c/p\u003e\n\u003cp\u003eEducation\u003c/p\u003e\n\u003cp\u003e•BA/BS required, MA/MS preferred, preferably in computer science or highly related field such as information systems, computer engineering, etc.\u003c/p\u003e\n\u003cp\u003eExperience\u003c/p\u003e\n\u003cp\u003e•6 years minimum relevant experience required.  8 or more years relevant experience preferred.\u003c/p\u003e\n\u003cp\u003eLocation\u003c/p\u003e\n\u003cp\u003eSanta Monica, Pittsburgh, Washington D.C., Boston\u003c/p\u003e\n\u003cp\u003eEqual Opportunity Employer: race/color/religion/sex/sexual orientation/gender identity/national origin/disability/vet\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://rand.wd5.myworkdayjobs.com/en-US/External_Career_Site/job/Santa-Monica-CA-Greater-Los-Angeles-Area/Research-Software-Engineer_R539\"\u003ehttps://rand.wd5.myworkdayjobs.com/en-US/External_Career_Site/job/Santa-Monica-CA-Greater-Los-Angeles-Area/Research-Software-Engineer_R539\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://web.archive.org/web/20210507025928/https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcEtpIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--0615fd7a8231ba783ac57ed264bd0872fce30b6b/RAND-90x90.png"},{"id":"8d4ffcf4-e4b8-43c4-92e6-51eb1cbc9dc4","type":"Full Time","url":"https://web.archive.org/web/20210507025928/https://jobs.github.com/positions/8d4ffcf4-e4b8-43c4-92e6-51eb1cbc9dc4","created_at":"Tue May 04 16:27:50 UTC 2021","company":"LORENZ Life Sciences Group","company_url":null,"location":"Frankfurt","title":"(Senior) Cloud Developer (m/w/d) DevOps","description":"\u003cp\u003e\u003cstrong\u003eWer wir sind\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eDie LORENZ Life Sciences Group ist weltweiter Marktführer für Softwarelösungen zum digitalen Austausch zwischen der pharmazeutischen Industrie und nationalen wie internationalen Behörden. Unsere Kunden vertrauen auf das Know-how und Engagement unserer rund 120 Mitarbeiterinnen und Mitarbeiter weltweit, die tagtäglich an der Schnittstelle zwischen Wissenschaft und Technologie erfolgreich agieren. Unsere Produkte steigern die Effizienz des Arzneimittelzulassungsprozesses und tragen unmittelbar dazu bei, notwendige Therapien für Patienten schneller zugänglich zu machen. \u003cstrong\u003eUnterstütze uns dabei, das Leben von Menschen, die auf neue Medikamente und Therapien angewiesen sind, zu verbessern!\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWas Du bei uns machst\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eUnterstützung beim Aufbau und der Weiterentwicklung eines agilen DevOps-Teams\u003c/li\u003e\n\u003cli\u003eKonzeption und Automatisierung schneller, integrierter Prozesse für das bestmögliche Kundenerlebnis\u003c/li\u003e\n\u003cli\u003eDesign, Architektur und Dokumentation der zukünftigen Infrastruktur (Infrastructure as Code)\u003c/li\u003e\n\u003cli\u003eÜberwachung und Verbesserung der virtuellen Infrastruktur und Kundensysteme\u003c/li\u003e\n\u003cli\u003eDefinition von Anforderungen an unsere Infrastruktur sowie an unsere Software-Produkte\u003c/li\u003e\n\u003cli\u003eBetreuung und Weiterentwicklung unserer Cloud-Infrastruktur und /-services\u003c/li\u003e\n\u003cli\u003eEnge Zusammenarbeit mit unseren internationalen Kunden und Kollegen\u003c/li\u003e\n\u003cli\u003eKommunikation von Neuerungen, Strategien und Trainingsmaßnahmen an die Organisation\u003c/li\u003e\n\u003cli\u003eWeiterentwicklung von Softwarevalidierungsprozessen für Cloudanwendungen\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWas wir von Dir erwarten\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eFundierte Kenntnisse im Bereich AWS-Services (z. B. VPC/Networking, RDS, CloudFormation, Lambda, CloudTrail, KMS, S3/EFS, EC2/Docker)\u003c/li\u003e\n\u003cli\u003eGute Kenntnisse in Python, PowerShell und/oder anderen unterstützten Scripting-Sprachen\u003c/li\u003e\n\u003cli\u003eErfahrung im Bereich IT-Security sowie Identity- und Access-Management\u003c/li\u003e\n\u003cli\u003eErfahrung mit Jenkins wünschenswert\u003c/li\u003e\n\u003cli\u003eSchnelle Auffassungsgabe sowie hohe Motivation zur kontinuierlichen Weiterentwicklung\u003c/li\u003e\n\u003cli\u003eSehr gute Deutsch- und Englischkenntnisse in Wort und Schrift\u003c/li\u003e\n\u003cli\u003eErfolgreich abgeschlossenes Studium der (Wirtschafts-) Informatik oder eine vergleichbare Qualifikation\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWen wir suchen\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eNicht alle Anforderungen unserer Anzeige passen auf Dein Profil? Kein Problem: Überzeuge uns, dass Du dennoch der richtige Kandidat für uns bist! Neben Deinen fachlichen Fähigkeiten zählen vor allem Deine persönliche Einstellung und Deine Werte. Wir suchen Kollegen, die hohe Erwartungen an sich selbst und andere haben, sich ständig weiterentwickeln möchten und gerne Verantwortung übernehmen.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eDein Kontakt im Recruiting-Prozess\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eDu hast Fragen zum Bewerbungsprozess? Bitte zögere nicht, uns zu kontaktieren.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://camo.githubusercontent.com/2c0fb211a9074412bfd878f2dacb0c4ece74fd62/68747470733a2f2f742e676f686972696e672e636f6d2f682f66333432663132346565623065373461323531643362663464313631306639333238613863376165396435373139643630353634666266303662353436383030\"\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://t.gohiring.com/h/c337b0f3bbd39bcda8ae8139ff7f937bc1e9349c37802256a5d697d38f8c48d7\"\u003eapplication form\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://web.archive.org/web/20210507025928/https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbytpIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--586dad477fb2aa2a777061008919d4cb4927b917/LORENZ%20Life%20Sciences%20Group.jpg"},{"id":"48b11b3b-2bc1-4027-93f6-2d8813c2d216","type":"Full Time","url":"https://web.archive.org/web/20210507025928/https://jobs.github.com/positions/48b11b3b-2bc1-4027-93f6-2d8813c2d216","created_at":"Tue May 04 07:12:47 UTC 2021","company":"Politie","company_url":"https://web.archive.org/web/20210507025928/http://www.politie.nl","location":"Nieuwegein","title":"senior site reliability engineer","description":"\u003cp\u003e\u003cstrong\u003esenior site reliability engineer\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eVeiligheid staat bij de politie voorop. Zeker als het gaat over informatievoorziening. Daarom werken we met een eigen Big Data private cloud platform. Als ervaren site reliability engineer zorg jij er samen met je collega’s in Nieuwegein voor dat de veiligheid, stabiliteit én schaalbaarheid van dit platform 24/7 geborgd is.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWat ga je doen?\u003c/strong\u003e\nAls ervaren site reliability engineer opereer je op het snijvlak van softwareontwikkeling en platform engineering. Je werkt op topniveau in een zelfstandig DevOps team uitsluitend met open source. Dit gaat verder dan software, GitOps en cloud automation. Denk bijvoorbeeld ook aan open network hardware. En zien we kansen om nog meer te automatiseren? Dan doen we dat.\u003c/p\u003e\n\u003cp\u003eJe stapt in op een interessant moment. Zo zijn we op dit moment druk met de ontwikkeling van een innovatief Kubernetes platform: de volgende stap in de uitbreiding van ons Big Data platform. Hiermee bereiden we ook een volledig hybride Kubernetes container platform voor. Deze combineert public en private cloud en maakt cloud native applicaties schaalbaar en toekomstbestendig. Kortom: in deze veelzijdige functie zit je boven op de innovaties, krijg je alle ruimte om jouw talenten te ontplooien én mee te bouwen aan een state of the art IT omgeving voor de politie.\u003c/p\u003e\n\u003cp\u003eJouw werkzaamheden op een rij:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eschaalbare, veilige en stabiele systemen ontwikkelen en beheren;\u003c/li\u003e\n\u003cli\u003eincidenten onderzoeken en hier performance analyses van maken;\u003c/li\u003e\n\u003cli\u003everbeteringen voorstellen en implementeren;\u003c/li\u003e\n\u003cli\u003eprestaties en de efficiency van systemen monitoren;\u003c/li\u003e\n\u003cli\u003erisico’s inventariseren én managen;\u003c/li\u003e\n\u003cli\u003etaken automatiseren en hier servicetools voor bouwen;\u003c/li\u003e\n\u003cli\u003elogs en testomgevingen bouwen;\u003c/li\u003e\n\u003cli\u003etools selecteren;\u003c/li\u003e\n\u003cli\u003een systemen aanpassen en uitbreiden naar gebruikersaantallen.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWaar ga je werken?\u003c/strong\u003e\nJe gaat aan de slag voor een van de vijf DevOps teams binnen de productlijn Cloud en Big Data in Nieuwegein. Deze teams bestaan uit gedreven netwerk- en cloud platform engineers en big data- en software engineers. We werken zeer zelfstandig en weten onze diverse expertises goed te verenigen in de multidisciplinaire teams. Ook nu we thuiswerken blijven we betrokken en weten we elkaar te vinden om kennis te delen en voor advies. Als site reliability engineer zoek je regelmatig de samenwerking op met andere IT-teams binnen de politie en ben je betrokken bij thema’s die de hele dienst aangaan, zoals veiligheid.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWie ben jij?\u003c/strong\u003e\nVol toewijding maak jij je nieuwe technologieën snel eigen. Samenwerken vind je belangrijk. Je stelt je klantgericht op en werkt ook graag samen met andere afdelingen. Werken in een dynamische en soms hectische omgeving past bij je; jij houdt van de veelzijdigheid die deze baan met zich meebrengt. Verder heb je:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eeen hbo-diploma;\u003c/li\u003e\n\u003cli\u003eruime ervaring met Linux (zoals Ubuntu, Debian, Redhat);\u003c/li\u003e\n\u003cli\u003eervaring met het managen van private en public cloud omgevingen op basis van Kubernetes, OpenStack, AWS of Google Cloud, en in de ontwikkeling, configuratie, deployment, schaalbaarheid en monitoring hiervan;\u003c/li\u003e\n\u003cli\u003ekennis van Hashicorp cloud automation tooling (Consul, Terraform, Nomad of Vault);\u003c/li\u003e\n\u003cli\u003eervaring met open source Cloud Native Computing Foundation (CNCF);\u003c/li\u003e\n\u003cli\u003ekennis van DevOps open source tooling zoals Gitlab, Nexus, Jenkins en Sonar;\u003c/li\u003e\n\u003cli\u003eervaring met development en tuning van big data technologie frameworks waaronder Spark, Elasticsearch, Cassandra, Kafka en MongoDB;\u003c/li\u003e\n\u003cli\u003eervaring met het inrichten van logging via Graylog of ELK en monitoring/metrics via Prometheus en Grafana.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eKun je nog met veel meer relevante technologie en tools overweg? Laat dit dan duidelijk naar voren komen in je motivatiebrief of cv! Wij zijn nieuwsgierig naar jouw kennis en kunde.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWat wij bieden\u003c/strong\u003e\nDe standplaats is Nieuwegein. Er is ruimte voor 2 fte. Het betreft een functie voor 32 tot 36 uur per week. Omdat goede mensen belangrijk zijn binnen de politie investeren we in jouw toekomst. We bieden uitgebreide ontwikkelingsmogelijkheden en een vaste aanstelling, waarbij een proeftijd van één jaar van toepassing is.\u003c/p\u003e\n\u003cp\u003eVerder kun je het volgende van ons verwachten:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eeen bruto maandsalaris van minimaal € 3.502,- en maximaal € 5.228,- (schaal 11 Bbp) op basis van een 36-urige werkweek;\u003c/li\u003e\n\u003cli\u003e8% vakantie- en 8,33% eindejaarsuitkering;\u003c/li\u003e\n\u003cli\u003egoede pensioenregeling en betaald ouderschapsverlof (\u003ca href=\"https://kombijde.politie.nl/vakgebieden/arbeidsvoorwaarden\"\u003emeer info over verlof, regelingen en mogelijkheden\u003c/a\u003e).\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eDe formele functie binnen het functiegebouw van de politie is \u003ca href=\"https://kombijde.politie.nl/binaries/content/assets/academie/lfnp/lfnp61.pdf\"\u003ebedrijfsvoeringspecialist C\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWat verder belangrijk is\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eEen veiligheidsonderzoek P maakt deel uit van de selectieprocedure.\u003c/li\u003e\n\u003cli\u003eOp dit moment werken we volledig thuis. Natuurlijk zorgen we dat jij als nieuwe collega op een goede manier van start kunt.\u003c/li\u003e\n\u003cli\u003eZonder IT'ers zijn we nergens. Ben jij expert in IT? Lees alles over o.a. data science, legaal hacken of cybersecurity en test je digitale skills in de Cybercrime Challenge op \u003ca href=\"http://it.kombijdepolitie.nl/\"\u003ehttp://it.kombijdepolitie.nl/\u003c/a\u003e\n\u003c/li\u003e\n\u003cli\u003eDe politie zet in op vernieuwing en cultuurverschillen binnen teams. Divers samengestelde teams presteren beter. Daarom werken we hard aan een open en veilige cultuur waarin divers talent tot bloei komt.\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003eBel of mail met Jolandi Schreuder, ICT recruiter (06 - 18 16 38 88, \u003ca href=\"jolandi.schreuder@politie.nl\"\u003ejolandi.schreuder@politie.nl\u003c/a\u003e) als je meer informatie wilt hebben.\u003c/p\u003e\n\u003cp\u003eSolliciteer uiterlijk 31 mei 2021 via de \u003cstrong\u003e\u003ca href=\"https://kombijde.politie.nl/vacatures/senior-site-reliability-engineer_2657291.html?utm_source=adveronline\u0026amp;utm_medium=paid\u0026amp;utm_content=vacature-alert\u0026amp;utm_campaign=niet-initieel-senior-site\u0026amp;utm_term=44319\"\u003esollicitatiebutton\u003c/a\u003e\u003c/strong\u003e.\u003c/p\u003e\n","company_logo":"https://web.archive.org/web/20210507025928/https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBb2lpIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--763101db87bb95aaf69e0e4169d867a603013a1a/logo%202021%20blauw.jpg"},{"id":"97ead246-d95f-45b0-886a-4391721fb114","type":"Full Time","url":"https://web.archive.org/web/20210507025928/https://jobs.github.com/positions/97ead246-d95f-45b0-886a-4391721fb114","created_at":"Mon May 03 15:24:53 UTC 2021","company":"European IT Consultancy EITCO GmbH","company_url":"https://web.archive.org/web/20210507025928/https://www.eitco.de/","location":"Bonn","title":"DevOps Engineer (m/w/d)","description":"\u003cp\u003eWir bei EITCO entwickeln IT-Lösungen, die Arbeitsabläufe und Geschäftsprozesse intelligent und wirksam verbessern.\u003c/p\u003e\n\u003cp\u003eDie Zufriedenheit unserer Kunden und Partner steht bei EITCO ebenso im Mittelpunkt wie das Wohlbefinden unserer Mitarbeiter.\u003c/p\u003e\n\u003cp\u003eAls mittelständisches Dienstleistungsunternehmen sind wir stolz auf unsere flache Hierarchie, die flexiblen Arbeitsbedingungen sowie unsere wertschätzende und familiäre Atmosphäre.\u003c/p\u003e\n\u003cp\u003eDies ist die Basis unserer Leistungsfähigkeit, mit der wir seit vielen Jahren erfolgreich am Markt sind.\u003c/p\u003e\n\u003cp\u003e\u003ca href=\"https://www.eitco.de\"\u003ehttps://www.eitco.de\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWir suchen\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eFür unser Application Management Team suchen wir ab sofort einen DevOps Engineer (m/w/d) für Systemintegration zur Festanstellung in Vollzeit, der die Schnittstelle zwischen Systemtechnik, Anwendungsentwicklung und Fachabteilung bildet.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eDeine Position\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBetreuung der Anwendung im Betrieb\u003c/li\u003e\n\u003cli\u003eVerantwortung für den Applikationsbetrieb, u.a. Überwachung Installationen und Fortführung\u003c/li\u003e\n\u003cli\u003eAnpassung des Servicedesigns des Verfahrens, z.B. bei Änderung der Parameter sowie Anpassungen der Architektur\u003c/li\u003e\n\u003cli\u003eVerantwortung für den Betrieb der Anwendung\u003c/li\u003e\n\u003cli\u003eSteuerung des Rollouts von Releases\u003c/li\u003e\n\u003cli\u003eBewertung von Changes, z.B. die technische Umsetzung von fachlichen Änderungen bei der Entwicklung und deren Auswirkung auf den Applikationsbetrieb\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eUnsere Technologien\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eLinux (SLES, CentOS, Ubuntu)\u003c/li\u003e\n\u003cli\u003eAutomatisierung / Konfigurationsmanagement (Puppet)\u003c/li\u003e\n\u003cli\u003eVersionsverwaltung (git)\u003c/li\u003e\n\u003cli\u003eSkriptsprachen (bash, ruby, powershell)\u003c/li\u003e\n\u003cli\u003eJava-Applicationserver (Tomcat)\u003c/li\u003e\n\u003cli\u003eMessage Broker (Apache ActiveMQ)\u003c/li\u003e\n\u003cli\u003eRDBMS (PostgreSQL, MariaDB/MySQL, MS SQL)\u003c/li\u003e\n\u003cli\u003eMonitoring (Nagios, Prometheus)\u003c/li\u003e\n\u003cli\u003eESB (Apache Karaf / Camel)\u003c/li\u003e\n\u003cli\u003eVirtualisierung (Virtualbox / vagrant, VmWare)\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eDein Profil\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDu bist vertraut mit Open Source Projekten und der Linux-Welt\u003c/li\u003e\n\u003cli\u003eEin sicherer Umgang mit Apache Tomcat und diverser Middleware ist für dich kein Problem\u003c/li\u003e\n\u003cli\u003eideal: Betreuung verteilter Systeme\u003c/li\u003e\n\u003cli\u003eideal: Du hast Puppet-Kenntnisse\u003c/li\u003e\n\u003cli\u003eTeamgeist und Kommunikationsbereitschaft ist für dich selbstverständlich\u003c/li\u003e\n\u003cli\u003eMindestens 1-2 Jahre Berufserfahrung oder Berufs-/ Quereinstieg\u003c/li\u003e\n\u003cli\u003eDeutsch auf muttersprachlichem Niveau und gute Englischkenntnisse in Wort und Schrift\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWarum wir?\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e(Familien-) Freundliche Arbeitsatmosphäre\u003c/li\u003e\n\u003cli\u003eFlache Hierachien und kurze Entscheidungswege\u003c/li\u003e\n\u003cli\u003eWeiterbildungsmöglichkeiten\u003c/li\u003e\n\u003cli\u003eCommunity of Practice\u003c/li\u003e\n\u003cli\u003eMonatlicher OpenFriday mit Beiträgen aller Mitarbeitenden\u003c/li\u003e\n\u003cli\u003eFlexible Arbeitszeiten mit Gleitzeit\u003c/li\u003e\n\u003cli\u003e30 Tage Urlaub\u003c/li\u003e\n\u003cli\u003eBetriebliches Gesundheitsmanagement mit Betriebssport, Fitnessstudios und Leasingfahrrädern\u003c/li\u003e\n\u003cli\u003eMitarbeiterbenefits\u003c/li\u003e\n\u003cli\u003eEinarbeitung mit eigenem Paten\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eKontakt\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eDeine Ansprechpartnerin:\u003c/p\u003e\n\u003cp\u003eMeike Bodemann, HR Manager/Management Assistent\nEuropean IT Consultancy EITCO GmbH\nFon +49 (228) 338 881 150\u003c/p\u003e\n\u003cp\u003eStandorte:\nBerlin, Potsdamer Platz 10, 10785 Berlin\nBonn, Am Bonner Bogen 6, 53227 Bonn\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://camo.githubusercontent.com/ad85f3b158046ea552723b2582c965af672b09a8/68747470733a2f2f742e676f686972696e672e636f6d2f682f61323863333636643863663666626265353439386133356333666333343834323938383266323330376537666461393230323334303636393632306361393434\"\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://t.gohiring.com/h/3bb41fdbb4899f3f9329057770fc8f026107a43412590e6918d303484e3d4ef0\"\u003eapplication form\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://web.archive.org/web/20210507025928/https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBb1dpIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--379ae72ab212eb27d8ba70803b487b0bd0ca3e34/European%20IT%20Consultancy%20EITCO%20GmbH.png"},{"id":"d05e4007-8114-4804-9694-ddfd26aa111e","type":"Full Time","url":"https://web.archive.org/web/20210507025928/https://jobs.github.com/positions/d05e4007-8114-4804-9694-ddfd26aa111e","created_at":"Mon May 03 15:17:32 UTC 2021","company":"Civey GmbH","company_url":"https://web.archive.org/web/20210507025928/https://civey.com/","location":"Berlin","title":"Senior JavaScript Engineer (m/f/x) in full- or part-time","description":"\u003cp\u003e\u003cstrong\u003eYour new Job\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eYou continuously improve the frontend of Civey together with our team\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eYou develop, test, document and maintain our JS driven web applications. We strive to ensure code quality with reviews, pair-programming and alignment with strong engineering principles and standards.\u003c/li\u003e\n\u003cli\u003eAs part of the Dev Team, you get to work closely with our Devops Engineers, Data Engineers, Product Owners and Designers.\u003c/li\u003e\n\u003cli\u003eOur source code is hosted on GitHub and our libraries are hosted as private npm modules. We do code reviews with pull requests, we do automated testing and our release process is fully automated by our CI/CD system.\u003c/li\u003e\n\u003cli\u003eYour work will be seen by millions of visitors through our partners’ websites, including top German media outlets like Spiegel Online, Tagesspiegel, \u003ca href=\"http://change.org/\"\u003eChange.org\u003c/a\u003e, Die Welt and a lot more.\u003c/li\u003e\n\u003cli\u003eYou will work with an excellent team you can learn a lot from and that will always appreciate your ideas.\u003c/li\u003e\n\u003cli\u003eYou start in full-time or part-time (30h+ per week).\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eCivey is the leading company for digital opinion data in Germany\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eCivey represents a new generation of public opinion research. Instead of outdated methods we rely on digital technologies to pioneer high quality representative surveys in real time. Our vision is to enable everyone to access the results of our work.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eOur clients and public benefit from our technology\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe are the only provider to offer over one million active users per month immediate access to representative live data. Customers from different backgrounds such as politics, business and media benefit from an innovative synthesis of survey statistics and machine learning. We enable them to measure markets, consumption and attitudes around the clock in order to collect valid data for the smallest target groups. In doing so, we set new standards for precision and speed.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eNow we are looking for you!\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThis is just the beginning. Founded in 2015 by Janina Mütze and Gerrit Richter more than 60 consultants, developers and statisticians from 12 Countries are currently working for Civey in Berlin. If you want to help transform the path of traditional opinion research and you live for new technologies, then we are looking for you. You should be able to work independently in a structured manner and have the ambition to achieve more than others. Does that sound good? Get in touch with us!\u003c/p\u003e\n\u003cp\u003eLearn more about Civey and its team at \u003ca href=\"http://t3u1.mjt.lu/lnk/AMwAAKCTIpAAAAAAAAAAAG3sWXAAAAAA-nQAAAAAAAZPNgBgj73iGHcqtsfGQeuTzv6vQfq6YAAGCXo/2/cSxFs1KzOefTLOB5urXe9A/aHR0cDovL3d3dy5jaXZleS5jb20vdWViZXItY2l2ZXkvam9icy11bmQtdGVhbQ\"\u003ewww.civey.com/ueber-civey/jobs-und-team\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eYour Talents\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eYou are great at building data-rich web applications and are curious about the latest techniques in your field.\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eYou have at least 5 years of experience in  building highly functional and fast, data-rich SPAs with dynamic interfaces.\u003c/li\u003e\n\u003cli\u003eYou have strong Typescript and React skills and are comfortable using the best coding, testing, debugging, and automation techniques.\u003c/li\u003e\n\u003cli\u003eYou have experience working as a developer and can provide good insights on the trade-offs between frontend JS frameworks like React, Vue, Svelte etc.\u003c/li\u003e\n\u003cli\u003eYou have an eye for UI/UX and accessibility and you're familiar with the challenges of modern web development.\u003c/li\u003e\n\u003cli\u003eYou have worked with node.js before to build the backend for a web application and know how to talk to a database or are interested in learning about this aspect of web development.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eYour Package\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWe are offering more than just benefits\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\n\u003cstrong\u003eOur values:\u003c/strong\u003e We’re combining a conclusive business model with our vision to give all people access to high-quality opinion research.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eInternational:\u003c/strong\u003e Our team is from China, Brasil, Germany, Vietnam and many other countries. Those who want can join our weekly German course.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eVisa support:\u003c/strong\u003e We support our candidates throughout the whole visa process.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003ePersonal development:\u003c/strong\u003e We promise a steep learning curve and an opportunity to boost your career.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eEquality:\u003c/strong\u003e We are an equal opportunity employer and encourage everyone, regardless of gender, nationality, sexual orientation, age, ethnicity or belief to apply at Civey.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eFair deal:\u003c/strong\u003e We’ve devoted ourselves to fairness and transparency - this is why we foster a culture of constructive criticism. In return, we ask for your full commitment.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eGreat location:\u003c/strong\u003e Our office is located between Mitte and Kreuzberg, close to Moritzplatz.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eTraining:\u003c/strong\u003e We cover 90% of the costs of books, conferences and workshops.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eSports and transportation:\u003c/strong\u003e We cover your gym contract, your public transport ticket or a company bike.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eMental health:\u003c/strong\u003e You get professional support through an independent expert for personal or professional challenges.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003ePension plan:\u003c/strong\u003e You can invest in your future with our company pension plan and capital-forming benefits.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eGood start into the day:\u003c/strong\u003e We offer you breakfast, healthy fruits, free drinks and fresh coffee.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eTeam Events:\u003c/strong\u003e Celebrate with your colleagues on a regular basis.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eTechnical equipment:\u003c/strong\u003e We’ll provide you with the equipment you need to be able to work efficiently.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eAsk-me-Anything:\u003c/strong\u003e Every employee can anonymously ask questions that our founders answer publicly.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eClear structure:\u003c/strong\u003e We have a proven feedback system consisting of stand-ups, review meetings and retrospectives.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eRecreation:\u003c/strong\u003e We offer 30 days vacation, flexible working hours, overtime compensation and home office if needed.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eSalary:\u003c/strong\u003e We will pay you a fair and competitive compensation.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eGet in touch\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eFor any questions about this position please get in touch with our Talent Manager Freyja Werner at \u003ca href=\"mailto:jobs@civey.com\"\u003ejobs@civey.com\u003c/a\u003e. Or learn more about Civey and its team at \u003ca href=\"http://t3u1.mjt.lu/lnk/AMwAAKCTIpAAAAAAAAAAAG3sWXAAAAAA-nQAAAAAAAZPNgBgj73iGHcqtsfGQeuTzv6vQfq6YAAGCXo/3/D4xbqEL2uzpX3WRXlHQNiQ/aHR0cDovL3d3dy5jaXZleS5jb20vdWViZXItY2l2ZXkvam9icy11bmQtdGVhbQ\"\u003ewww.civey.com/ueber-civey/jobs-und-team\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://camo.githubusercontent.com/214ca06c67c59aca8fa1c7a8f579a5d674816e60/68747470733a2f2f742e676f686972696e672e636f6d2f682f37333037313636393535356637643033643535386634646562353161646333623630666464396637656530393236343865396561646134393938303866383466\"\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://t.gohiring.com/h/73d6a003b49d5745e59850ec423cb707f3c3978d72a12ed4fcd874c6e27692e9\"\u003eapplication form\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://web.archive.org/web/20210507025928/https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBb09pIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--d5cb13026fa0a09eb93feb4916cd9524c83f4177/Civey%20GmbH.png"},{"id":"421871bb-05d3-4fbe-b00c-3f372fa35584","type":"Full Time","url":"https://web.archive.org/web/20210507025928/https://jobs.github.com/positions/421871bb-05d3-4fbe-b00c-3f372fa35584","created_at":"Tue Aug 04 17:23:12 UTC 2020","company":"Sticker Mule","company_url":"https://web.archive.org/web/20210507025928/https://www.stickermule.com/careers","location":"Anywhere","title":"Javascript Engineer","description":"\u003cp\u003e\u003cstrong\u003eAbout Sticker Mule\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eSticker Mule is the Internet's most \"kick ass\" brand. We are privately-owned, profitable, and powered by a  globally distributed team who cares deeply about delivering a great customer experience at the highest technical standards. Our software team operates from 17 countries, and we're always looking for more exceptional engineers.\u003c/p\u003e\n\u003cp\u003eThe Software team is responsible for building and maintaining our front-end and back-end services, developing new features and products, and troubleshooting problems.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u003ca href=\"https://www.stickermule.com/about\"\u003eSee more about our teams here\u003c/a\u003e\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWe offer\u003c/strong\u003e\u003c/p\u003e\n\u003col\u003e\n\u003cli\u003eRemote work with flexible schedules\u003c/li\u003e\n\u003cli\u003eVaried, interesting technical challenges to solve\u003c/li\u003e\n\u003cli\u003eA fun \"no bullshit\" work environment\u003c/li\u003e\n\u003c/ol\u003e\n\u003cp\u003e\u003cstrong\u003eWe like you to know\u003c/strong\u003e\u003c/p\u003e\n\u003col\u003e\n\u003cli\u003eDocker\u003c/li\u003e\n\u003cli\u003eNextJS\u003c/li\u003e\n\u003cli\u003eReact\u003c/li\u003e\n\u003cli\u003eNodeJS\u003c/li\u003e\n\u003cli\u003eGraphQL\u003c/li\u003e\n\u003cli\u003ePostgres\u003c/li\u003e\n\u003cli\u003eRedis\u003c/li\u003e\n\u003cli\u003eFamiliarity with Ruby\u003c/li\u003e\n\u003cli\u003eExcellent communication skills (English)\u003c/li\u003e\n\u003cli\u003eDegree in Computer Science or equivalent practical experience\u003c/li\u003e\n\u003c/ol\u003e\n\u003cp\u003e\u003cstrong\u003eChallenges\u003c/strong\u003e\u003c/p\u003e\n\u003col\u003e\n\u003cli\u003eImprove and expand our React shared components gallery\u003c/li\u003e\n\u003cli\u003eMigrate a large Rails code base to JavaScript front-ends and back-ends\u003c/li\u003e\n\u003cli\u003eMaintain optimal front-end performance on desktop and mobile\u003c/li\u003e\n\u003c/ol\u003e\n\u003cp\u003e\u003cstrong\u003eCompensation and benefits\u003c/strong\u003e\u003c/p\u003e\n\u003col\u003e\n\u003cli\u003e$99,000-$135,000+\u003c/li\u003e\n\u003cli\u003e$10,000 signing bonus\u003c/li\u003e\n\u003cli\u003e4 weeks vacation\u003c/li\u003e\n\u003c/ol\u003e\n","how_to_apply":"\u003cp\u003e\u003cstrong\u003eApply here only:\u003c/strong\u003e \u003ca href=\"https://www.stickermule.com/career/7e6bb5ee-9953-4d46-b008-77a3bbc4ee29\"\u003ehttps://www.stickermule.com/career/7e6bb5ee-9953-4d46-b008-77a3bbc4ee29\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://web.archive.org/web/20210507025928/https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBb3VIIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--04344d944b21465d33ecd7bd62098692640a8658/herman%206.jpg"},{"id":"c67453f4-630b-437d-9d11-ff530e56ce6a","type":"Full Time","url":"https://web.archive.org/web/20210507025928/https://jobs.github.com/positions/c67453f4-630b-437d-9d11-ff530e56ce6a","created_at":"Mon May 03 11:58:53 UTC 2021","company":"DCI Digital Career Institute","company_url":"https://web.archive.org/web/20210507025928/https://digitalcareerinstitute.org","location":"Remote, Germany","title":"Python Development Virtual Lecturer (m/f/d)","description":"\u003cp\u003e\u003cstrong\u003eYour Tasks\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe are looking for a virtual lecturer (m/f/d) for our Python Development courses germany-wide.\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eYou teach the contents of our curriculum to your students comfortably from home\u003c/li\u003e\n\u003cli\u003eOur curriculum includes following back-end technologies: \u003cem\u003ePython\u003c/em\u003e, \u003cem\u003eDjango\u003c/em\u003e, \u003cem\u003eEmployability Skills and Event Sessions\u003c/em\u003e\n\u003c/li\u003e\n\u003cli\u003eYou create appealing content, lessons, exercises and mini-projects for our Python development courses and so you stay up to date\u003c/li\u003e\n\u003cli\u003eOur curriculum offers you a framework with ready-made content\u003c/li\u003e\n\u003cli\u003eYou motivate and empower your students from all over the world in the career-preparatory development process up to the successful graduation\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eYour Skills\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eYou are a passionate programmer and want to share your knowledge\u003c/li\u003e\n\u003cli\u003eYou already have several years experience in Python\u003c/li\u003e\n\u003cli\u003eYou have knowledge of Spring, Hibernate and PostreSQL or willing to learn them at short notice.\u003c/li\u003e\n\u003cli\u003eIdeally, you already have some experience in teaching, tutorials, private lessons or as a consultant\u003c/li\u003e\n\u003cli\u003eYou have a very good English Skills, German is a plus\u003c/li\u003e\n\u003cli\u003eExperience in Cloud Computing, JavScript, React or HTML is nice to have\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eYour Benefits\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eA lot of responsibility and creative freedom in a dynamic learning environment with a startup atmosphere in a regionally growing company.\u003c/li\u003e\n\u003cli\u003eCollaboration with an international team that values diversity, humor, team spirit and mutual support and appreciation.\u003c/li\u003e\n\u003cli\u003eIntensive onboarding and development opportunities through regular feedback, training and coaching.\u003c/li\u003e\n\u003cli\u003eBe part of a valuable mission and responsible task, because through education we offer people a perspective.\u003c/li\u003e\n\u003cli\u003eVarious team events and parties (also virtual), employee discounts (corporate benefits) and free sports activities also welcome you.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eAbout us\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAt the Digital Career Institute gGmbH, we have set ourselves the goal of becoming the talent factory for young professionals in the booming digital industry. Since 2016, we have been making a sustainable contribution in the area of training and continuing education, and we already have four locations: Berlin, Hamburg, Düsseldorf and Leipzig.  From the original initiative to create new future prospects for Refugees, we have developed into an established tech institute for people of all nationalities and backgrounds. Together with our highly qualified team of lecturers and management, we are all working on one mission: To offer the best possible training for interested people to enable them to start a job in the digital industry.  As a team, we celebrate successes together and you can be a part of it. Shape the digital future with us! We are looking forward to your application!\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://digitalcareerinstitute.join.com/jobs/2170772-python-development-virtual-lecturer-m-f-d?pid=357a3b4531918760973f\u0026amp;oid=05429ed5-36a1-4f2f-aac7-707952e9f556\u0026amp;utm_source=github_jobs\u0026amp;utm_medium=paid\u0026amp;utm_campaign=single%2Bposting\u0026amp;utm_content=python%2Bdevelopment%2Bvirtual%2Blecturer%2Bm%2Bf%2Bd\"\u003ehttps://digitalcareerinstitute.join.com/jobs/2170772-python-development-virtual-lecturer-m-f-d?pid=357a3b4531918760973f\u0026amp;oid=05429ed5-36a1-4f2f-aac7-707952e9f556\u0026amp;utm_source=github_jobs\u0026amp;utm_medium=paid\u0026amp;utm_campaign=single%2Bposting\u0026amp;utm_content=python%2Bdevelopment%2Bvirtual%2Blecturer%2Bm%2Bf%2Bd\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://web.archive.org/web/20210507025928/https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBb0NpIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--2dbca065e819a5cc11c1c2bc35c715408c14f8b3/dci-digital-career-institute-logo-xl.png"},{"id":"c62a25f6-d587-4b66-aab1-109627bf5b5d","type":"Full Time","url":"https://web.archive.org/web/20210507025928/https://jobs.github.com/positions/c62a25f6-d587-4b66-aab1-109627bf5b5d","created_at":"Fri Apr 30 23:14:12 UTC 2021","company":"Frozen Mountain Software","company_url":"https://web.archive.org/web/20210507025928/https://www.frozenmountain.com","location":"Canada, USA, Surrey, Vancouver, Toronto, Calgary, North Carolina","title":"Senior Full-Stack Developer ","description":"\u003cp\u003eWe're Frozen Mountain Software, a global leader in Web Real-Time Communications (WebRTC) solutions--we are all about connecting people, everywhere, to what matters most. We're a hidden gem that is based in the heart of Surrey, BC (the fastest-growing city in the province!) In 2018 and 2019, we were awarded Canada's Top Small \u0026amp; Medium Employers and recently featured in the City of Surrey's 2017-2027 Economic Strategy for our commitment to nurturing a great culture.\u003c/p\u003e\n\u003cp\u003eAt Frozen Mountain, we also do everything we can to look after our FM Family (employees!) from flexible work hours, remote work days, tons of free food and snacks, and awesome company events are just the beginning. The teams themselves are high impact, A-players who are incredibly passionate!\u003c/p\u003e\n\u003cp\u003eHere's what we rock at; capturing elusive requirements, then documenting difficult specifications, and engineering solid foundations. Oh, and we do this all against the relentless ticking of the project clock. At Frozen Mountain we believe that programming is a craft, an art form. We're looking for a \u003cstrong\u003eSenior Developers\u003c/strong\u003e who shares this sentiment and who applies ingenuity in their work to get the best solutions. If you are a Software Creator who takes pride in your craft, enjoys the Real-Time Communication world and can write awesome code in C#, Objective-C, and Java, then come work small miracles with us every day!\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat you will be doing:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWork on a wide range of client platforms building cutting-edge enterprise applications\u003c/li\u003e\n\u003cli\u003eWork closely with your Project Manager and client to develop requirements, integrate internal WebRTC SDK's and libraries into production applications and APIs\u003c/li\u003e\n\u003cli\u003eTroubleshoot existing WebRTC applications and work with the internal product team to leverage internal SDK's in client applications\u003c/li\u003e\n\u003cli\u003eUse Microsoft technologies on the server (C#, MVC, Entity Framework) and Windows and/or Linux (with Mono and .NET Core) together with our own in-house technologies for Real-Time Communications (LiveSwitch, IceLink and WebSync)\u003c/li\u003e\n\u003cli\u003eDesign and deliver RTC solutions in-scope, on-time, and on-budget\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWe're often asked, what does it take to succeed at Frozen Mountain? You've got to have a huge appetite for learning, take ownership, and be smart without having an ego. Here at FM, we believe in the FORCE! (Family, Ownership, Resourcefulness, Community, Excellence) Is the FORCE strong within you? Below are more details of what we are looking for in this role.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eThe must-haves:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBachelor's Degree in Computer Science or equivalent\u003c/li\u003e\n\u003cli\u003e5+ years of programming experience in C#, .NET, ASP.NET, Objective-C, Java\u003c/li\u003e\n\u003cli\u003eExperience in WebRTC (Real Time Communications) programming is a huge plus\u003c/li\u003e\n\u003cli\u003eDevelopment experience with JavaScript, Android, iOS, or Xamarin\u003c/li\u003e\n\u003cli\u003eExcellent written and verbal communication skills for technical applications\u003c/li\u003e\n\u003cli\u003eAbility to adapt and learn new technologies quickly\u003c/li\u003e\n\u003cli\u003eSelf-motivated, can work independently, problem solve like a boss\u003c/li\u003e\n\u003cli\u003eExperience with CI tools and cloud container tech is an asset (Git, TC, VSTS, AWS, Oracle Cloud, Docker)\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWhat's in it for you?\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eCompetitive salary and commission - we're not just saying that! We compare our salaries to local averages to make sure that we stay ahead.\u003c/li\u003e\n\u003cli\u003eExtended Health Benefits paid 100% by the company, RRSP matching up to 5%\u003c/li\u003e\n\u003cli\u003eInternal opportunities for professional development and advancement\u003c/li\u003e\n\u003cli\u003eFree snack bars, fruits, veggies, specialty coffee and tea, and soft drinks in the office (and of course the Nespresso machine!)\u003c/li\u003e\n\u003cli\u003eWeekly catered lunches, monthly pub nights, and 8 awesome staff and family events, per year\u003c/li\u003e\n\u003cli\u003eComfortable, ergonomic work spaces with top-notch hardware\u003c/li\u003e\n\u003cli\u003eYearly allowance for branded clothing and swag ($100 to spend)\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eA space where egos are checked at the door, sleeves are rolled up to lend you a hand, ping pong is serious business and where the CEO will know you by name, rather than by number.\nAbout us:\u003c/p\u003e\n\u003cp\u003eCreated by brothers Anton and Jerod Venema in 2008, FM has grown to over 50 employees, and 500 customers and 1000s of developers building with our product worldwide. Through technology and innovation, we inspire and enable development teams through industry leading enterprise-class real-time streaming and analytic solutions. With products built from the ground up, we live and breathe RTC technology. Come work for a company that is built by Developers for Developers!\u003c/p\u003e\n\u003cp\u003eFrozen Mountain is committed to being a diverse and inclusive workplace. We encourage applicants of different backgrounds, cultures, experiences, abilities and perspectives to apply. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, or disability status.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eEmail your resume to \u003ca href=\"mailto:jobs@frozenmountain.com\"\u003ejobs@frozenmountain.com\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eYou can also apply through our careers page.\n\u003ca href=\"https://frozen-mountain.breezy.hr/p/0ad759d9d66c\"\u003ehttps://frozen-mountain.breezy.hr/p/0ad759d9d66c\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://web.archive.org/web/20210507025928/https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbnlpIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--79f064a4d9b76d6e1bb863edeccb1d7ab70033a7/FM%20Logo%20-%20Regular.png"},{"id":"9d9deaaa-bcb6-40ab-acca-b41130887a41","type":"Full Time","url":"https://web.archive.org/web/20210507025928/https://jobs.github.com/positions/9d9deaaa-bcb6-40ab-acca-b41130887a41","created_at":"Fri Apr 30 21:06:15 UTC 2021","company":"FlightAware","company_url":"https://web.archive.org/web/20210507025928/https://flightaware.com/","location":"United States (Remote)","title":"Software Engineer - Web","description":"\u003cp\u003e\u003cstrong\u003eDescription:\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eFlightAware is looking for a software engineer to join our web development team. Our web applications serve almost 3 million unique users each month, spanning the spectrum from aviation industry professionals to the casual traveler. These web apps are backed by the most comprehensive flight-tracking data and intelligence in the industry—we process over 50 million incoming messages per hour from over 30,000 individual data feeds (over 175 gigabytes a day and growing) to provide the world’s best, most complete, and most accurate real-time flight-tracking service.\u003c/p\u003e\n\u003cp\u003eThis is a full-time role. Our team is headquartered in Houston, Texas, but we work as a distributed team and accept remote applicants.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eMust have current work authorization for any employer in the US and not require sponsorship now or in the future.\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eRequirements:\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThis person is naturally curious, exploring new technologies to stay current but balancing the use of new and old to ensure that execution is the priority. Professionally, this person is driven to execute, deliver, and complete projects independently, seeking advice and direction from team members when needed, and pushing ahead to completion when the path forward is clear.\u003c/p\u003e\n\u003cp\u003eRegardless of role, we expect excellent interpersonal and communication skills across all hires at FlightAware. We look for candidates who will thrive here, meaning they demonstrate clear communication, embrace open feedback, trust their colleagues, and are driven to execute, deliver, and complete projects independently and efficiently.\u003c/p\u003e\n\u003cp\u003eTechnically, this person should be conversant with how web content is delivered. This includes web servers (Apache, nginx, lighttpd) and caching technologies (memcached, Varnish, content delivery networks) and how these technologies interoperate. This person should also be comfortable maintaining and evolving server- and client-side software in a collaborative environment.\u003c/p\u003e\n\u003cp\u003eIdeally, you have:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eStrong experience with at least one server-side language (PHP, C#, Python, etc.)\u003c/li\u003e\n\u003cli\u003eStrong experience with HTML/CSS/JavaScript, preferably using modern technologies (SASS, ES6, React, Webpack)\u003c/li\u003e\n\u003cli\u003eAt a minimum, a working knowledge of RDBMS (PostgreSQL, MySQL, or similar)\u003c/li\u003e\n\u003cli\u003eExperience with Git or other source-control, especially on collaborative projects\u003c/li\u003e\n\u003cli\u003eExperience with Tcl and jQuery\u003c/li\u003e\n\u003cli\u003eA pilot’s certificate or interest in aviation\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eResponsibilities:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eCreate robust and scalable website features that showcase our world-class data for end-users.\u003c/li\u003e\n\u003cli\u003eDesign, build, and maintain reusable UI components across our frontend products.\u003c/li\u003e\n\u003cli\u003eDetect issues, identify their root causes, develop fixes, and design auditing to prevent future occurrences.\u003c/li\u003e\n\u003cli\u003eDesign, develop, test, deploy, maintain, and enhance software products.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eEducation:\u003c/strong\u003e\nA bachelor's or master's degree in computer science or software engineering, or equivalent experience.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eApply by following the application instructions on the job posting: \u003ca href=\"https://flightaware.com/about/careers/position/A3.B17/web_developer\"\u003ehttps://flightaware.com/about/careers/position/A3.B17/web_developer\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://web.archive.org/web/20210507025928/https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbkNpIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--37c435bbdc3b1a969edf6971f2c40e429c28099c/FA%20LI%20logo.png"},{"id":"7e95bae3-1a81-40e8-b254-c73db01770ae","type":"Full Time","url":"https://web.archive.org/web/20210507025928/https://jobs.github.com/positions/7e95bae3-1a81-40e8-b254-c73db01770ae","created_at":"Fri Apr 30 19:14:11 UTC 2021","company":"Bonanza.com, Inc.","company_url":"https://web.archive.org/web/20210507025928/http://www.bonanza.com","location":"Seattle, WA","title":"Senior Rails Developer","description":"\u003cp\u003eWe're looking for a full-time, full-stack Ruby on Rails developer to help us tackle the many challenges of running a marketplace that scales.\u003c/p\u003e\n\u003cp\u003eAs the sole developer working on the marketplace side of the business, you will play a critical role through every project’s lifecycle from design to development to maintenance. You'll collaborate closely with key stakeholders throughout the process to ensure success of the final outcome. Seasoned developers will review code before implementation to provide necessary feedback and guidance. Some of the stuff we're working on includes:\u003c/p\u003e\n\u003cp\u003eAPI: enable sellers and third parties to sell on Bonanza\u003c/p\u003e\n\u003cp\u003eImporters: allow sellers to effortlessly bring inventory from platforms including eBay, Shopify, and CSV\u003c/p\u003e\n\u003cp\u003eBroadcaster: an advertising platform that takes Google Adwords and makes it comprehensible\u003c/p\u003e\n\u003cp\u003eFraud and compliance: keeping disallowed items and bad actors off the platform\nMobile-first UX\u003c/p\u003e\n\u003cp\u003eThird party integrations (checkout, dispute management, OAuth signup and login)\u003c/p\u003e\n\u003cp\u003eObviously these bullets only scratch the surface of the tasks we'll be working on at a given time. You will also have opportunities to research and integrate new technologies.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eJob Requirements\u003c/strong\u003e\nA minimum of 3 years of Ruby on Rails experience in a production environment. You'll be working in the full stack, from the database (MySQL) up to jQuery and HTML/CSS. You should have the doggedness to solve problems through documentation, research, and reviewing logs and past commits. You should have the empathy to see problems from our customers’ shoes and keep their needs in mind while building solutions.\u003c/p\u003e\n\u003cp\u003eWe are a data driven company from the business level down to individual contributors, so we experiment with different methods to evaluate success. We are looking for developers who can come up to speed on new skills and technologies, turn that into a regular cadence of completed work, and who have time management skills to get through all their tasks coding or otherwise.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eJob Benefits\u003c/strong\u003e\nWatch: \u003ca href=\"https://www.youtube.com/watch?v=ggA3-odI-Ls\"\u003eWhat's it like to work at Bonanza?\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eBonanza is a product-first company run by a CEO who has spent most of his adult life as a Programmer. The implications of this are that we've obsessed for literally years about how to foster an environment optimized for Developer happiness and throughput. It starts with our salaries, which, at the high end, range to levels beyond those offered by the tech titans. More importantly, we provide a working environment where you will virtually never be interrupted by meetings, and where you will be given access to the best hardware available. Because your productivity should never constrained for lack of resources. We also offer a thoughtfully constructed collection of perks that stands apart from our competitors:\u003c/p\u003e\n\u003cp\u003eProfitable company that recently celebrated its 13 year anniversary.\u003c/p\u003e\n\u003cp\u003eHybrid remote/office model. We're working remotely due to the pandemic and will switch to a hybrid model with Tuesdays \u0026amp; Fridays in the office for meetings and catered lunches with the team.\u003c/p\u003e\n\u003cp\u003e\"Freedom February\" - every February we retreat from Seattle and spend a month annoying our friends with selfies taken in Mexico, Belize, Europe, etc.\u003c/p\u003e\n\u003cp\u003eFive bonus (not counted as vacation) days off in February to enjoy your vacation or staycation.\u003c/p\u003e\n\u003cp\u003eTwice-weekly catered lunches.\u003c/p\u003e\n\u003cp\u003eProfessional development opportunities.\u003c/p\u003e\n\u003cp\u003eWork from a waterfront office in downtown Seattle (food trucks aplenty!) convenient to many bus lines.\u003c/p\u003e\n\u003cp\u003eBreak room with ping pong, MAME cabinet, and coworker led office yoga.\u003c/p\u003e\n\u003cp\u003eThe boring stuff: fully paid health insurance coverage, holidays, stock options, and more.\u003c/p\u003e\n\u003cp\u003eBeyond this set of perks, we are committed to inclusion and enabling everyone to be heard. We also commit to our employees that if ever they have ideas on how we can improve our benefits package to better serve our team, we will do our best to make them happen.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eApply through our website at \u003ca href=\"https://www.bonanza.com/jobs/18\"\u003ehttps://www.bonanza.com/jobs/18\u003c/a\u003e or by emailing \u003ca href=\"mailto:jobs@bonanza.com\"\u003ejobs@bonanza.com\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://web.archive.org/web/20210507025928/https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbXlpIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--8c12840bb800d886f0ce1a0213ea27b68e17cf61/bonz_green_square.png"},{"id":"c350bc09-54b7-4165-9b30-45fa7e7d8ec0","type":"Full Time","url":"https://web.archive.org/web/20210507025928/https://jobs.github.com/positions/c350bc09-54b7-4165-9b30-45fa7e7d8ec0","created_at":"Fri Apr 30 15:03:35 UTC 2021","company":"Inficon","company_url":"https://web.archive.org/web/20210507025928/https://www.click2apply.net/b7Loy6UYowklhbWOHe18N","location":"East Syracuse,New York 13057","title":"Senior Software Engineer","description":"\u003cp\u003eInficon\u003c/p\u003e\n\u003cp\u003eCategory: Engineering\nReq Number: SENIO02008\nJob Type: Full-Time\nLocation: East Syracuse, NY, United States\u003c/p\u003e\n\u003cp\u003eDescription\u003c/p\u003e\n\u003cp\u003eCOMPANY OVERVIEW:\u003c/p\u003e\n\u003cp\u003eINFICON is a growing, global, leading provider of innovative technologies that enhances productivity and quality in sophisticated industrial processes. The products provided by INFICON are world-class instruments for gas analysis, measurement, and control and are vital to manufacturers and end-users in the complex fabrication of semiconductors and thin film coatings for optics, flat panel displays, solar cells, and industrial vacuum coating applications. INFICON is headquartered in Switzerland and has world-class manufacturing facilities in Europe, the United States and China with subsidiaries located throughout the world. This position will be located at INFICON's U.S. headquarters in East Syracuse, NY. For more detailed information about INFICON, please visit our website at \u003ca href=\"http://www.inficon.com\"\u003ewww.inficon.com\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eJOB DESCRIPTION:\u003c/p\u003e\n\u003cp\u003eIn this position you will design, implement, test, deploy and maintain Linux-based software and firmware that interacts with underlying hardware modules across multiple products. You will immediately be integrated into multidisciplinary Agile engineering teams that work with a wide range of technologies including FPGAs, electronic sensors, and chemical analysis. You will solve difficult technical problems and focus on developing great code for multiple new products.\u003c/p\u003e\n\u003cp\u003eResponsibilities\u003c/p\u003e\n\u003cp\u003e*Design, develop, and maintain embedded software for innovative scientific and industrial instruments\n*Use Agile development processes to contribute via daily scrums, design/task planning, and code reviews\n*Build, test, and tune Linux application software and system services\n*Design and run laboratory and field tests to validate and troubleshoot software\n*Stay up to date on state of the art software technologies\u003c/p\u003e\n\u003cp\u003eREQUIRED QUALIFICATIONS:\u003c/p\u003e\n\u003cp\u003e*Bachelors of Science (BS) in computer science, computer engineering, or software engineering.\n*7+ years of C/C++ development experience in one or more of the following areas:\n*Linux system/kernel development\n*Firmware running under embedded and/or real-time OSes\n*Bare-metal microcontroller development\n*Bootloader development and initial board bring-up\u003c/p\u003e\n\u003cp\u003ePREFERRED QUALIFICATIONS:\u003c/p\u003e\n\u003cp\u003e*Masters of Science (MS) in computer science or related field\n*Experience developing with Python, Git, Bash, Google Test, and RESTful APIs\n*Experience with the YOCTO Project\n*Experience with FPGA design and troubleshooting\n*Experience with real-time DSP firmware\n*Continuous integration, test automation, release management\u003c/p\u003e\n\u003cp\u003eCOMPENSATION \u0026amp; BENEFITS:\u003c/p\u003e\n\u003cp\u003eCompensation will be commensurate with experience including a competitive base salary, bonus opportunity, competitive benefits package, and generous relocation package.\u003c/p\u003e\n\u003cp\u003eEqual Opportunity Employer/Protected Veterans/Individuals with Disabilities\u003c/p\u003e\n\u003cp\u003eThe contractor will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with the contractor's legal duty to furnish information. 41 CFR 60-1.35(c)\u003c/p\u003e\n\u003cp\u003eEducation\u003c/p\u003e\n\u003cp\u003eBachelors or better Computer Science\u003c/p\u003e\n\u003cp\u003eApply Here: \u003ca href=\"https://www.click2apply.net/b7Loy6UYowklhbWOHe18N\"\u003ehttps://www.click2apply.net/b7Loy6UYowklhbWOHe18N\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003ePI135300494\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eApply Online\n\u003ca href=\"https://www.click2apply.net/b7Loy6UYowklhbWOHe18N\"\u003ehttps://www.click2apply.net/b7Loy6UYowklhbWOHe18N\u003c/a\u003e\u003c/p\u003e\n","company_logo":null},{"id":"6bb34fb9-c8d9-457b-9758-affbab977116","type":"Full Time","url":"https://web.archive.org/web/20210507025928/https://jobs.github.com/positions/6bb34fb9-c8d9-457b-9758-affbab977116","created_at":"Fri Apr 30 14:31:54 UTC 2021","company":"azeti GmbH","company_url":"https://web.archive.org/web/20210507025928/https://www.azeti.net/","location":"Berlin","title":"Lead Software Engineer - azeti ioT Platform","description":"\u003cp\u003eWe are a Berlin-based IoT software company. Our IoT platform enables the simple and fast implementation of industrial IoT applications. We have been offering software \"Made in Germany\" for national and international customers since 2006. Our IoT solutions are in use in Europe, America and China. As specialists for digitization and IoT, our TÜV-certified IoT platform is already being used in a wide range of industries. Various research projects and long-term OEM partnerships in the industry underline our competence and expertise in solving the most demanding IoT projects. With our Open Source Edge Software and brand new IoT stack, we are going one step further and will make the Internet of Things possible for every business.\u003c/p\u003e\n\u003cp\u003eFor more information: \u003ca href=\"http://t3u1.mjt.lu/lnk/ANEAAJ7Dv-0AAAAAAAAAAG3sWXAAAAAA-nQAAAAAAAZPNgBgi-5wKxRP6McEQymz1X4GmHZANwAGCXo/2/Ed5bME_urP69Pj7BgXLBGw/aHR0cDovL3d3dy5hemV0aS5uZXQ\"\u003ewww.azeti.net\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhy us?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThese strange times demand a lot of everyone. \u003cstrong\u003eWe provide a secure and long-term work environment for our team and are in search for team members that add to our team for the next years to come.\u003c/strong\u003e Besides having a stable business, we are backed by the Aurubis AG and are a secure employer for your next career step.\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\u003cstrong\u003eStable and secure work environment\u003c/strong\u003e\u003c/li\u003e\n\u003cli\u003eFlexible working hours and regards to your family matters (homeschooling, daycare, etc.)\u003c/li\u003e\n\u003cli\u003eHome Office possible with regular trips (every 4-6 weeks) to our Berlin HQ for workshops and events\u003c/li\u003e\n\u003cli\u003eFree choice of hardware (Linux, Mac, Windows) and equipment for your home office\u003c/li\u003e\n\u003cli\u003eAbove-average salary and awesome career development possibilities\u003c/li\u003e\n\u003cli\u003eAgile work in a diverse international team, flat hierarchies\u003c/li\u003e\n\u003cli\u003eDirect impact in product development with immediate effect for our customer base\u003c/li\u003e\n\u003cli\u003eTop-notch technology stack with exciting developments already inline\u003c/li\u003e\n\u003cli\u003e\n\u003ca href=\"http://t3u1.mjt.lu/lnk/ANEAAJ7Dv-0AAAAAAAAAAG3sWXAAAAAA-nQAAAAAAAZPNgBgi-5wKxRP6McEQymz1X4GmHZANwAGCXo/3/pz2Rv0Un8qaQxjY0wv3ReQ/aHR0cHM6Ly9jb3Jwb3JhdGUudXJiYW5zcG9ydHNjbHViLmNvbS9lbg\"\u003eUrban Sports Club\u003c/a\u003e membership, fully paid by us\u003c/li\u003e\n\u003cli\u003eBike leasing by \u003ca href=\"http://t3u1.mjt.lu/lnk/ANEAAJ7Dv-0AAAAAAAAAAG3sWXAAAAAA-nQAAAAAAAZPNgBgi-5wKxRP6McEQymz1X4GmHZANwAGCXo/4/rcUPLVFEVqEvfw97LeKqSg/aHR0cHM6Ly93d3cuYnVzaW5lc3NiaWtlLmRlL2Rl\"\u003ebusiness-bike\u003c/a\u003e or \u003ca href=\"http://t3u1.mjt.lu/lnk/ANEAAJ7Dv-0AAAAAAAAAAG3sWXAAAAAA-nQAAAAAAAZPNgBgi-5wKxRP6McEQymz1X4GmHZANwAGCXo/5/nc2OUpWvTG-7lkl1tTQfTA/aHR0cHM6Ly93d3cuam9icmFkLm9yZy8\"\u003ejobrad\u003c/a\u003e\n\u003c/li\u003e\n\u003cli\u003e\n\u003ca href=\"http://t3u1.mjt.lu/lnk/ANEAAJ7Dv-0AAAAAAAAAAG3sWXAAAAAA-nQAAAAAAAZPNgBgi-5wKxRP6McEQymz1X4GmHZANwAGCXo/6/mvElJumHUxmrRkZdNT_egQ/aHR0cHM6Ly93d3cuY29ycG9yYXRlLWJlbmVmaXRzLmRlLw\"\u003eCorporate Benefits Programm\u003c/a\u003e with nice discounts\u003c/li\u003e\n\u003cli\u003eContinuous learning and 100 € \u003ca href=\"http://t3u1.mjt.lu/lnk/ANEAAJ7Dv-0AAAAAAAAAAG3sWXAAAAAA-nQAAAAAAAZPNgBgi-5wKxRP6McEQymz1X4GmHZANwAGCXo/7/a80zxgLDpf-DMlSGDLfl1Q/aHR0cHM6Ly93d3cudWRlbXkuY29tLw\"\u003eUdemy\u003c/a\u003e budget per month\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eYour mission\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eIn order to take our IoT Platform to the next level, our Software Engineer team (6 Software Engineers) is looking for an experienced Lead Software Engineer who partakes in the software development and leads by example in technical finesse and by sharing experiences.\u003c/strong\u003e Together with the team, you will continue to develop the platform with a focus on best practices and modern methodologies. You inspire and spur on with know-how and question the status quo. You will work about 80% as a Software Engineer and 20% for leadership tasks, so you are close to the product and an active part of the development.\nYou will face the next big challenges with the team (k8s, CI/CD, end-to-end testing, Kafka and many more) and help to master difficult requirements together through an agile approach.\nIt is important to us that you lead the Team at eye level and inspire with your expertise and experience and are a central part ofthe team as an expert here.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eFurthermore, your role includes:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eCommunicate best practices and quality expectations clearly and continuously\u003c/li\u003e\n\u003cli\u003ePair programming, code reviews as well as supervision of our architecture and backlog together with product owner\u003c/li\u003e\n\u003cli\u003eThematic organization of regular workshops and trainings, our nice team assistant will help you with the logistics\u003c/li\u003e\n\u003cli\u003eWork closely with Scrum Master and Product Owner to make sure the team can collaborate without any blockers\u003c/li\u003e\n\u003cli\u003eGuide, lead and inspire teammates to create a healthy, high caliber development team\u003c/li\u003e\n\u003cli\u003eFind pragmatic and agile solutions, start with rapid prototyping and iterate towards MVP's with constant feedback loops, testing and collaboration\u003c/li\u003e\n\u003cli\u003eQuestion requirements and consult to find pragmatic solutions and always deliver customer value\u003c/li\u003e\n\u003cli\u003eCommunicate regularly with stakeholders and other teams\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003ePlace of Work\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe currently work completely remotely and believe in flexible working arrangements. You can work from home most of the time. Our goal is to gather the team in our office every 4-6 weeks for workshops and events.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eYour role will include mentoring your colleagues in particular, so it is a great advantage if you live close to or in Berlin.\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eYour profile\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e\u003cstrong\u003eAt least 2 years of hands-on experience in professional and disciplinary leadership of an agile software team\u003c/strong\u003e\u003c/li\u003e\n\u003cli\u003eAgile approach to work that involves constant iteration and collaboration\u003c/li\u003e\n\u003cli\u003eYou are fluent in English, German language skills are a big plus\u003c/li\u003e\n\u003cli\u003eVery good communication skills, strong oral and written presentation skills\u003c/li\u003e\n\u003cli\u003eExperience in development in agile environments (Scrum, Kanban)\u003c/li\u003e\n\u003cli\u003eHigh level of self-organization and active communication\n-\u003cstrong\u003eExtensive experience in microservices application development\u003c/strong\u003e\n-\u003cstrong\u003eExtensive experience with Spring Framework in Java or Kotlin\u003c/strong\u003e\n\u003c/li\u003e\n\u003cli\u003eExperience working with functional components ReactJS and TypeScript\u003c/li\u003e\n\u003cli\u003eExperience and interest in data visualization and dashboarding is a plus\u003c/li\u003e\n\u003cli\u003eExperience developing event driven applications is a plus\u003c/li\u003e\n\u003cli\u003eExperience with Kafka is a plus\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eIf you're based in or close to Berlin, that's a big plus.\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eKontakt\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003ePlease \u003ca href=\"http://t3u1.mjt.lu/lnk/ANEAAJ7Dv-0AAAAAAAAAAG3sWXAAAAAA-nQAAAAAAAZPNgBgi-5wKxRP6McEQymz1X4GmHZANwAGCXo/8/0c9vVm_4qlWOVzyAeq-jwQ/aHR0cHM6Ly9hemV0aS1qb2JzLnBlcnNvbmlvLmRl\"\u003esubmit your application on our career page\u003c/a\u003e or send it into career (AT) \u003ca href=\"http://azeti.net/\"\u003eazeti.net\u003c/a\u003e. Your main contact is Sebastian Koch.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://camo.githubusercontent.com/a9a0434d6d4b597c02820d7d56762d1c715ffd5c/68747470733a2f2f742e676f686972696e672e636f6d2f682f32376562333433373431356238363933383238313965313166363233303930616637376336663364323438623635323435376464363163353132363731616337\"\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://t.gohiring.com/h/cabd7c223a3de3702cf68081aab93d74041ac8051c8b555436c59ac099f9f2dd\"\u003eapplication form\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://web.archive.org/web/20210507025928/https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbVdpIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--8225442f38aa04f37e7875c85dd89f7adf8ce8df/azeti%20GmbH.png"},{"id":"52fdce9d-f96c-4e4c-b51e-cd33eeee87b6","type":"Full Time","url":"https://web.archive.org/web/20210507025928/https://jobs.github.com/positions/52fdce9d-f96c-4e4c-b51e-cd33eeee87b6","created_at":"Fri Apr 30 12:46:02 UTC 2021","company":"Grant Thornton LLP Canada","company_url":"https://web.archive.org/web/20210507025928/http://www.discoveryourpurple.ca","location":"Canada","title":"Software Developer","description":"\u003cp\u003eWho we are\u003c/p\u003e\n\u003cp\u003eYou know those big cities that still feel like small towns? Where everyone’s friendly and helps each other out? That’s like Grant Thornton. Except here we’re all professionals and there isn’t a mayor or a general store. What we’re trying to say is that we’re a large and growing professional services firm that still feels like a community. We employ over 2500 people across Canada, and we truly care about our colleagues, our clients and the communities where we work and live. That’s what’s most important to us. We’re building a thriving organization that’s purpose driven and still want to remember what your favourite milkshake flavour is.\u003c/p\u003e\n\u003cp\u003eWithin our Technology group, our growing firm wide Application Support team is looking for a Software Developer. We are looking for an experienced Developer with excellent technical knowledge of MS Dynamics 365 and related Microsoft cloud solutions. You’ll be strategically assisting with solution design, technical implementation and customer support of MS Dynamics 365, SharePoint Online, among other tools.\u003c/p\u003e\n\u003cp\u003eYou will have an opportunity to deepen your skills and expertise as you develop and manage site content and capabilities and provide daily onsite maintenance of existing SharePoint applications. You will contribute to the design and development of CRM using the latest Microsoft technologies including Azure, and Dynamics 365. You will also be participating in the testing/QA process throughout. You will learn something new every day and be a major influence in how our clients and colleagues work.\u003c/p\u003e\n\u003cp\u003eThis is a unique opportunity to collaborate with key stakeholders and become known as a trusted advisor within the Application Support team, the Technology team and across the firm. It’s a chance to tap into your knowledge, passion and deep experience; a chance to contribute meaningfully to our purpose - to help our clients, colleagues and communities thrive.\u003c/p\u003e\n\u003cp\u003eThis role can sit anywhere in Canada that is accessible to a Grant Thornton LLP Canada office.\u003c/p\u003e\n\u003cp\u003eAs a Software Developer, you will:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eAct as SharePoint expert to help clients align business needs with SharePoint features and functionality.\u003c/li\u003e\n\u003cli\u003eDevelop software solutions by reviewing requirements analysis and information needs with Business Information System managers and Business Analysts.\u003c/li\u003e\n\u003cli\u003eDesign solutions using software development fundamentals and processes, debug, test, and deploy software solutions.\u003c/li\u003e\n\u003cli\u003eDocument solutions by developing documentation according to established standards, flowcharts, layouts, diagrams, and code comments.\u003c/li\u003e\n\u003cli\u003eArchitect, design, develop, implement and provide maintenance within SharePoint and Office 365 applications\u003c/li\u003e\n\u003cli\u003eParticipate in implementation customization and configuration for Dynamics 365 solutions\u003c/li\u003e\n\u003cli\u003eCode, test, debug and document software solutions using appropriate processes, tools, frameworks, libraries, patterns, best practices and standards\u003c/li\u003e\n\u003cli\u003eParticipate in integration and migration (write scripts) of content from various platforms into SharePoint\u003c/li\u003e\n\u003cli\u003eResponsible for customizing and developing SharePoint components, including but not limited to, Web Parts, Discussion Boards, User Interface Design, Forms and Lists\u003c/li\u003e\n\u003cli\u003eContribute to the technical direction of the Application Infrastructure practice, the solution offerings and certifications\u003c/li\u003e\n\u003cli\u003eEvaluate tasks and meet timelines\u003c/li\u003e\n\u003cli\u003eDesign custom applications to automate or simplify tasks\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eBe Grant Thornton\u003c/p\u003e\n\u003cp\u003eIf you’re a bit like us, you’re driven to connect with how others are feeling and thinking. Here we walk in others shoes before taking action. Just imagine being part of a team that puts “we before me”, where flexAbility is a mindset, and where you trust your colleagues to have your back. At Grant Thornton, you’ll work with inspiring leaders who support your development, both personally and professionally. This is a place where your insatiable curiosity enables you to think, see and hear from a variety of perspectives, a place where every day is different and having the courage to grow is part of who you are. And when all this comes together, well that’s when the magic happens!\u003c/p\u003e\n\u003cp\u003eWant to learn more about who we are and how we live our purple every day? Read our colleagues’ stories at \u003ca href=\"http://www.discoveryourpurple.ca\"\u003ewww.discoveryourpurple.ca\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eThink you’ve got what it takes to be a Software Developer? Like the colour purple? Great. Here's a few more boxes we’re also hoping you can tick:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBachelor’s degree preferred (engineering or information systems related field)\u003c/li\u003e\n\u003cli\u003ePossess 5 - 7 years of experience in development and .NET platform (C#, ASP.NET, PowerShell)\u003c/li\u003e\n\u003cli\u003e3+ years of Microsoft Dynamics applications (CRM) product experience and processes along with experience in other MS Dynamics modules\u003c/li\u003e\n\u003cli\u003eExperience implementing and customizing Dynamics CRM and Dynamics 365\u003c/li\u003e\n\u003cli\u003ePossess 3 - 5 years of experience with SharePoint 2013, 2016, SPO, Office 365 (development, maintenance)\u003c/li\u003e\n\u003cli\u003eDevelopment of SharePoint Core solutions\u003c/li\u003e\n\u003cli\u003eExperience with Visual Studio, Power Apps, MS Flow and SharePoint Designer\u003c/li\u003e\n\u003cli\u003eExperience with SDK and 3rd party tools for Dynamics 365 CE/CDS/Power Apps\u003c/li\u003e\n\u003cli\u003eExperience with Project Server setup, configuration and administration and integration with Microsoft Power BI\u003c/li\u003e\n\u003cli\u003eExperience with SharePoint integrations (D365, HRM systems, etc.)\u003c/li\u003e\n\u003cli\u003eExperience with SQL Server, AWS, Azure and SaaS\u003c/li\u003e\n\u003cli\u003eDevelopment experience with the following technologies: HTML5, CSS, JavaScript, MVC, Angular\u003c/li\u003e\n\u003cli\u003eTransferable Microsoft certification in development, architecture, or cloud applications\u003c/li\u003e\n\u003cli\u003eAttention to detail and ability to function in a dynamic and demanding work environment\u003c/li\u003e\n\u003cli\u003eAbility to analyze business requirements and propose solutions\u003c/li\u003e\n\u003cli\u003eAbility to produce technical and functional documentation\u003c/li\u003e\n\u003cli\u003eAbility to troubleshoot and perform unit testing based on scenarios\u003c/li\u003e\n\u003cli\u003eAutonomy and sense of responsibility\u003c/li\u003e\n\u003cli\u003eAptitude for continuous learning\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eAt Grant Thornton we’re focused on making a difference in the lives of our clients, our colleagues and our communities. That’s our purpose. Or, as we like to say, living our purple.\u003c/p\u003e\n\u003cp\u003eAre you ready to Discover Your Purple?\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://phh.tbe.taleo.net/phh01/ats/careers/v2/viewRequisition?org=GRANTTHORNTON\u0026amp;cws=56\u0026amp;rid=6116\"\u003ehttps://phh.tbe.taleo.net/phh01/ats/careers/v2/viewRequisition?org=GRANTTHORNTON\u0026amp;cws=56\u0026amp;rid=6116\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eOr Email: \u003ca href=\"mailto:Merle.Freedman@ca.gt.com\"\u003eMerle.Freedman@ca.gt.com\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://web.archive.org/web/20210507025928/https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbUdpIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--10fb60375b4a9555b5a5ecfddf4be5e8e487c6c7/GTlogo-CMYK-large.jpg"},{"id":"6c4a7e24-c71c-4f27-ba65-6c0e80981c30","type":"Full Time","url":"https://web.archive.org/web/20210507025928/https://jobs.github.com/positions/6c4a7e24-c71c-4f27-ba65-6c0e80981c30","created_at":"Fri Apr 30 12:43:51 UTC 2021","company":"Grant Thornton LLP Canada","company_url":"https://web.archive.org/web/20210507025928/http://www.discoveryourpurple.ca","location":"Toronto","title":"ServiceNow Administrator","description":"\u003cp\u003eWho we are\u003c/p\u003e\n\u003cp\u003eYou know those big cities that still feel like small towns? Where everyone’s friendly and helps each other out? That’s like Grant Thornton. Except here we’re all professionals and there isn’t a mayor or a general store. What we’re trying to say is that we’re a large and growing professional services firm that still feels like a community. We employ over 2500 people across Canada, and we truly care about our colleagues, our clients and the communities where we work and live. That’s what’s most important to us. We’re building a thriving organization that’s purpose driven and still want to remember what your favourite milkshake flavour is.\u003c/p\u003e\n\u003cp\u003eWe are looking for a ServiceNow Administrator in our growing Technology group to lead the implementation and evolution of our ServiceNow platform.  You are responsible for delivery, maintenance and support of the enterprise ServiceNow platform that supports multiple business units across the firm. Primary focus is the day to day operations, new project initiative involvement and stability of the existing deployed modules.  You’ll have a chance to expand your skills in projects across the firm, developing new capabilities that deliver the digital services needed by our colleagues across Canada.  You will learn something new every day and have a real impact on how our colleagues and clients work.\u003c/p\u003e\n\u003cp\u003eThis is a unique opportunity to collaborate with key stakeholders and help build our future technology environment. It’s a chance to tap into your knowledge, passion and deep experience; a chance to contribute meaningfully to our purpose - to help our clients, colleagues and communities thrive.\u003c/p\u003e\n\u003cp\u003eAs the ServiceNow Administrator you will:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eSupport the implementation and evolution of ServiceNow\u003c/li\u003e\n\u003cli\u003eTranslate business needs into platform requirements\u003c/li\u003e\n\u003cli\u003eLead the discovery, requirements gathering, and build out of functionality\u003c/li\u003e\n\u003cli\u003eConfigure and customize new modules using ServiceNow best practices\u003c/li\u003e\n\u003cli\u003eCollaborate with developers and business analysts, assisting with form configuration, workflow administration, reporting, data imports, and scripting\u003c/li\u003e\n\u003cli\u003eCreate and maintain connections between ServiceNow and other systems\u003c/li\u003e\n\u003cli\u003eManage ServiceNow upgrades, testing, change and release management\u003c/li\u003e\n\u003cli\u003eProvide analysis of problems and possible solutions\u003c/li\u003e\n\u003cli\u003eComplete and manage backend configurations in ServiceNow\u003c/li\u003e\n\u003cli\u003eProvide and implement the vision for dashboards, metrics, and reporting\u003c/li\u003e\n\u003cli\u003eDocument work completed\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eBe Grant Thornton\u003c/p\u003e\n\u003cp\u003eIf you’re a bit like us, you’re driven to connect with how others are feeling and thinking. Here we walk in others shoes before taking action. Just imagine being part of a team that puts “we before me”, where flexAbility is a mindset, and where you trust your colleagues to have your back. At Grant Thornton, you’ll work with inspiring leaders who support your development, both personally and professionally. This is a place where your insatiable curiosity enables you to think, see and hear from a variety of perspectives, a place where every day is different and having the courage to grow is part of who you are. And when all this comes together, well that’s when the magic happens!\u003c/p\u003e\n\u003cp\u003eWant to learn more about who we are and how we live our purple every day – read our colleagues stories at \u003ca href=\"http://www.discoveryourpurple.ca\"\u003ewww.discoveryourpurple.ca\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eThink you’ve got what it takes to be our ServiceNow Administrator? Like the colour purple? Great. Here's a few more boxes we’re also hoping you can tick:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e3+ years experience with implementation and configuration of ServiceNow\u003c/li\u003e\n\u003cli\u003eServiceNow Certified System Administrator\u003c/li\u003e\n\u003cli\u003eExcellent written and verbal communication skills\u003c/li\u003e\n\u003cli\u003eAbility to understand and implement complex end-user requirements\u003c/li\u003e\n\u003cli\u003eBasic understanding of ITIL methodologies\u003c/li\u003e\n\u003cli\u003eWorking experience with ITSM processes and tools\u003c/li\u003e\n\u003cli\u003eProven relationship and influencing skills\u003c/li\u003e\n\u003cli\u003eSolid organizational skills with an ability to multitask\u003c/li\u003e\n\u003cli\u003eDegree in Computer Science, Engineering, or Business or equivalent work experience\u003c/li\u003e\n\u003cli\u003eStrong problem solving and decision-making skills\u003c/li\u003e\n\u003cli\u003eIntellectual curiosity that drives you to look further, broader, deeper\u003c/li\u003e\n\u003cli\u003eResourceful and innovative, able to generate creative solutions\u003c/li\u003e\n\u003cli\u003eCollaborative, communicative and energetic style\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eAt Grant Thornton we’re focused on making a difference in the lives of our clients, our colleagues and our communities. That’s our purpose. Or, as we like to say, living our purple.\u003c/p\u003e\n\u003cp\u003eAre you ready to Discover Your Purple?\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://phh.tbe.taleo.net/phh01/ats/careers/v2/viewRequisition?org=GRANTTHORNTON\u0026amp;cws=56\u0026amp;rid=5921\"\u003ehttps://phh.tbe.taleo.net/phh01/ats/careers/v2/viewRequisition?org=GRANTTHORNTON\u0026amp;cws=56\u0026amp;rid=5921\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eOr Email: \u003ca href=\"mailto:Gary.Storey@.ca.gt.com\"\u003eGary.Storey@.ca.gt.com\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://web.archive.org/web/20210507025928/https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbCtpIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--244fc62e8f513b51930d3aa66abe5f8b477a6e99/GTlogo-CMYK-large.jpg"},{"id":"27c8a3cd-1480-495a-ade5-bdfb111b3e0d","type":"Full Time","url":"https://web.archive.org/web/20210507025928/https://jobs.github.com/positions/27c8a3cd-1480-495a-ade5-bdfb111b3e0d","created_at":"Fri Apr 30 12:40:48 UTC 2021","company":"Grant Thornton LLP Canada","company_url":"https://web.archive.org/web/20210507025928/http://www.discoveryourpurple.ca","location":"Toronto","title":"Cloud Security Engineer","description":"\u003cp\u003eWho we are\u003c/p\u003e\n\u003cp\u003eYou know those big cities that still feel like small towns? Where everyone’s friendly and helps each other out? That’s like Grant Thornton. Except here we’re all professionals and there isn’t a mayor or a general store. What we’re trying to say is that we’re a large and growing professional services firm that still feels like a community. We employ over 2500 people across Canada, and we truly care about our colleagues, our clients and the communities where we work and live. That’s what’s most important to us. We’re building a thriving organization that’s purpose driven and still want to remember what your favourite milkshake flavour is.\u003c/p\u003e\n\u003cp\u003eAs a Cloud Security Engineer your responsibilities will include:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eProvide subject matter expertise on architecture, authentication, and systems security. Understand our full engineering stack, services and data flow\u003c/li\u003e\n\u003cli\u003eAssess, design, implement, automate, and document security solutions and processes for Amazon Web Service (AWS), MS Azure, SaaS applications and other cloud platforms\u003c/li\u003e\n\u003cli\u003eDeploy security solutions in cloud environments\u003c/li\u003e\n\u003cli\u003eAssist and train team members in the use of cloud security tools and the resolution of security issues\u003c/li\u003e\n\u003cli\u003eResearch and maintain an extensive knowledge base of current cloud technology advancements, trends and directions and identify the potential threats and exposures\u003c/li\u003e\n\u003cli\u003eAssist in investigation and remediation of security incidents and issues\u003c/li\u003e\n\u003cli\u003eCreate and support KPIs and KRIs that measure risk reduction and progress in cloud over time\u003c/li\u003e\n\u003cli\u003eHelp governance, compliance, and risk management teams to ensure the system consistently meets the cyber security requirements\u003c/li\u003e\n\u003cli\u003eAct as a mentor across the teams to enable a best of breed approach to cloud security and cloud management\u003c/li\u003e\n\u003cli\u003eProtect the systems from data breaches at all times\u003c/li\u003e\n\u003cli\u003eMonitor, operate and improve system uptime, performance, high availability and disaster recovery readiness\u003c/li\u003e\n\u003cli\u003eCollaborate with other operational and development teams during triage and resolution of operational issues\u003c/li\u003e\n\u003cli\u003eAssist with other cyber security related tasks\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eBe Grant Thornton\u003c/p\u003e\n\u003cp\u003eIf you’re a bit like us, you’re driven to connect with how others are feeling and thinking. Here we walk in others shoes before taking action. Just imagine being part of a team that puts “we before me”, where flexAbility is a mindset, and where you trust your colleagues to have your back. At Grant Thornton, you’ll work with inspiring leaders who support your development, both personally and professionally. This is a place where your insatiable curiosity enables you to think, see and hear from a variety of perspectives, a place where every day is different and having the courage to grow is part of who you are. And when all this comes together, well that’s when the magic happens!\u003c/p\u003e\n\u003cp\u003eWant to learn more about who we are and how we live our purple every day? Read our colleagues’ stories at \u003ca href=\"http://www.discoveryourpurple.ca\"\u003ewww.discoveryourpurple.ca\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eThink you’ve got what it takes to be a Cloud Security Engineer? Here's a few more boxes we’re also hoping you can tick:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBachelor's degree in engineering, computer science, information systems, business and/or other related major\u003c/li\u003e\n\u003cli\u003eCISSP, CCSP, CRISC or similar cloud certification is preferred\u003c/li\u003e\n\u003cli\u003e5+ years of experience with AWS and Microsoft Azure Cloud Platform\u003c/li\u003e\n\u003cli\u003e5+ years of experience with Cloud security practices\u003c/li\u003e\n\u003cli\u003e5+ years of experience with implementing and configuring IT infrastructure systems, including operating systems, applications, databases, firewalls, and networks\u003c/li\u003e\n\u003cli\u003eExtensive experience in a Linux and MS Windows operating systems, configuration, installation, tuning, maintenance and monitoring\u003c/li\u003e\n\u003cli\u003eExtensive experience with Cloud Security Solutions (e.g. Zscaler, CASB, AlertLogic, SumoLogic)\u003c/li\u003e\n\u003cli\u003eExtensive experience with SIEM solutions (Rapid 7, Log Rhythm, FireEye)\u003c/li\u003e\n\u003cli\u003eExperience with AWS and Azure security design, architecture and implementations.\u003c/li\u003e\n\u003cli\u003eFirm grasp of networking protocols and operations. Comfortable with low level packet sniffing, working knowledge on Kali, Wireshark, Burpsuite, Metasploit, nmap, fiddler, sqlmap, nessus. Knowledge on network attacks, detections, and defences\u003c/li\u003e\n\u003cli\u003eExperience with scripting (Python, Perl, Bash, PowerShell) and API integrations\u003c/li\u003e\n\u003cli\u003eKnowledge of Identity and Access Management concepts and technologies to secure production and corporate access, such as SSO, SAML Federated Identity, RBAC, authentication \u0026amp; authorization solutions\u003c/li\u003e\n\u003cli\u003eAbility to analyze and solve complex challenges\u003c/li\u003e\n\u003cli\u003eMust have knowledge of theoretical and applied cryptography, key management, and a strong understanding of cryptography algorithms such as RSA, AES, SSL vs TLS, PKI, etc\u003c/li\u003e\n\u003cli\u003eKnowledge of technical security control environments and compliance frameworks including CSA CCM, ISO27001, ISO 27017 and NIST\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eAt Grant Thornton we’re focused on making a difference in the lives of our clients, our colleagues and our communities. That’s our purpose. Or, as we like to say, living our purple.\u003c/p\u003e\n\u003cp\u003eAre you ready to Discover Your Purple?\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://phh.tbe.taleo.net/phh01/ats/careers/v2/viewRequisition?org=GRANTTHORNTON\u0026amp;cws=56\u0026amp;rid=6212\"\u003ehttps://phh.tbe.taleo.net/phh01/ats/careers/v2/viewRequisition?org=GRANTTHORNTON\u0026amp;cws=56\u0026amp;rid=6212\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eOr Email: \u003ca href=\"mailto:Gary.Storey@ca.gt.com\"\u003eGary.Storey@ca.gt.com\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://web.archive.org/web/20210507025928/https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbDJpIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--2e0646b6d4027656c0e6a3e3f1882a3ba314a9aa/GTlogo-CMYK-large.jpg"},{"id":"fd8f59e2-5320-4b97-aa90-f4407bcda827","type":"Full Time","url":"https://web.archive.org/web/20210507025928/https://jobs.github.com/positions/fd8f59e2-5320-4b97-aa90-f4407bcda827","created_at":"Thu Apr 29 17:22:57 UTC 2021","company":"Grant Thornton LLP Canada","company_url":"https://web.archive.org/web/20210507025928/https://www.discoveryourpurple.ca/","location":"Toronto","title":"Senior IT Network Engineer","description":"\u003cp\u003eWho we are\nYou know those big cities that still feel like small towns? Where everyone’s friendly and helps each other out? That’s like Grant Thornton. Except here we’re all professionals and there isn’t a mayor or a general store. What we’re trying to say is that we’re a large and growing professional services firm that still feels like a community. We employ over 2500 people across Canada, and we truly care about our colleagues, our clients and the communities where we work and live. That’s what’s most important to us. We’re building a thriving organization that’s purpose driven and still want to remember what your favourite milkshake flavour is.\u003c/p\u003e\n\u003cp\u003eAs an IT Network Engineer your responsibilities will include:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eProvide network administration and support for on-premises and Azure cloud infrastructure\u003c/li\u003e\n\u003cli\u003eAssist with architectural design, planning and deployment of network and network security technologies\u003c/li\u003e\n\u003cli\u003eAct as a network infrastructure subject matter expert in projects working with cross-functional teams\u003c/li\u003e\n\u003cli\u003eWork with a managed service provider for SD-WAN incidents and requests\u003c/li\u003e\n\u003cli\u003eConfigure and administer Zscaler Internet Access and Private Access in a zero-trust environment\u003c/li\u003e\n\u003cli\u003eAdminister network security technologies including but not limited to HTTP and web security gateways, proxies, caches, firewalls, SSL/TLS, GRE, and IPsec tunneling, VPN’s, DLP, anti-virus, spam and spyware solutions, advanced threat detection and analytics\u003c/li\u003e\n\u003cli\u003eDevelop comprehensive documentation of all deployment processes and standard operating procedures\u003c/li\u003e\n\u003cli\u003eImplementation, monitoring and management of network alerts and notifications\u003c/li\u003e\n\u003cli\u003eFollow change management processes, including the creation and review of change requests\u003c/li\u003e\n\u003cli\u003eProvide L3 support and after-hours support for critical issues\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eBe Grant Thornton\nIf you’re a bit like us, you’re driven to connect with how others are feeling and thinking. Here we walk in others shoes before taking action. Just imagine being part of a team that puts “we before me”, where flexAbility is a mindset, and where you trust your colleagues to have your back. At Grant Thornton, you’ll work with inspiring leaders who support your development, both personally and professionally. This is a place where your insatiable curiosity enables you to think, see and hear from a variety of perspectives, a place where every day is different and having the courage to grow is part of who you are. And when all this comes together, well that’s when the magic happens!\u003c/p\u003e\n\u003cp\u003eWant to learn more about who we are and how we live our purple every day? Read our colleagues’ stories at \u003ca href=\"http://www.discoveryourpurple.ca\"\u003ewww.discoveryourpurple.ca\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eThink you’ve got what it takes to be an IT Network Engineer? Like the colour purple? Great. Here's a few more boxes we’re also hoping you can tick:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e5+ years of professional experience implementing and administering multi-site networks\u003c/li\u003e\n\u003cli\u003e5+ years of hands-on experience with Palo Alto firewalls, Aruba and Viptela infrastructure\u003c/li\u003e\n\u003cli\u003e2+ years of hands-on experience with Zscaler ZIA and ZPA\u003c/li\u003e\n\u003cli\u003eExtensive knowledge of Cloud networking in Microsoft Azure\u003c/li\u003e\n\u003cli\u003eExperience with complex network design\u003c/li\u003e\n\u003cli\u003eStrong knowledge of Firewalls, WAFs and Application Gateways\u003c/li\u003e\n\u003cli\u003eStrong knowledge in communication protocols include TCP/IP, VLAN, SIP, BGP and OSPF\u003c/li\u003e\n\u003cli\u003eExpertise with Routing and switching products\u003c/li\u003e\n\u003cli\u003eKnowledge of DNS and DHCP\u003c/li\u003e\n\u003cli\u003eExperience with Bell VNS managed service\u003c/li\u003e\n\u003cli\u003eStrong problem-solving skills, the ability to analyze complex problems and use a systematic approach to find solutions\u003c/li\u003e\n\u003cli\u003eAbility to lift/move up to 50 pounds\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eAt Grant Thornton we’re focused on making a difference in the lives of our clients, our colleagues and our communities. That’s our purpose. Or, as we like to say, living our purple.\u003c/p\u003e\n\u003cp\u003eAre you ready to Discover Your Purple?\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://phh.tbe.taleo.net/phh01/ats/careers/v2/viewRequisition?org=GRANTTHORNTON\u0026amp;cws=56\u0026amp;rid=6258\"\u003ehttps://phh.tbe.taleo.net/phh01/ats/careers/v2/viewRequisition?org=GRANTTHORNTON\u0026amp;cws=56\u0026amp;rid=6258\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eor email: \u003ca href=\"mailto:Gary.Storey@ca.gt.com\"\u003eGary.Storey@ca.gt.com\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://web.archive.org/web/20210507025928/https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbEtpIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--7842f9de4c5b1ed5f0ed0b18104363f8c5a5fc9a/GTlogo-CMYK-large.jpg"},{"id":"e76ffd53-3e85-4bb5-80f2-8a6cd85d1dfd","type":"Full Time","url":"https://web.archive.org/web/20210507025928/https://jobs.github.com/positions/e76ffd53-3e85-4bb5-80f2-8a6cd85d1dfd","created_at":"Thu Apr 29 20:15:17 UTC 2021","company":"Neon One","company_url":"https://web.archive.org/web/20210507025928/https://neonone.com/","location":"Remote","title":"Engineering Specialist Dev/Ops","description":"\u003cp\u003eNeon One is hiring an Engineering Specialist, DevOps for our exciting and fast growing software company that is focused on delivering best-in-class technology solutions to nonprofit organizations.\u003c/p\u003e\n\u003cp\u003eWho are we? A mission-driven software company, working to empower nonprofit organizations with best in class technology solutions. We care about nonprofits and the people who run them, and we're constantly learning and growing.\u003c/p\u003e\n\u003cp\u003eWho are you? You work hard and like to collaborate with others. You're ambitious, driven, and passionate about outside-of- the-box thinking. You care about making good happen in the world and you'd like your job to be more than just a job.\u003c/p\u003e\n\u003cp\u003eWhy work for us? We're growing rapidly. As a part of our team, you'll navigate challenging assignments, grow professionally, and have access to professional development conferences and industry thought leaders. Best of all, you'll get to work with a great group of people that thrives on innovation, collaboration, creativity, and risk-taking.\u003c/p\u003e\n\u003cp\u003eCore Responsibilities\u003c/p\u003e\n\u003cp\u003eArchitecture\u003c/p\u003e\n\u003cp\u003eDesign and implement modern application architectures for products using cloud-native technologies in coordination with Engineering Directors.\u003c/p\u003e\n\u003cp\u003eImplement product integration strategies (between Neon One products) in coordination with Engineering Directors.\u003c/p\u003e\n\u003cp\u003eImprove overall consistency and visibility (dashboarding and documentation) of application architecture\u003c/p\u003e\n\u003cp\u003ePerformance, Uptime, Availability\u003c/p\u003e\n\u003cp\u003eEstablish internal benchmarks for performance, uptime, and availability\u003c/p\u003e\n\u003cp\u003eRecommend and implement strategies to improve overall performance and durability\u003c/p\u003e\n\u003cp\u003eConduct regular load testing and stress-testing of systems\u003c/p\u003e\n\u003cp\u003eInfrastructure Administration and Provisioning\u003c/p\u003e\n\u003cp\u003eAdministrate cloud hosting accounts and manage overall access and security controls\u003c/p\u003e\n\u003cp\u003eSelect and recommend appropriate technologies for new and existing applications\u003c/p\u003e\n\u003cp\u003eOversee the configuration and ongoing maintenance of infrastructure\u003c/p\u003e\n\u003cp\u003eDevelop and implement strategies to reduce costs\u003c/p\u003e\n\u003cp\u003eRoadmap Planning\u003c/p\u003e\n\u003cp\u003eParticipate in the product road mapping process to allocate resources for infrastructure projects.\u003c/p\u003e\n\u003cp\u003eCompliance\u003c/p\u003e\n\u003cp\u003eUnderstand the technical compliance obligations for each Neon One application\u003c/p\u003e\n\u003cp\u003eDevelop and maintain policies, procedures, and configuration standards for all application environments\u003c/p\u003e\n\u003cp\u003eCoordinate evidence gathering and fieldwork for annual third-party audits\u003c/p\u003e\n\u003cp\u003eConduct audit-required technical reviews of systems, controls, and processes\u003c/p\u003e\n\u003cp\u003eConduct scheduled vulnerability scans and internal vulnerability assessments and then assign remediation tasks\u003c/p\u003e\n\u003cp\u003eRisk Management and Incident Response\u003c/p\u003e\n\u003cp\u003eManage incident response policies and procedures\u003c/p\u003e\n\u003cp\u003eConduct annual Risk Assessment\u003c/p\u003e\n\u003cp\u003eConduct annual testing of Incident Response Plan\u003c/p\u003e\n\u003cp\u003eCoordinate wargame simulations of Incidents (at least annually)\u003c/p\u003e\n\u003cp\u003eApplication Development\u003c/p\u003e\n\u003cp\u003eContribute to application development and coding for Neon One products\u003c/p\u003e\n\u003cp\u003eQualifications:\u003c/p\u003e\n\u003cp\u003e3+ years of experience architecting cloud-native web applications\u003c/p\u003e\n\u003cp\u003eTrack record of managing high-utilization production workloads\u003c/p\u003e\n\u003cp\u003eBroad understanding of AWS or Microsoft Azure cloud services\u003c/p\u003e\n\u003cp\u003eExperience with both monolithic and service-oriented architectures\u003c/p\u003e\n\u003cp\u003eWillingness to provide off-hours coverage\u003c/p\u003e\n\u003cp\u003eAWS Certifications desirable\u003c/p\u003e\n\u003cp\u003eC# coding experience desirable\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://neonone.com/about/careers/\"\u003ehttps://neonone.com/about/careers/\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://web.archive.org/web/20210507025928/https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbFNpIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--2f387632747d4e973aa04974c70125941666a4c1/N1-Logo-2020-wh-lg-01.png"},{"id":"824f9f85-2c1e-4617-bf25-76cbe334ff67","type":"Full Time","url":"https://web.archive.org/web/20210507025928/https://jobs.github.com/positions/824f9f85-2c1e-4617-bf25-76cbe334ff67","created_at":"Thu Apr 29 14:03:12 UTC 2021","company":"Remote","company_url":"https://web.archive.org/web/20210507025928/http://www.remote.com","location":"Anywhere","title":"Engineering Team Leader","description":"\u003cp\u003eRemote is THE global platform that enables companies to employ people anywhere in the world, taking away all legal and compliance complexities. Remote handles global payroll, benefits, taxes, and compliance for businesses big and small. (read more about \u003ca href=\"https://remote.com/how-it-works\"\u003ehow it works\u003c/a\u003e).\u003c/p\u003e\n\u003cp\u003eWe encourage folks from all ethnic groups, genders, sexuality, age and abilities to apply. We value kindness, ownership and team collaboration. You can check out our \u003ca href=\"https://remote.com/handbook\"\u003epublic handbook\u003c/a\u003e. to learn more about our culture. If this job description resonates with you, we want to hear from you!\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eHow we work\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eRemote is fully remote (ah!) and we love \u003ca href=\"https://www.notion.so/Working-Async-80c01cd443ad4c77a8ceaef7c5fba5d0\"\u003eWorking Async\u003c/a\u003e. This means you get to do your own schedule no matter the timezone. The Remote Engineering team uses a simple approach to productivity and task management and you can read more about it in \u003ca href=\"https://www.notion.so/remotecom/The-Remote-Flow-4ccc721f6dde40e4b5c91dd8e47e77c7\"\u003eThe Remote Flow\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eThe team you'll be joining: 33 engineers, spanning across Frontend, Backend, SRE and QA. We're organised into product teams composed with engineers, designers, product managers, operations and finance, each dedicated to achieving the same goals in a specific domain.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eRequirements\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eMore information about this role in Remote's engineering career path on our public Handbook \u003ca href=\"https://www.notion.so/remotecom/944f6f4aaf7246aaba75096b4baf3ee0?v=f84d1995052d4b87a2583cb1f2b67ebf\"\u003ehere\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMust have (professional experience):\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eManaged an engineering team of at least 2 people for a year\u003c/li\u003e\n\u003cli\u003eOver 3 years of experience with Frontend (React, JS, ES6 and Jest) or Backend (Elixir/Phoenix)\u003c/li\u003e\n\u003cli\u003eGreat communication skills\u003c/li\u003e\n\u003cli\u003eAwesome attention to detail\u003c/li\u003e\n\u003cli\u003eProactive attitude\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eResponsibilities\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eManage a small product team of 3-5 engineers (backend and frontend)\u003c/li\u003e\n\u003cli\u003eBe involved in hiring processes\u003c/li\u003e\n\u003cli\u003eActively participate in product development. Max 30% of time spent doing management work.\u003c/li\u003e\n\u003cli\u003eProvide guidance and mentoring to the team.\u003c/li\u003e\n\u003cli\u003eFollow the team leader career requirements defined \u003ca href=\"https://www.notion.so/remotecom/944f6f4aaf7246aaba75096b4baf3ee0?v=f84d1995052d4b87a2583cb1f2b67ebf\"\u003ehere\u003c/a\u003e\n\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eBenefits\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eUnlimited personal time off - Read our \u003ca href=\"https://www.notion.so/Time-off-e2e71e5dcdef43ff82515d7c711ed4af\"\u003etime off\u003c/a\u003e policy\u003c/li\u003e\n\u003cli\u003eThe equipment/tools you need to do your job well and comfortable\u003c/li\u003e\n\u003cli\u003eTraining budget\u003c/li\u003e\n\u003cli\u003eGood salary and company options\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eApplication process\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e(async) Application is reviewed\u003c/li\u003e\n\u003cli\u003eInterview with our recruiter\u003c/li\u003e\n\u003cli\u003eInterview with your future manager (CTO)\u003c/li\u003e\n\u003cli\u003e(async) Take home assignment\u003c/li\u003e\n\u003cli\u003eInterview with the team (without any manager in the call so you can really get to know the people and ask all you want to ask)\u003c/li\u003e\n\u003cli\u003eInterview with CEO\u003c/li\u003e\n\u003cli\u003e(async) Offer\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://grnh.se/a3a4ed663us\"\u003ehttps://grnh.se/a3a4ed663us\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://web.archive.org/web/20210507025928/https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaytpIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--4e6221ce6c6338f77a4df9765be89c57e4913da1/pJ-7_0_R_400x400.png"},{"id":"110eefc5-9d6a-4b70-a278-38a134f83082","type":"Full Time","url":"https://web.archive.org/web/20210507025928/https://jobs.github.com/positions/110eefc5-9d6a-4b70-a278-38a134f83082","created_at":"Thu Apr 29 11:34:40 UTC 2021","company":"InnovestIT Group","company_url":"https://web.archive.org/web/20210507025928/https://innovestit.com/","location":"Ede","title":"Senior Back End Developer","description":"\u003cp\u003e\u003cstrong\u003eSenior Back End Developer\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWegens uitbreiding van ons development zijn we op zoek naar een Senior Back End Developer. Ben jij op zoek naar een baan waarin je continue wordt uitgedaagd om het beste uit jezelf te halen? Vind je het leuk om met state of the art ontwikkeltools te werken? Reageer dan op deze vacature!\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eHet development team\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eHet development team bestaat uit enthousiaste en gedreven developers, elk gespecialiseerd in een eigen domein met daarnaast enkele domeinen die breder worden gedragen. Onze software wordt ontworpen met Domain Driven Design. Onze serverapplicaties zijn opgezet volgens een softwarearchitectuur op basis van Command Query Reponsibility Segregation (CQRS). Onze desktop-client is gebaseerd op Angular en onze native mobile apps zijn gebaseerd op Xamarin/ Flutter. We maken gebruik van Visual Studio 2019, C#, .Net Core en Typescript. Daarnaast hebben we een geavanceerde CI/CD pipeline. Alle klanten in de cloud werken op deze latest and greatest softwareversie en we deployen elke dag naar productie vanuit de masterbranch.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003e\"Als ontwikkelaar ben je van groot belang binnen de organisatie. Je hebt een afwisselende functie waarbij innovatie en continue ontwikkeling centraal staan. Binnen de organisatie krijg je de kans om nieuwe kennis op te doen, te delen, jezelf te ontwikkelen en met het team naar een nog hoger niveau te stijgen.\"\u003c/em\u003e - Michiel Berkhof, developer bij Easy Systems sinds 2010.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eDe rol\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAls Senior Back End Developer ben jij verantwoordelijk voor de inrichting van onze command services. Deze zijn geschreven met .NET Core. De data slaan we op in EventStoreDB en de communicatie tussen services verloopt via RabbitMQ. API’s specificeren we op basis van de OpenAPI specification. Je gaat aan de slag op basis van de user features die onze Product Owner heeft geschreven. Dit doet hij op basis van Specification By Example en hij maakt gebruik van Specflow (Gherkin). De deployment van onze software heeft een hoge automatiseringsgraad en wij gebruiken daarvoor docker containers en Kubernetes.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eDe organisatie\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eEasy Systems ontwikkelt ERP-onafhankelijke software voor het optimaliseren van financiële bedrijfsprocessen. Met onze intuïtieve en slimme software helpen wij organisaties om kostenvoordelen te behalen. Om dit te bereiken is het gebruiksgemak van de software van groot belang. Plezierig werken verhoogt de productiviteit en kwaliteit van het werk en dus het succes van de organisatie. De software van Easy Systems helpt organisaties om hun processen efficiënter, inzichtelijker en overzichtelijker te maken.\nEasy Systems is onderdeel van de InnovestIT Group. Een groep bedrijven die, met hun producten en diensten, een toegevoegde waarde levert aan het gehele transactionele en administratieve proces.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWat kan je van ons verwachten als werkgever naast passende primaire arbeidsvoorwaarden?\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eEen persoonlijke werkgever en de kans om te werken met state of the art development tools en technieken.\u003c/li\u003e\n\u003cli\u003eEen sterke betrokkenheid vanuit de directie bij het development team en proces.\u003c/li\u003e\n\u003cli\u003eDe mogelijkheid om jezelf continu te ontwikkelen. Geregeld volgen onze developers interne en externe trainingen omtrent actuele thema’s en tools. Deze kennis wordt daarna ook overgedragen op de andere collega’s.\u003c/li\u003e\n\u003cli\u003eElke vrijdag een geheel verzorgde lunch en (voor de liefhebbers) een afsluitende borrel op kantoor.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWat zoeken wij in onze nieuwe collega:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eEnthousiasme voor een innovatie en moderne softwareaanpakken: Denk hierbij aan .Net Core, Docker, Kubernetes, CQRS met Event Sourcing en DDD.\u003c/li\u003e\n\u003cli\u003eAnalytisch vermogen: We werken met een moderne (en complexe) software architectuur. Het is van belang dat je beschikt over een gezonde dosis analytisch vermogen om concepten goed te kunnen doorgronden en complexe problemen op te lossen.\u003c/li\u003e\n\u003cli\u003eTechnische kennis en ervaring: We verwachten dat je niet alles kent en weet, sterker nog, we helpen je graag in je ontwikkeling. Het is wel handig als je kennis hebt van ASP.net Core en de SOLID principes.\u003c/li\u003e\n\u003cli\u003eEen afgeronde technische opleiding; Informatica/Software engineering is relevant, maar iemand bij (bijvoorbeeld) een wiskundige achtergrond kan ook goed aansluiten.\u003c/li\u003e\n\u003cli\u003eEen teamplayer; Onderlinge samenwerking, communicatie en kennisdeling is erg belangrijk binnen ons development team.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eGeïnteresseerd?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eHeb je zin om aan de slag te gaan? Solliciteer dan nu via \u003ca href=\"https://ltpx.nl/N9CVZ8G\"\u003e\u003cstrong\u003ehet sollicitatieformulier\u003c/strong\u003e\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eAcquisitie naar aanleiding van deze vacature wordt niet op prijs gesteld.\u003c/em\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://ltpx.nl/XODbfuS\"\u003eKlik hier om te solliciteren\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://web.archive.org/web/20210507025928/https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBa3lpIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--dd8d9d5d9f7089c53761a334a0b9bfa2d990df05/shutterstock_image%20(3).png"},{"id":"f4cea646-1f1c-4d8e-baf8-bd561282a982","type":"Full Time","url":"https://web.archive.org/web/20210507025928/https://jobs.github.com/positions/f4cea646-1f1c-4d8e-baf8-bd561282a982","created_at":"Thu Apr 29 09:26:07 UTC 2021","company":"Scanbot / doo GmbH","company_url":"https://web.archive.org/web/20210507025928/https://scanbot.io","location":"Bonn, Germany","title":"Senior Cross-Platform Developer (m/f/d) - For our location in Bonn","description":"\u003cp\u003eHi!\u003c/p\u003e\n\u003cp\u003eWe are Scanbot / doo GmbH! We are a German software development company founded in 2011, with business presences in Bonn and San Francisco. Scanbot enables the integration of scanning and data extraction functionalities into existing mobile applications for the insurance, healthcare, logistics, and banking industry. The Software Development Kit (SDK) utilizes highly sophisticated algorithms and machine learning to integrate scanning functionalities and data extraction into any app. More than 200 businesses worldwide use the Scanbot SDK, including DAX 30 and Fortune 500 companies. Scanbot is backed by three venture capital companies: Freigeist, Target Partners, and Evoco.\u003c/p\u003e\n\u003cp\u003eWe are looking for a Senior Cross-Platform Developer (m/f/d) here in Bonn. In this role, you will develop and integrate innovative core features for our successful B2B product Scanbot SDK using the cross-platform frameworks Xamarin \u0026amp; Xamarin.Forms, Flutter, React Native, Cordova, and Capacitor as well as web technologies like WebAssembly. You will be joining an experienced, multicultural, and enthusiastic team, with lots of great opportunities for professional, and personal growth. Your code will be used by millions of users every month!\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat you will be doing\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eHelp architect, build, iterate, and manage our SDK.\u003c/li\u003e\n\u003cli\u003eIntegrate existing and new functionality into our cross-platform wrappers.\u003c/li\u003e\n\u003cli\u003eDevelop and maintain our SDK example apps for iOS, Android, and Web.\u003c/li\u003e\n\u003cli\u003eResearch and develop plugin solutions for new cross-platform technologies.\u003c/li\u003e\n\u003cli\u003ePartner closely with product management to continuously improve our product offering.\u003c/li\u003e\n\u003cli\u003eHelp to raise the overall skill and quality level through pairing, design/code reviews.\u003c/li\u003e\n\u003cli\u003eDesign and implement automated tests.\u003c/li\u003e\n\u003cli\u003eInvestigate and fix bugs reported by the QA team and our customers.\u003c/li\u003e\n\u003cli\u003eImprove the cutting edge scanning and data extraction SDK.\u003c/li\u003e\n\u003cli\u003eResearch and use new technologies like AI and ML.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWhat we are looking for\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e3+ years of experience in developing Android and iOS applications is desirable.\u003c/li\u003e\n\u003cli\u003eGood programming skills in Kotlin, Java, Swift, and Objective-C.\u003c/li\u003e\n\u003cli\u003eGood programming skills in at least one of the following languages: JavaScript, TypeScript, C#.\u003c/li\u003e\n\u003cli\u003eWillingness to become a good coder in all of them.\u003c/li\u003e\n\u003cli\u003eExperience with at least two of the following cross-platform technologies: Cordova or Capacitor, React - Native, Flutter, Xamarin, WebAssembly. Willingness to become an expert in all of them.\u003c/li\u003e\n\u003cli\u003eExperience with web frameworks like Angular, React or Vue.js is a plus.\u003c/li\u003e\n\u003cli\u003eUnderstanding of Android and iOS design principles.\u003c/li\u003e\n\u003cli\u003eExperience with common software development tools like git (GitHub), bug, and issue tracking (JIRA).\u003c/li\u003e\n\u003cli\u003eFluency in English.\u003c/li\u003e\n\u003cli\u003eExperiences in the following areas would be a plus:\u003c/li\u003e\n\u003cli\u003eExperience in testing mobile and web apps (unit and integration tests).Fluency in German or other languages.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWhat you can expect from us\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eResponsibility from the day you start.\u003c/li\u003e\n\u003cli\u003eFlat hierarchies with the opportunity to influence the company from the beginning.\u003c/li\u003e\n\u003cli\u003eAn experienced and inspiring team that is willing to ship improvements and features continuously.\u003c/li\u003e\n\u003cli\u003eA multitude of possibilities to improve professionally and personally.\u003c/li\u003e\n\u003cli\u003eA “get it done” policy and fast decision making in a motivated, diverse, and open-minded team.\u003c/li\u003e\n\u003cli\u003eA lived, mutual feedback culture.\u003c/li\u003e\n\u003cli\u003eBe part of a company with sustained strong growth - we are just getting started.\u003c/li\u003e\n\u003cli\u003eState of the art tools and equipment (latest MacBooks / mobile devices/displays).\u003c/li\u003e\n\u003cli\u003eBeautiful and modern office right next to the Rhine river.\u003c/li\u003e\n\u003cli\u003eEasily accessible by train and car from the whole Cologne / Bonn area.\u003c/li\u003e\n\u003cli\u003eAn agile and flexible way of working.\u003c/li\u003e\n\u003cli\u003eSweet and healthy snacks and a large selection of drinks.\u003c/li\u003e\n\u003cli\u003e\"Come as you are Dresscode\".\u003c/li\u003e\n\u003cli\u003eLived Work-life balance.\u003c/li\u003e\n\u003cli\u003eAnd many more benefits.\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://scanbot.join.com/jobs/2190458-senior-cross-platform-developer-m-f-d-for-our-location-in-bonn?pid=357a3b4531918760973f\u0026amp;oid=c9dbdbcf-caff-4367-a266-438ae2667fa3\u0026amp;utm_source=github_jobs\u0026amp;utm_medium=paid\u0026amp;utm_campaign=single%2Bposting\u0026amp;utm_content=senior%2Bcross-platform%2Bdeveloper%2Bm%2Bf%2Bd%2B-%2Bfor%2Bour%2Blocation%2Bin%2Bbonn\"\u003ehttps://scanbot.join.com/jobs/2190458-senior-cross-platform-developer-m-f-d-for-our-location-in-bonn?pid=357a3b4531918760973f\u0026amp;oid=c9dbdbcf-caff-4367-a266-438ae2667fa3\u0026amp;utm_source=github_jobs\u0026amp;utm_medium=paid\u0026amp;utm_campaign=single%2Bposting\u0026amp;utm_content=senior%2Bcross-platform%2Bdeveloper%2Bm%2Bf%2Bd%2B-%2Bfor%2Bour%2Blocation%2Bin%2Bbonn\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://web.archive.org/web/20210507025928/https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBa2lpIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--d2500cf676e655afcc4ca030a67534201e3fe4ed/scanbot-sdk-1567511514-logo.png"},{"id":"613cd396-c9e8-445e-93a2-fd1c78e7ee71","type":"Full Time","url":"https://web.archive.org/web/20210507025928/https://jobs.github.com/positions/613cd396-c9e8-445e-93a2-fd1c78e7ee71","created_at":"Thu Apr 29 09:13:39 UTC 2021","company":"y42","company_url":"https://web.archive.org/web/20210507025928/https://www.y42.com","location":"Remote","title":"Lead Frontend Architect - Angular 11+ (m/f/d)","description":"\u003cp\u003ey42 is a Berlin-based SaaS company with a straightforward mission: Making it easy for everyone to use their data productively.\u003c/p\u003e\n\u003cp\u003eTo achieve this, we build a no-code business intelligence platform for loading, cleaning, connecting, visualizing and sharing data.\u003c/p\u003e\n\u003cp\u003ey42 was founded in 2020 and today already compiles a team of 25 data witches and wizards, software magicians as well as business geeks from 10 nationalities. We are backed by international top-tier investors that deeply believe in our vision of frictionless business intelligence.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eTasks\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eIn this role, you will be responsible for building a scalable frontend architecture and lead our frontend team. At the very core of our DNA, we are a product-driven company and your position is one of the most important hires for us.\u003c/p\u003e\n\u003cp\u003eYou will work with a highly ambitious team that strives to build the world’s leading no-code business intelligence software and become the next European Unicorn. Our Tech Stack: \u003ca href=\"https://stackshare.io/y42/y42\"\u003ehttps://stackshare.io/y42/y42\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eYou will:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDevelop a scalable frontend architecture, using best practices to improve code maintainability and performance\u003c/li\u003e\n\u003cli\u003eWork on a big and challenging Front-End Project\u003c/li\u003e\n\u003cli\u003eSupport other Frontend Developers to enhance their skills with code reviews and coaching\u003c/li\u003e\n\u003cli\u003eCollaborate with cross-functional teams (Product Managers, Designers, Analysts) and with the senior management, helping to ignite further growth of the company\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eRequirements\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe role is perfect for you if you:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eHave 5+ years of experience in software engineering\u003c/li\u003e\n\u003cli\u003eAre very experienced and in love with Angular 11+ and Typescript\u003c/li\u003e\n\u003cli\u003eHave a sense for UI/UX and understand the user journey on our platform\u003c/li\u003e\n\u003cli\u003eHave designed, built and scaled production applications\u003c/li\u003e\n\u003cli\u003eHave a high degree of proactiveness, diligence and a get-stuff-done mentality\u003c/li\u003e\n\u003cli\u003eKnow best practices to produce high-quality code and deep understanding of object-oriented programming\u003c/li\u003e\n\u003cli\u003eAre ambitious and want to grow in an extremely fast-moving environment\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eBenefits\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eThe opportunity to significantly shape a VC-backed company in its early days\u003c/li\u003e\n\u003cli\u003eA competitive salary along with great employee stock options to participate in the company’s success\u003c/li\u003e\n\u003cli\u003eWeekly team lunches and regular team events\u003c/li\u003e\n\u003cli\u003eA fully equipped office inside a vibrant community of other tech startups and innovators\u003c/li\u003e\n\u003cli\u003eState-of-the-art work equipment, incl. MacBook Pro, monitor and headphones of choice\u003c/li\u003e\n\u003cli\u003ePublic transport pass\u003c/li\u003e\n\u003cli\u003eFree fruits and beverages\u003c/li\u003e\n\u003cli\u003eThe flexibility to work from home or our office\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003ey42 is proud to be an equal opportunity employer prohibiting discrimination and harassment of any kind. We want to work with the best people no matter how they look, dress or speak, or whom they love, believe in, or aspire. We are committed to building a team that represents various backgrounds, perspectives, and skills, as we believe diverse teams with complementary skill sets make the strongest teams.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://y42.join.com/jobs/2183369-lead-frontend-architect-angular-11-m-f-d?pid=357a3b4531918760973f\u0026amp;oid=3336edb2-ac6e-4248-9c69-af843bf3890d\u0026amp;utm_source=github_jobs\u0026amp;utm_medium=paid\u0026amp;utm_campaign=single%2Bposting\u0026amp;utm_content=lead%2Bfrontend%2Barchitect%2Bangular%2B11%2Bm%2Bf%2Bd\"\u003ehttps://y42.join.com/jobs/2183369-lead-frontend-architect-angular-11-m-f-d?pid=357a3b4531918760973f\u0026amp;oid=3336edb2-ac6e-4248-9c69-af843bf3890d\u0026amp;utm_source=github_jobs\u0026amp;utm_medium=paid\u0026amp;utm_campaign=single%2Bposting\u0026amp;utm_content=lead%2Bfrontend%2Barchitect%2Bangular%2B11%2Bm%2Bf%2Bd\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://web.archive.org/web/20210507025928/https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBa2FpIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--b78d2e294cb8a0754c50faa65ab572ee16d564ca/datos-intelligence-gmb-h-logo-xl.png"},{"id":"d8562e02-ff01-4322-af0b-2e161808e854","type":"Full Time","url":"https://web.archive.org/web/20210507025928/https://jobs.github.com/positions/d8562e02-ff01-4322-af0b-2e161808e854","created_at":"Thu Apr 29 08:38:08 UTC 2021","company":"Kubikx GmbH","company_url":"https://web.archive.org/web/20210507025928/http://kubikx.com","location":"Remote","title":"Fullstack Engineer - R\u0026D (m/w/d)","description":"\u003cp\u003e\u003cstrong\u003eYour Mission\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eKUBIKx develops digital ventures for the logistics and transportation space.\nAs a Fullstack Engineer, you will create high-quality prototypes that will eventually become the core product of a new venture. Your team’s mission is to make sure that all of our ideas leverage the latest technology trends such as AI/ML, Crypto, or IoT. You’re going to be part of the ideation process from the start and will support the venture ideation \u0026amp; building by creating PoCs, working prototypes and MVPs.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eYour Tasks\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eParticipate in the venture ideation process early on.\u003c/li\u003e\n\u003cli\u003eDevelop cutting-edge technological concepts and choose a custom-fit tech stack.\u003c/li\u003e\n\u003cli\u003eBuild high-quality prototypes that will eventually become the core product of a new venture.\u003c/li\u003e\n\u003cli\u003eSupport the development of the first product iteration to build a successful venture.\u003c/li\u003e\n\u003cli\u003eBe responsible for the entire development cycle – from architecture to implementation, testing, deployment, and maintenance.\u003c/li\u003e\n\u003cli\u003eWork closely with your peers and challenge your ideas and approaches.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eYour Profile\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eYou look at your software from the customer’s point of view.\u003c/li\u003e\n\u003cli\u003eYou are passionate about evaluating how emerging technologies could solve user problems better.\u003c/li\u003e\n\u003cli\u003eYou have at least 3 years of commercial experience working in the frontend and/or backend.\u003c/li\u003e\n\u003cli\u003eYou have strong communication skills in both English and German (at least B2).\u003c/li\u003e\n\u003cli\u003eYou work well independently and in a team.\u003c/li\u003e\n\u003cli\u003eYou do love to code and have broad experience with a wide set of technologies (Java, Javascript, Python, SQL, NoSQL, REST, Docker, GCP/AWS,...)\u003c/li\u003e\n\u003cli\u003eYou are a fast learner and will be able to teach yourself any technology that will be required to solve a given challenge.\u003c/li\u003e\n\u003cli\u003eYou are creative and a never-ending source for innovative ideas. Be aware, nobody will write you a ticket!\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eBenefits\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eThe opportunity to make a lasting impact by shaping how logistics will look like in the future.\u003c/li\u003e\n\u003cli\u003eBe an essential member of a smart and committed cross-functional team with the backup of a European market leader.\u003c/li\u003e\n\u003cli\u003eAct as an entrepreneur with a high degree of creative freedom and execution flexibility.\u003c/li\u003e\n\u003cli\u003eA competitive salary and of course free coffee and drinks, fresh fruits and relaxed team socials.\u003c/li\u003e\n\u003cli\u003eFlexible working times from home or in an attractive central location in Berlin.\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://kubikx.join.com/jobs/2193215-fullstack-engineer-r-and-d-m-w-d?pid=357a3b4531918760973f\u0026amp;oid=ac73b15b-41a3-40f4-86e0-c35e1a7ade94\u0026amp;utm_source=github_jobs\u0026amp;utm_medium=paid\u0026amp;utm_campaign=single%2Bposting\u0026amp;utm_content=fullstack%2Bengineer%2B-%2Br%2Band%2Bd%2Bm%2Bw%2Bd\"\u003ehttps://kubikx.join.com/jobs/2193215-fullstack-engineer-r-and-d-m-w-d?pid=357a3b4531918760973f\u0026amp;oid=ac73b15b-41a3-40f4-86e0-c35e1a7ade94\u0026amp;utm_source=github_jobs\u0026amp;utm_medium=paid\u0026amp;utm_campaign=single%2Bposting\u0026amp;utm_content=fullstack%2Bengineer%2B-%2Br%2Band%2Bd%2Bm%2Bw%2Bd\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://web.archive.org/web/20210507025928/https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBa1NpIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--d2cd2ff0335bf56c37047cfe110e388ceb24049c/kubikx.png"},{"id":"74f660aa-73c6-491e-98d5-ee7969a1f847","type":"Full Time","url":"https://web.archive.org/web/20210507025928/https://jobs.github.com/positions/74f660aa-73c6-491e-98d5-ee7969a1f847","created_at":"Thu Apr 29 08:32:11 UTC 2021","company":"kernpunkt Digital GmbH","company_url":"https://web.archive.org/web/20210507025928/https://www.kernpunkt.de","location":"Remote","title":"Full Stack Developer (m/w/d)","description":"\u003cp\u003eWir sind kernpunkt, eine Agentur in Köln mit Fokus auf Digital Commerce. Unsere Teams unterstützen mittelständische Kunden, Konzerne und Start-Ups bei den Herausforderungen im digitalen Handel. Hierbei setzen wir auf moderne Technologien und agile Arbeitsmethoden, auf Cloud-Infrastrukturen und API-First-Konzepte.\u003c/p\u003e\n\u003cp\u003eWir verstehen uns als Partner unserer Kunden, die von unseren Teams langfristig betreut werden. Unsere Teams sind eigenständig, übernehmen Verantwortung für die gemeinsam entwickelten Lösungen und sorgen durch offene Kommunikation und Transparenz für eine partnerschaftliche Zusammenarbeit.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAufgaben\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAls Full Stack Developer (m/w/d) bist du Teil eines unserer Teams. Du übernimmst zügig Verantwortung in dem agilen Team und unterstützt dieses mit Deinen Fähigkeiten und Deinem Wissen. Dabei bringst Du schon praktische Erfahrung mit oder lernst hier den Umgang mit modernen Technologien wie React, Vue.js oder Node.js. Du hilfst dem Team dabei, sich fachlich weiterzuentwickeln und Verantwortung in den Kundenprojekten zu übernehmen. Dank Deiner umfangreichen Expertise wirst Du schnell zu einem essentiellen Bestandteil.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eQualifikation\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eDas erwartet das Team von Dir:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003ePraktische Erfahrung in der Frontend- sowie Backendentwicklung (beispielsweise mit Vue.js, React, Javascript, PHP oder Node.js)\u003c/li\u003e\n\u003cli\u003eFundierte Kenntnisse im API-, Shop- und CMS-Development - wir nutzen aktuell, je nach Projekt, commercetools, Spryker, Algolia oder Contentful\u003c/li\u003e\n\u003cli\u003eErfahrung in der agilen Softwareentwicklung und Verinnerlichung der agilen Werte\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eZudem wünschen wir uns von Dir:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eKreativität und hohe Lösungsorientierung verbunden mit Qualitätsbewusstsein\u003c/li\u003e\n\u003cli\u003eSicherer Umgang im Kundenkontakt sowie betriebswirtschaftliche Denkweise\u003c/li\u003e\n\u003cli\u003eTeamfähigkeit, Flexibilität sowie eigenverantwortliches Arbeiten\u003c/li\u003e\n\u003cli\u003eInteresse an Trends und neuen Technologien aus dem Digital Commerce Umfeld\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eBenefits\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eUns ist es wichtig Dir mehr als nur einen Job zu bieten. Deshalb hier fünf Gründe, bei kernpunkt zu arbeiten:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eAgiles Arbeiten in festen Teams mit klarem Kundenfokus\u003c/li\u003e\n\u003cli\u003eProjekte auf Basis zukunftsorientierter Technologien wie Spryker, commercetools und Shopify Plus mit genügend Zeit und Freiraum für Weiterbildung\u003c/li\u003e\n\u003cli\u003eModernes Arbeitsumfeld mit freier Notebook-Wahl, Home Office sowie Arbeits- und Entwicklungstools in der Cloud\u003c/li\u003e\n\u003cli\u003eFaire Bezahlung bei vollem Überstundenausgleich und Vertrauensarbeitszeiten\u003c/li\u003e\n\u003cli\u003eUnd: Ein tolles Büro in Köln-Ehrenfeld mit offenen Kollegen, eigenem Fitnessraum, Playstation, Dachterrasse und Platz zum Feiern\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eInteresse? Dann bewirb Dich jetzt bei uns:\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWir freuen uns auf Deine Bewerbung. Um es einfach zu halten, verzichten wir gerne auf ein Anschreiben, denn wir brauchen von Dir nur:\u003c/p\u003e\n\u003cp\u003eDeinen aktuellen Lebenslauf,\u003c/p\u003e\n\u003cp\u003eDein gewünschtes Eintrittsdatum,\nDeine Gehaltsvorstellung\nUnd in einem Satz, was Du von Deinem Job bei kernpunkt erwartest.\u003c/p\u003e\n\u003cp\u003e(Schwerbehinderte werden bei gleicher Eignung bevorzugt berücksichtigt.)\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://kernpunkt.join.com/jobs/2192239-full-stack-developer-m-w-d-modern-technology?pid=357a3b4531918760973f\u0026amp;oid=22e2168a-0a45-4a89-9e86-03ed259a6283\u0026amp;utm_source=github_jobs\u0026amp;utm_medium=paid\u0026amp;utm_campaign=single%2Bposting\u0026amp;utm_content=full%2Bstack%2Bdeveloper%2Bm%2Bw%2Bd%2B-%2Bmodern%2Btechnology\"\u003ehttps://kernpunkt.join.com/jobs/2192239-full-stack-developer-m-w-d-modern-technology?pid=357a3b4531918760973f\u0026amp;oid=22e2168a-0a45-4a89-9e86-03ed259a6283\u0026amp;utm_source=github_jobs\u0026amp;utm_medium=paid\u0026amp;utm_campaign=single%2Bposting\u0026amp;utm_content=full%2Bstack%2Bdeveloper%2Bm%2Bw%2Bd%2B-%2Bmodern%2Btechnology\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://web.archive.org/web/20210507025928/https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBa0tpIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--800bf65c2ee4783661f82e20d7854129ccd9105f/kernpunkt_logo_sticky@2x.png"},{"id":"1ff1b334-5b36-47d5-90bd-ad3eca6f8786","type":"Full Time","url":"https://web.archive.org/web/20210507025928/https://jobs.github.com/positions/1ff1b334-5b36-47d5-90bd-ad3eca6f8786","created_at":"Thu Apr 29 07:39:34 UTC 2021","company":"Volkswagen Gebrauchtfahrzeughandels und Service GmbH","company_url":"https://web.archive.org/web/20210507025928/http://www.vgsg.de/","location":"Hannover / Langenhagen","title":"BI Cloud Data Engineer (m/w/d)","description":"\u003cp\u003eIm Bereich IT der Volkswagen Gebrauchtfahrzeughandels und Service GmbH ist das Business Intelligence Competency Center (BICC) für die Marke Nutzfahrzeuge angesiedelt. Mit unserem Team, mit Prozesswissen, Technologien, agilen Methoden und einem hohen Automatisierungsgrad generieren wir gemeinsam effiziente und bedarfsgerechte BI-Lösungen. Unsere Kunden nutzen diese Informationen als optimale Basis für Unternehmensentscheidungen.\u003c/p\u003e\n\u003cp\u003eZum nächstmöglichen Zeitpunkt suchen wir am Standort Hannover/ Langenhagen einen\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eBI Cloud Data Engineer (m/w/d)\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eIhre Aufgaben\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDatengetriebene Cloud-Lösungen / Applikationen (z.B. mit Azure SQL DWH, Azure Synapse, Data-Factory, Data-Brixx, CosmosDb, Functions uvm.) konzipieren, entwickeln und warten\u003c/li\u003e\n\u003cli\u003eCloud-Architekturen (z. B. Lambda, Lakehouse) anwenden, entwickeln und warten\u003c/li\u003e\n\u003cli\u003eEntwicklungsstandards sowie Templates (ARM, Terraform uvm.) entwickeln und anwenden\u003c/li\u003e\n\u003cli\u003eDatenbereitstellungsprozesse (ETL, ELT, Streaming) auf Basis unterschiedlicher Strukturierungsformen (z.B. relational, xml, json, parquet) entwickeln und pflegen\u003c/li\u003e\n\u003cli\u003eEntwicklung von Schnittstellen und APIs mit Python, Powershell, CLI uvm.\u003c/li\u003e\n\u003cli\u003eFachbereichsapplikationen konzipieren, entwickeln und warten\u003c/li\u003e\n\u003cli\u003eCloud-Dienste evaluieren, testen und auf die Zielarchitektur anpassen\u003c/li\u003e\n\u003cli\u003eDatenbankmodelle erstellen und implementieren\u003c/li\u003e\n\u003cli\u003eDatenquellen profilen und hinsichtlich Datenqualität analysieren\u003c/li\u003e\n\u003cli\u003eSystementwicklung nach Cloud spezifischen DevOps-Konzepten\u003c/li\u003e\n\u003cli\u003eKonzeption und Entwicklungsergebnisse nach Konzernstandard (IT-PEP agil) dokumentieren\u003c/li\u003e\n\u003cli\u003eRegelmäßige Abläufe von Systemjobs und Schnittstellen monitoren\u003c/li\u003e\n\u003cli\u003eTechnische Teilprojektleitung übernehmen\u003c/li\u003e\n\u003cli\u003eKonzepte zur Automatisierung erstellen und in Projekten implementieren\u003c/li\u003e\n\u003cli\u003eStammdatenmanagement ausbauen, verwalten und unterstützen\u003c/li\u003e\n\u003cli\u003eBeim Einsatz von agilen Softwareentwicklungsmethoden im Projektteam unterstützen\u003c/li\u003e\n\u003cli\u003eBerichte und Präsentationen vorbereiten und eigenständig präsentieren\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eIhr Profil\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eStudium der Wirtschaftsinformatik mit Schwerpunkt BI, Data Management, Cloud Computing oder vergleichbare Qualifikation (z. B. Fachinformatiker) mit Zusatzqualifikation\u003c/li\u003e\n\u003cli\u003eErste Erfahrungen in datengetriebenen Cloud-Projekten (Azure, Google uvm.)\u003c/li\u003e\n\u003cli\u003eGute Kenntnisse in zukunftsfähigen Programmiersprachen (Python, Azure CLI, Powershell)\u003c/li\u003e\n\u003cli\u003eGute Kenntnisse in der Analyse und Visualisierung von Daten\u003c/li\u003e\n\u003cli\u003eGrundkenntnisse im Bereich Business-Intelligence (Datenbanken, Data Warehouse, OLAP)\u003c/li\u003e\n\u003cli\u003eGrundkenntnisse in der Anwendung von Tools zur Datenbereitstellung ELT/ETL (z.B. Wherescape, Informatica, SSIS, SQL)\u003c/li\u003e\n\u003cli\u003eAnalytische und konzeptionelle Fähigkeiten\u003c/li\u003e\n\u003cli\u003eZuverlässigkeit, Engagement\u003c/li\u003e\n\u003cli\u003eSystematische, strukturierte und selbstständige Arbeitsweise\u003c/li\u003e\n\u003cli\u003eSicher im Umgang mit komplexen Zusammenhängen\u003c/li\u003e\n\u003cli\u003eAnwenderorientiertes Denken\u003c/li\u003e\n\u003cli\u003eTeamorientierte Arbeitsweisen\u003c/li\u003e\n\u003cli\u003eSichereres Auftreten, hohe Belastbarkeit und Durchsetzungsfähigkeit\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eDie Vergütung erfolgt je nach Qualifikation auf der Basis des jeweils gültigen Tarifvertrags der niedersächsischen Metallindustrie.\nWenn Sie eine neue Herausforderung reizt, freuen wir uns auf Ihre vollständige Online-Bewerbung.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://camo.githubusercontent.com/f8a09a1c0409e70dd1c695ca4ea11dc27b450714/68747470733a2f2f742e676f686972696e672e636f6d2f682f64386138663666623731646537383038656264306538376133613630633035323535633361333966353936343231643664653139643063306239353661643837\"\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://t.gohiring.com/h/4aaa7c7e61b48439613c3f0b5dd4287180beafde549ce38af3f1d7f104ab479f\"\u003eapplication form\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://web.archive.org/web/20210507025928/https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBa0NpIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--c96c5fe46ff4a13065b69ccc81c8f8378a0e6ec1/Volkswagen%20Gebrauchtfahrzeughandels%20und%20Service%20GmbH.jpeg"},{"id":"ed6cdccb-312c-424c-915e-1f9e145c8470","type":"Full Time","url":"https://web.archive.org/web/20210507025928/https://jobs.github.com/positions/ed6cdccb-312c-424c-915e-1f9e145c8470","created_at":"Thu Apr 29 07:32:55 UTC 2021","company":"Volkswagen Gebrauchtfahrzeughandels und Service GmbH","company_url":"https://web.archive.org/web/20210507025928/http://www.vgsg.de/","location":"Hannover / Langenhagen","title":"BI Cloud Solution Architect (m/w/d)","description":"\u003cp\u003eIm Bereich IT der Volkswagen Gebrauchtfahrzeughandels und Service GmbH ist das Business Intelligence Competency Center (BICC) für die Marke Nutzfahrzeuge angesiedelt. Mit unserem Team, mit Prozesswissen, Technologien, agilen Methoden und einem hohen Automatisierungsgrad generieren wir gemeinsam effiziente und bedarfsgerechte BI-Lösungen. Unsere Kunden nutzen diese Informationen als optimale Basis für Unternehmensentscheidungen.\u003c/p\u003e\n\u003cp\u003eZum nächstmöglichen Zeitpunkt suchen wir am Standort Hannover/ Langenhagen einen\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eBI Cloud Solution Architect (m/w/d)\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eIhre Aufgaben\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDatengetriebene Cloud-Lösungen / Applikationen (z.B. mit Azure SQL DWH, Azure Synapse, Data-Factory, Data-Brixx, CosmosDb, Functions uvm.) konzipieren, entwickeln und warten\u003c/li\u003e\n\u003cli\u003eCloud-Architekturen (z. B. Lambda, Lakehouse) definieren, konzipieren und anwenden\u003c/li\u003e\n\u003cli\u003eEntwicklungsstandards sowie Templates (ARM, Terraform uvm.) definieren und anwenden\u003c/li\u003e\n\u003cli\u003eDatenbereitstellungsprozesse (ETL, ELT, Streaming) auf Basis unterschiedlicher Strukturierungsformen (z.B. relational, xml, json, parquet) entwickeln und pflegen\u003c/li\u003e\n\u003cli\u003eEntwicklung von Schnittstellen und APIs mit Python, Powershell, CLI uvm.\u003c/li\u003e\n\u003cli\u003eFachbereichsapplikationen konzipieren, entwickeln und warten\u003c/li\u003e\n\u003cli\u003eCloud-Dienste evaluieren, testen und auf die Zielarchitektur anpassen\u003c/li\u003e\n\u003cli\u003eDatenbankmodelle erstellen und implementieren\u003c/li\u003e\n\u003cli\u003eDatenquellen p3rofilen und hinsichtlich Datenqualität analysieren\u003c/li\u003e\n\u003cli\u003eSystementwicklung nach Cloud spezifischen DevOps-Konzepten\u003c/li\u003e\n\u003cli\u003eKonzeption und Entwicklungsergebnisse nach Konzernstandard (IT-PEP agil) dokumentieren\u003c/li\u003e\n\u003cli\u003eAufwands-, Kostenschätzungen und Angebotserstellung durchführen\u003c/li\u003e\n\u003cli\u003eTechnische Projektleitung in Cloudprojekten übernehmen\u003c/li\u003e\n\u003cli\u003eKonzepte zur Vereinigung klassischer BI-Vorhaben mit modernen Cloudarchitekturen konzipieren, definieren und anwenden\u003c/li\u003e\n\u003cli\u003eStammdatenmanagement konzipieren, auf- und ausbauen\u003c/li\u003e\n\u003cli\u003eWeiterenwicklung von agilen Softwareentwicklungsmethoden im Projektteam und für die Cloudplattform\u003c/li\u003e\n\u003cli\u003eBerichte und Präsentationen vorbereiten und eigenständig präsentieren\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eIhr Profil\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eStudium der Wirtschaftsinformatik mit Schwerpunkt BI, Analytics, Data Management, Cloud Computing oder vergleichbare Qualifikation (z.B. Fachinformatiker) mit Zusatzqualifikation\u003c/li\u003e\n\u003cli\u003eMehrjährige praktische Erfahrung in datengetriebenen Cloud-Projekten (Azure, Google uvm.)\u003c/li\u003e\n\u003cli\u003eSehr gute Kenntnisse in zukunftsfähigen Programmiersprachen (Python, Azure CLI, Powershell)\u003c/li\u003e\n\u003cli\u003eGute Kenntnisse in der Templatedefinition (IaC) in Cloudumgebungen (z.B. ARM, Terraform)\u003c/li\u003e\n\u003cli\u003eKenntnisse in der Erstellung, Rollout und Betrieb von Enterprise-Cloud-Architekturen\u003c/li\u003e\n\u003cli\u003eGrundkenntnisse in der Analyse und Visualisierung von Daten\u003c/li\u003e\n\u003cli\u003eGrundkenntnisse im Bereich Business-Intelligence (Datenbanken, Data Warehouse, OLAP)\u003c/li\u003e\n\u003cli\u003eAnalytische und konzeptionelle Fähigkeiten\u003c/li\u003e\n\u003cli\u003eZuverlässigkeit, Engagement\u003c/li\u003e\n\u003cli\u003eSystematische, strukturierte und selbstständige Arbeitsweise\u003c/li\u003e\n\u003cli\u003eSicher im Umgang mit komplexen Zusammenhängen\u003c/li\u003e\n\u003cli\u003eAnwenderorientiertes Denken\u003c/li\u003e\n\u003cli\u003eTeamorientierte Arbeitsweisen\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eDie Vergütung erfolgt je nach Qualifikation auf der Basis des jeweils gültigen Tarifvertrags der niedersächsischen Metallindustrie.\nWenn Sie eine neue Herausforderung reizt, freuen wir uns auf Ihre vollständige Online-Bewerbung.\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://camo.githubusercontent.com/b57cb1a82a1ab16bb563f0c7db77c53c6009cdf8/68747470733a2f2f742e676f686972696e672e636f6d2f682f66636436306566323865313464316439333537333463363662663533373264303437353664656564333932333665633439616261376639653337353331353732\"\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://t.gohiring.com/h/d93c9b4a8f6c53b8f987b5fe10da84b02756f814e618443411b4bcb2b4e9f578\"\u003eapplication form\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://web.archive.org/web/20210507025928/https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBajZpIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--0d504da786787a72abbdee32817c427c1744c417/Volkswagen%20Gebrauchtfahrzeughandels%20und%20Service%20GmbH.jpeg"},{"id":"480889d2-4ef2-43a8-9201-8d549ac49d3a","type":"Full Time","url":"https://web.archive.org/web/20210507025928/https://jobs.github.com/positions/480889d2-4ef2-43a8-9201-8d549ac49d3a","created_at":"Wed Apr 28 14:36:23 UTC 2021","company":"Channable","company_url":"https://web.archive.org/web/20210507025928/https://jobs.channable.com/","location":"Utrecht (The Netherlands)","title":"Python Software Engineer ","description":"\u003cp\u003e\u003cstrong\u003eWho are we?\u003c/strong\u003e\nWe are a young and fast-growing start-up from Utrecht focusing on the e-commerce and online marketing sectors. Channable was founded 7 years ago and developed into a company with an international team of over 150young professionals. While you can still benefit from the start-up vibe, working at Channable also means being part of a professional company with a highly skilled Development team.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWhat will your role be?\u003c/strong\u003e\nIn this position, you will be part of the product team, that works on our main web application. You will mainly be working on our Python3 backend, which powers our API and serves as the main entry point for our services. You will also be working on our API integrations, ads services, our export channels, new user-facing features, and our background jobs through which we process hundreds of millions of products per day. You will also be closely working together with our Infrastructure and DevOps teams, which are working on many other services that power Channable under the hood. Your tasks will include the following:\u003c/p\u003e\n\u003cp\u003eContributing to our Python components and support new API’s\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDesign, development, and testing of new product features\u003c/li\u003e\n\u003cli\u003eCollaborate with and review PRs of other team members\u003c/li\u003e\n\u003cli\u003eImprove the reliability and robustness of our application\u003c/li\u003e\n\u003cli\u003eWork on scalability and performance improvements\u003c/li\u003e\n\u003cli\u003eWork together with the sales and support teams on requirements and issues\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eThe following task is optional:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eCommunicating and collaborating with the Integrations department. The integrations department is the middleman between support and development. The communication aspect with Integrations is critical for issues and bug handling, as well as sometimes teaching and helping with problems they may not understand.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWe are using the following technologies and tools:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eLanguages: Python, SQL\u003c/li\u003e\n\u003cli\u003eLibraries: Flask, SQLAlchemy, Click, requests, async, logging\u003c/li\u003e\n\u003cli\u003eTools: Postgres, Redis, GCS, Alembic, mypy, pip, Sentry, Icepeak\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eIf you want to read more about our development adventures, check out our tech blog: \u003ca href=\"https://tech.channable.com/\"\u003ehttps://tech.channable.com/\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eYou can also take a look at some of our open-source work at \u003ca href=\"https://github.com/channable\"\u003ehttps://github.com/channable\u003c/a\u003e to get a feeling of how we work together and what our code looks like.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWho are we looking for?\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eAt least 2 years experience developing applications in Python\u003c/li\u003e\n\u003cli\u003eExperience with web APIs and related technologies is required\u003c/li\u003e\n\u003cli\u003eGood understanding of HTTP, TLS/SSL and TCP/IP\u003c/li\u003e\n\u003cli\u003eFamiliarity with SQL and relational databases, preferably Postgres\u003c/li\u003e\n\u003cli\u003eGood working knowledge of Linux, git and the command-line\u003c/li\u003e\n\u003cli\u003eCommitted to high engineering standards\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eAnd then there are some things that are ‘nice to have’:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExperience in tuning and scaling a big application\u003c/li\u003e\n\u003cli\u003eFamiliar with functional programming and its concepts\u003c/li\u003e\n\u003cli\u003eHaving worked with distributed systems before\u003c/li\u003e\n\u003cli\u003eDevOps mentality\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003ePractical requirements\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eEU citizenship or a work permit, preferably already living in The Netherlands\u003c/li\u003e\n\u003cli\u003eAvailable for at least 4 days a week, preferably full-time\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWhat do we offer?\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eChallenging full-time function with space for personal initiative\u003c/li\u003e\n\u003cli\u003eAn interesting job within a talented development team, with different levels of experience\u003c/li\u003e\n\u003cli\u003eCompetitive salary and company bonus\u003c/li\u003e\n\u003cli\u003eExcellent training and onboarding to get to know the tool, our processes, and your colleagues. After that, you’ll get the trust and responsibility to show what you got. Your buddy will support you throughout the whole onboarding.\u003c/li\u003e\n\u003cli\u003eCareer opportunities within Channable\u003c/li\u003e\n\u003cli\u003eWorking for a fast-growing company with a young and ambitious team\u003c/li\u003e\n\u003cli\u003eAwesome office in the city center of Utrecht and activities like hackathons and sports groups. We organize fun activities online because of the current situation.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWant to know how our Developers experience working at Channable? Read on!\u003c/p\u003e\n\u003cp\u003e\u003cem\u003e\"Everyone is allowed to grow at their own pace and in whatever aspects their interests lie. In my own case, after only half a year at Channable, I was given the opportunity to take ownership of a new project I showed interest in. As an employee, I feel cared for, and during these hard Corona times, knowing Channable has my back is very important for me.\"\u003c/em\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eMiquel, Python Software Engineer at Channable.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eDo you have any questions about this vacancy? Please contact Britt (\u003ca href=\"mailto:britt.bosma@channable.com\"\u003ebritt.bosma@channable.com\u003c/a\u003e). Are you interested? Please apply through our jobs page.\u003c/p\u003e\n\u003cp\u003eRemark: The recent developments of the COVID 19 virus have led to worldwide measures. Channable is prioritizing the safety of its employees, therefore all face-to-face meetings have to be postponed. Lucky for you, we are skilled with video calling! This means you can still apply for a job at Channable, and we can have interviews through Google Meet or Zoom.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eGo to our application form: \u003ca href=\"https://jobs.channable.com/o/python-software-engineer-2/c/new\"\u003ehttps://jobs.channable.com/o/python-software-engineer-2/c/new\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://web.archive.org/web/20210507025928/https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBakNpIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--a2d1177b058557e4eb3ca2f929311095161c8a73/Logo_channable.png"},{"id":"545f830a-cab2-4216-a7bf-a42d7a2f61a1","type":"Full Time","url":"https://web.archive.org/web/20210507025928/https://jobs.github.com/positions/545f830a-cab2-4216-a7bf-a42d7a2f61a1","created_at":"Wed Apr 28 13:40:51 UTC 2021","company":"University of Toronto","company_url":"https://web.archive.org/web/20210507025928/https://jobs.utoronto.ca/job/Python-Data-Portal-Developer/543721117/","location":"Toronto","title":"Python Data Portal Developer","description":"\u003cp\u003e\u003cstrong\u003eDate Posted:\u003c/strong\u003e 04/28/2021\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eReq ID:\u003c/strong\u003e 2324\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eFaculty/Division:\u003c/strong\u003e Temerty Faculty of Medicine\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eDepartment:\u003c/strong\u003e Department of Laboratory Medicine \u0026amp; Pathobiology\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eCampus:\u003c/strong\u003e St. George (Downtown Toronto)\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAbout us:\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eHome to over 40 departments and institutes, the University of Toronto's Faculty of Medicine lies at the heart of the Toronto Academic Health Science Network and is a global leader in ground-breaking research and education, spanning clinical medicine, basic science and the rehabilitation sciences sectors.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eYour opportunity:\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe Temerty Centre for AI Research and Education in Medicine (T-CAIREM) is an interdepartmental Centre, situated within the Department of Laboratory Medicine and Pathobiology (LMP), that serves as a focal point for collaboration between computer scientists, healthcare providers, trainees, medical basic science researchers and industry to advance health through machine learning. The mission of the Centre is to advance research, education, knowledge dissemination and digital infrastructure in the field of AI in medicine.\u003c/p\u003e\n\u003cp\u003eAs Python Data Portal Developer, you will support the development of adedicated data and compute environment in support of our Centre’s analytics activities. You will lead the development of a Django-based data sharing platform to support a world-class laboratory comprised of engineers, researchers, and clinicians working at the frontier of digital medicine. Relying on your deep and broad technical experience, you will ensure that our platform interfaces with cloud computing services, manage encryption keys to securely store data objects, and design data models for user contributions. Your proven record of working with big data and machine learning - from concept development to proof-of-concept to final implementation - will enable you to find a solution that balances user access to large scale data warehousing and analysis while retaining data privacy, security, and integrity of each member institution.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eYour responsibilities will include:\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eLeading and planning the development of the data sharing platform\nProgramming new and existing data systems, analyzing program scripts to extract \u0026amp; analyze data, and developing quality control procedures\nReconciling business requirements with information architecture needs for highly complex systems integrationx specifications\nAnalyzing, troubleshooting and testing highly complex systems\nAdvising on data structure designs\nDeveloping and implementing database testing plans, scenarios and environments\nWriting complex technical code\nCosting projects\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eEssential Qualifications:\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eBachelor's Degree in Computer Science, Engineering or acceptable combination of equivalent experience\nMinimum four years in programming and systems development and design, including requirements analysis, system modeling, and database diagramming\nDemonstrated experience designing and optimizing databases\nExperience developing data schemas and processing datasets using technical tools\nExperience developing and implementing database testing plans, scenarios and environments\nExperience determining logistical details required for database back-ups\nDemonstrated experience writing complex specifications based on system requirements\nExperience troubleshooting and resolving technical issues\nAdvanced proficiency with MS Office Suite\nStrong understanding and proficiency with Python/SQL\nProficiency using Amazon AWS and/or Google Cloud\nExcellent interpersonal and communication (verbal and written) skills\nMust have superior organizational and analytical/diagnostic skills\nMust be self-motivated, results oriented, a quick learner with a strong customer service focus and impeccable attention to detail\nWorks well under pressure in a fast paced environment, meets strict deadlines and has sound judgment\nWorks effectively both independently and as part of a team\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAssets (Nonessential):\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eFamiliarity with SPARQL and Elastic Search\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eTo be successful in this role you will be:\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eCommunicator\nDiligent\nInsightful\nProblem solver\nSelf-directed\nTeam player\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eThis is a 1-year term opportunity.\u003c/strong\u003e \u003cstrong\u003ePlease apply via\u003c/strong\u003e \u003ca href=\"https://jobs.utoronto.ca/job/Python-Data-Portal-Developer/543721117/\"\u003ehttps://jobs.utoronto.ca/job/Python-Data-Portal-Developer/543721117/\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eClosing Date:\u003c/strong\u003e 05/19/2021, 11:59PM EDT\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eEmployee Group:\u003c/strong\u003e USW\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAppointment Type:\u003c/strong\u003e Budget - Term\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eSchedule:\u003c/strong\u003e Full-Time\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003ePay Scale Group \u0026amp; Hiring Zone:\u003c/strong\u003e USW Pay Band 16 -- $88,643 with an annual step progression to a maximum of $113,359. Pay scale and job class assignment is subject to determination pursuant to the Job Evaluation/Pay Equity Maintenance Protocol.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eJob Category:\u003c/strong\u003e Information Technology (IT)\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eRecruiter:\u003c/strong\u003e Dinuka Perera\u003c/p\u003e\n","how_to_apply":"\u003cp\u003ePlease apply via: \u003ca href=\"https://jobs.utoronto.ca/job/Python-Data-Portal-Developer/543721117/\"\u003ehttps://jobs.utoronto.ca/job/Python-Data-Portal-Developer/543721117/\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://web.archive.org/web/20210507025928/https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaXlpIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--cdf7024a7594817d2c9ee511d29d5ff7d3ef5b16/university-of-toronto-vector-logo.png"},{"id":"94b288ab-8209-4b00-b8f4-09cf249d75be","type":"Full Time","url":"https://web.archive.org/web/20210507025928/https://jobs.github.com/positions/94b288ab-8209-4b00-b8f4-09cf249d75be","created_at":"Wed Apr 28 12:49:22 UTC 2021","company":"Yolawo","company_url":"https://web.archive.org/web/20210507025928/https://yolawo.de/","location":"Stuttgart","title":"Future Frontend Lead Developer","description":"\u003cp\u003e#remote\u003c/p\u003e\n\u003cp\u003eWir ermöglichen Vereinen eine begeisternd einfache Kommunikation und Organisation rund um ihr Vereinsleben. Unsere Buchungs- und Verwaltungslösung konnte in 2020 mehr als 1,5 Mio. Sportteilnahmen abwickeln und tausenden Ehrenamtlichen die Vereinsarbeit erleichtern. Um unser starkes Wachstum nachhaltig auszubauen, wollen wir unsere Entwicklungsgeschwindigkeit weiter steigern und dafür brauchen wir Unterstützung!\u003c/p\u003e\n\u003cp\u003eAufgaben\u003c/p\u003e\n\u003cp\u003eWir suchen unsere/n “Future Frontend Lead Developer”. Als solche/r bekommst du sukzessive die Verantwortung über die Entwicklung im Frontend und wächst dabei mit weiteren Einstellungen in deine zukünftige Lead-Rolle. Erfahrung mit der Entwicklung von Angular Applikationen ist deshalb eine wichtige Voraussetzung. Auch wenn Berufserfahrung von Vorteil ist, glauben wir auch an das Potential von jungen, motivierten Talenten. Wenn du Absolvent/in bist und bereits in größeren Projekten mit Angular gearbeitet hast, wollen wir dich ermutigen, dich trotzdem zu bewerben.\nQualifikation\u003c/p\u003e\n\u003cp\u003eWir möchten dir eine unbürokratische Bewerbung ermöglichen. Bewerbe dich also gerne formlos. In deiner Bewerbung sollte klar werden, warum wir ein erstes Gespräch mit dir führen sollen. Außerdem bitten wir dich eine kleine Code-Challenge für uns zu lösen. Mehr dazu findest du am Ende des Textes. Wenn du unser Interesse geweckt hast, klären wir in einem ersten kurzen Gespräch (ca. 15 min Telefonat oder Video-Call) die offenen Fragen und den weiteren Verlauf des Bewerbungsprozess.\u003c/p\u003e\n\u003cp\u003eGrundvoraussetzungen\u003c/p\u003e\n\u003cpre\u003e\u003ccode\u003eErfahrung mit Angular\nInteresse Softwarearchitektur\nInteresse Clean Code\nGute Kommunikation\nDeutsch in Sprache \u0026amp; Schrift\n\u003c/code\u003e\u003c/pre\u003e\n\u003cp\u003eEckdaten zur Stelle\u003c/p\u003e\n\u003cpre\u003e\u003ccode\u003e30 - 40 Wochenstunden\nArbeitsort flexibel, ca. 1-2 Treffen pro Monat in Stuttgart oder Tübingen\nKernarbeitszeit 10-14 Uhr\nAb 1. Juli (flexibel, deine Kündigungsfrist ist kein Problem)\n\u003c/code\u003e\u003c/pre\u003e\n\u003cp\u003eEckdaten zum Unternehmen\u003c/p\u003e\n\u003cpre\u003e\u003ccode\u003e6 Mitarbeiter\n\u0026gt; 300 Kunden\n\u0026gt; 1,5 Mio Kursbuchungen in 2020\nWachstum von 2019 auf 2020 \u0026gt; 800%\nSaaS, B2B\nAWS, Angular, Spring Boot\n\u003c/code\u003e\u003c/pre\u003e\n\u003cp\u003eUnser Prozess\u003c/p\u003e\n\u003cp\u003eDer Einstellungsprozess besteht aus drei Runden, in denen du mit unserem CTO und evtl. einem weiteren Frontend-Entwickler zusammenarbeitest. Der Probetag wird, wenn es Corona zulässt, vor Ort in Stuttgart oder Tübingen stattfinden und vergütet. Die zwei ersten Runden finden als Video-Call statt.\u003c/p\u003e\n\u003cpre\u003e\u003ccode\u003eBewerbungsphase\nRunde 1 (Pair Programming Bugfix: 30 Minuten)\nRunde 2 (Pair Programming Grüne Wiese: 90 Minuten)\nRunde 3 (Probetag)\nEntscheidung\n\u003c/code\u003e\u003c/pre\u003e\n\u003cp\u003eDie Code-Challenge\u003c/p\u003e\n\u003cp\u003eSchreibe eine sehr kleine Angular-App, die ein kleines Formular jeweils als “template-driven” und “reactive” implementiert. Bitte füge deine Lösung dann als herunterladbares ZIP-Archiv per URL in deine Bewerbung ein.\u003c/p\u003e\n\u003cp\u003eWenn du Interesse hast dein volles Potential in unser junges Unternehmen einzubringen und gemeinsam mit uns weiter zu wachsen, dann freuen wir uns auf deine Bewerbung!\u003c/p\u003e\n\u003cp\u003e--\u0026gt; Bewerbung: \u003ca href=\"https://yolawo.join.com/jobs/2151603-future-frontend-lead-developer-m-w-d\"\u003ehttps://yolawo.join.com/jobs/2151603-future-frontend-lead-developer-m-w-d\u003c/a\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eBewerbe dich jetzt unter:\n\u003ca href=\"https://yolawo.join.com/jobs/2151603-future-frontend-lead-developer-m-w-d\"\u003ehttps://yolawo.join.com/jobs/2151603-future-frontend-lead-developer-m-w-d\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://web.archive.org/web/20210507025928/https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaW1pIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--cc853c6abac6a29b8face8bd94af39b10514b89b/Yolawo%20Logo%201.png"},{"id":"281e41da-3703-49d5-9933-84d0258b6804","type":"Full Time","url":"https://web.archive.org/web/20210507025928/https://jobs.github.com/positions/281e41da-3703-49d5-9933-84d0258b6804","created_at":"Wed Apr 28 12:11:17 UTC 2021","company":"StreamUnlimited Engineering GmbH","company_url":"https://web.archive.org/web/20210507025928/https://www.streamunlimited.com","location":"Vienna, Wien","title":"Linux BSP Engineer (m/f/d)","description":"\u003cp\u003e\u003cstrong\u003eYouprobably have never heard of us – but we’re sure you’ve listened through us.\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eStreamUnlimited is a main player in the field of Chromecast built-in ™, Google Voice Assistant, Amazon Alexa, Apple AirPlay2 and top-notch audio technology. We are building the technology behind the worlds most renowned brands in smart speakers, hi-fi music equipment and\nmusic streaming apps.\u003c/p\u003e\n\u003cp\u003eIt’s very likely that you have a product at home driven by software developed by us.\u003c/p\u003e\n\u003cp\u003eSo, since you’re already familiar with us – maybe you’d like to pay us a visit too. And even stay. Because you might find our company a great place to work.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eTasks\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eYou contribute to our BSP development for both internal and customer projects as embedded Linux software developer.\u003c/li\u003e\n\u003cli\u003eYour work involves tailoring the Linux Kernel for our target platforms (NXP, AMLogic, Qualcomm,...) by supporting Yocto layers.\u003c/li\u003e\n\u003cli\u003eYou share your knowledge with colleagues and gain yours by actively colaborating beyond projects and work packages.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eRequirements\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eYou are proficient in Linux Kernel development, ideally kernel drivers, device trees, and also the U-Boot bootloader.\u003c/li\u003e\n\u003cli\u003eYou have sophisticated C language skills, C++ is of advantage, too.\u003c/li\u003e\n\u003cli\u003eYou are well familiar with the Yocto or OpenEmbedded projects, or similar tools to create individual Linux distributions.\u003c/li\u003e\n\u003cli\u003eWorking with embedded systems is your passion, you are not afraid of oscilloscopes and soldering irons.\u003c/li\u003e\n\u003cli\u003eYou are able to read schematics and understand commonly used electrical interface busses (I2C, SPI, I2S for audio) in hardware and software.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eBenefits\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eA team oriented, informal and international work environment.\u003c/li\u003e\n\u003cli\u003eA growing company with development perspectives.\u003c/li\u003e\n\u003cli\u003eGood accessibility (underground station nearby), free parking.\u003c/li\u003e\n\u003cli\u003eSeveral benefits: free gym, subsidized\ncanteen, regular company gatherings, flexible working hours\u003c/li\u003e\n\u003cli\u003ePart of your work visible on company github \u003ca href=\"https://github.com/streamunlimited\"\u003ehttps://github.com/streamunlimited\u003c/a\u003e and sometime also upstream.\u003c/li\u003e\n\u003cli\u003eSkilled HW department in Vienna which can even do BGA reworks.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eSounds great? Then please send us your application!\u003c/strong\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://streamunlimited.join.com/jobs/2191841-linux-bsp-engineer-m-f-d?pid=5a16622fa4fcdea717f2\u0026amp;oid=ac69cc4f-ce4f-414e-81b2-a808014ae436\u0026amp;utm_source=github_jobs\u0026amp;utm_medium=paid\u0026amp;utm_campaign=single%2Bposting\u0026amp;utm_content=linux%2Bbsp%2Bengineer%2Bm%2Bf%2Bd\"\u003ehttps://streamunlimited.join.com/jobs/2191841-linux-bsp-engineer-m-f-d?pid=5a16622fa4fcdea717f2\u0026amp;oid=ac69cc4f-ce4f-414e-81b2-a808014ae436\u0026amp;utm_source=github_jobs\u0026amp;utm_medium=paid\u0026amp;utm_campaign=single%2Bposting\u0026amp;utm_content=linux%2Bbsp%2Bengineer%2Bm%2Bf%2Bd\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://web.archive.org/web/20210507025928/https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaVdpIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--4bbc0f099081b86d1ed3b66059b4f86cd7d77d76/stream-unlimited-engineering-gmb-h-logo-xl.png"},{"id":"8c35f2eb-7f9b-4c3d-8b9b-afbd3bb73fd4","type":"Full Time","url":"https://web.archive.org/web/20210507025928/https://jobs.github.com/positions/8c35f2eb-7f9b-4c3d-8b9b-afbd3bb73fd4","created_at":"Tue Apr 27 21:48:01 UTC 2021","company":"Vista Higher Learning","company_url":null,"location":"Boston, MA, USA","title":"Senior Software Engineer","description":"\u003cp\u003eWe’re life-long learners, creative thinkers, technology enthusiasts and innovators redefining the way world languages are learned and taught in interactive and intuitive environments. We love what we do and we’re proud of the customer-facing products we create! Our industry leading platform and millions of users are a testament to the passion and commitment we bring to developing the best online learning experience for language education!  If you share that passion for being the best, we want to talk! Our ideal candidate looks for creative solutions, is continually learning, and loves to develop best-in-class solutions to complex technical challenges.\u003c/p\u003e\n\u003cp\u003eWe’re looking for an experienced Senior Software Engineer with strong Ruby on Rails knowledge and experience in AWS or other cloud-based deployments.  You will participate in all aspects of the development lifecycle – from project planning \u0026amp; design, to implementation and release.  We are a highly collaborative team that prizes those looking not just to deliver projects, but do so with fun and in continually better ways.\u003c/p\u003e\n\u003cp\u003eOur technology stack:\u003c/p\u003e\n\u003cp\u003eLanguages/Frameworks: Ruby/Rails, JS, Vue\nPersistence: MySQL, Postgres, Redis, ElasticSearch\nAutomation: Chef, Cloudformation\nHosting: AWS\u003c/p\u003e\n\u003cp\u003eWhat you bring to the party:\u003c/p\u003e\n\u003cp\u003eBA/ BS in computer science or other related field or equivalent experience\n7+ years engineering experience developing large-scale systems\nExperience in ed-tech or education fields, a strong plus\nExperience building and deploying high-capacity applications in cloud environments (AWS or GCP)\nStrong command of Ruby on Rails, Java, or Python\nExperience with SQL, Postgres, Redis, Elasticsearch, CodeBuild \u0026amp; CodeDeploy, Git / Github\nExperience with Linux (especially Ubuntu/ Debian)\nAbility to work well with geographically distributed teams as well as highly collaborative environments\nAbility to execute on projects with fast deadlines.  Comfortable with ambiguity, and flexible in pitching in.\nExcellent communication and interpersonal skills\nSome proficiency in Spanish is a strong plus\u003c/p\u003e\n\u003cp\u003eWhy join us?  We at Vista Higher Learning are proud to say that we’re not just another publisher. We’re the leading specialized language publisher for U.S. and Canadian higher education and secondary school markets whose first-hand knowledge of languages and diverse cultures sets us apart from other publishers.  We’re passionate about developing educational materials that incorporate authenticity and culture. We bring a fresh new approach to teaching languages by integrating technology, design, content, and pedagogy to make learning easier, more practical, and more rewarding. With current programs in Spanish, French, Italian and German Vista Higher Learning is committed to helping people communicate across languages and cultures.\u003c/p\u003e\n\u003cp\u003eVista Higher Learning is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, age, color, religion, sexual orientation, gender identity, national origin, physical or mental disability, and/or protected veteran status or other characteristics protected by applicable law.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://vistahigherlearning.applytojob.com/apply/Tj8yvvUj6H/Senior-Software-Engineer?source=GitHub\"\u003ehttps://vistahigherlearning.applytojob.com/apply/Tj8yvvUj6H/Senior-Software-Engineer?source=GitHub\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://web.archive.org/web/20210507025928/https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaDZpIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--fe7f469e66f2c1e1811cbf7ab809c29c18998d89/Corporate%20Logo.png"},{"id":"7cffee69-4d5e-4945-aee6-5523d0cd5f42","type":"Full Time","url":"https://web.archive.org/web/20210507025928/https://jobs.github.com/positions/7cffee69-4d5e-4945-aee6-5523d0cd5f42","created_at":"Tue Apr 27 18:30:15 UTC 2021","company":"Remote","company_url":"https://web.archive.org/web/20210507025928/http://www.remote.com","location":"Anywhere","title":"Engineering Manager","description":"\u003cp\u003eRemote is THE global platform that enables companies to employ people anywhere in the world, taking away all legal and compliance complexities. Remote handles global payroll, benefits, taxes, and compliance for businesses big and small. (read more about \u003ca href=\"https://remote.com/how-it-works\"\u003ehow it works\u003c/a\u003e).\u003c/p\u003e\n\u003cp\u003eWe encourage folks from all ethnic groups, genders, sexuality, age and abilities to apply. We value kindness, ownership and team collaboration. You can check out our \u003ca href=\"https://remote.com/handbook\"\u003epublic handbook\u003c/a\u003e. to learn more about our culture. If this job description resonates with you, we want to hear from you!\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eHow we work\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eRemote is fully remote (ah!) and we love \u003ca href=\"https://www.notion.so/Working-Async-80c01cd443ad4c77a8ceaef7c5fba5d0\"\u003eWorking Async\u003c/a\u003e. This means you get to do your own schedule no matter the timezone. The Remote Engineering team uses a simple approach to productivity and task management and you can read more about it in \u003ca href=\"https://www.notion.so/remotecom/The-Remote-Flow-4ccc721f6dde40e4b5c91dd8e47e77c7\"\u003eThe Remote Flow\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003eThe team you'll be joining: 33 engineers, spanning across Frontend, Backend, SRE and QA. We're organised into product teams composed with engineers, designers, product managers, operations and finance, each dedicated to achieving the same goals in a specific domain.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eRequirements\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eMore information about this role in Remote's engineering career path on our public Handbook \u003ca href=\"https://www.notion.so/remotecom/2e1fa1f2ca974704a0243c72b0b19622?v=fe0500a11105496d92c476b6e07f6964\"\u003ehere\u003c/a\u003e.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMust have (professional experience):\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003ePreviously managed more than 2 teams at the same time\u003c/li\u003e\n\u003cli\u003eHaving been an engineering manager for at least 2 years\u003c/li\u003e\n\u003cli\u003ePrevious experience as engineering team leader\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eResponsibilities\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eManage multiple engineering teams within a well defined scope of our product\u003c/li\u003e\n\u003cli\u003eContribute to push forward the path to equality of opportunities, diversity and inclusivity to everyone in the world \u003c/li\u003e\n\u003cli\u003eImplement and uphold development principles and best practices\n-Communicate proactively and extensively about team progress\u003c/li\u003e\n\u003cli\u003ePrioritise and optimise current processes\u003c/li\u003e\n\u003cli\u003eContinuously work with other areas of the business and identify improvement points\u003c/li\u003e\n\u003cli\u003eUnderstand and communicate team capacity and hiring requirements\u003c/li\u003e\n\u003cli\u003eWork with the people that report to you on their career path and set up everyone for success\u003c/li\u003e\n\u003cli\u003eSpend 75% of time managing teams and projects and 25% on technical tasks (MR, technical improvements, etc.)\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eBenefits\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eUnlimited personal time off - Read our \u003ca href=\"https://www.notion.so/Time-off-e2e71e5dcdef43ff82515d7c711ed4af\"\u003etime off\u003c/a\u003e policy\u003c/li\u003e\n\u003cli\u003eThe equipment/tools you need to do your job well and comfortable\u003c/li\u003e\n\u003cli\u003eTraining budget\u003c/li\u003e\n\u003cli\u003eGood salary and company options\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eApplication process\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e(async) Application is reviewed\u003c/li\u003e\n\u003cli\u003eInterview with our recruiter\u003c/li\u003e\n\u003cli\u003eInterview with your future manager (CTO)\u003c/li\u003e\n\u003cli\u003e(async) Take home assignment \u003c/li\u003e\n\u003cli\u003eInterview with the team (without any manager in the call so you can really get to know the people and ask all you want to ask)\u003c/li\u003e\n\u003cli\u003eInterview with CEO\u003c/li\u003e\n\u003cli\u003e(async) Offer\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://grnh.se/7c740b2a3us\"\u003ehttps://grnh.se/7c740b2a3us\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://web.archive.org/web/20210507025928/https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaHVpIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--edebde0f24a5d2cc553a232a34e440e1341f70a9/pJ-7_0_R_400x400.png"},{"id":"fbc1686d-457f-4fe0-b7bf-78d03a981afa","type":"Full Time","url":"https://web.archive.org/web/20210507025928/https://jobs.github.com/positions/fbc1686d-457f-4fe0-b7bf-78d03a981afa","created_at":"Tue Apr 27 09:11:36 UTC 2021","company":"ergovia GmbH","company_url":"https://web.archive.org/web/20210507025928/https://ergovia.de/","location":"Kiel, Germany","title":"Frontend Developer / Webentwickler (m/w/d)","description":"\u003cp\u003eWir suchen dich!\u003c/p\u003e\n\u003cp\u003eDie ergovia GmbH ist ein dynamisches Unternehmen, das seit 17 Jahren die Bildungsqualität in Deutschland verbessert. Als Ansprechpartner für Bildungsfragen entwickeln wir mit unserem fachlichen Hintergrund Service und Software für die berufliche Bildung und Schulen.\nDich treibt der Ehrgeiz an, unsere ergonomische Software, die individuelle Bildung dokumentierbar macht, weiterzuentwickeln, zu optimieren und an den Kunden zu bringen? Du bist ein echter Teamplayer und möchtest dein Know-how, deine Kreativität und deine Stärken mit einbringen?\u003c/p\u003e\n\u003cp\u003eDann suchen wir dich zum nächstmöglichen Zeitpunkt als neues Teammitglied in Vollzeit als\u003c/p\u003e\n\u003cp\u003eFrontend Developer / Webentwickler (m/w/d)\u003c/p\u003e\n\u003cp\u003efür unseren Firmensitz in der schönen Landeshauptstadt Kiel.\u003c/p\u003e\n\u003cp\u003eDeine Aufgaben:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eTechnische Umsetzung von Anforderungen aus dem Produktmanagement\u003c/li\u003e\n\u003cli\u003eUnterstützung bei der Planung und Einschätzung von neuen Entwicklungsvorhaben\u003c/li\u003e\n\u003cli\u003eUnterstützung des Kundensupports bei der Identifikation und Lösung von Bugs\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eDas bringst du mit:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDu weißt wie StackOverflow funktioniert\u003c/li\u003e\n\u003cli\u003eDu hast Erfahrungen mit HTML/CSS/JavaScript\u003c/li\u003e\n\u003cli\u003eDu kannst Unit-Tests verfassen, idealerweise mit Jest\u003c/li\u003e\n\u003cli\u003eCode-Qualität liegt dir am Herzen\u003c/li\u003e\n\u003cli\u003eVersionsverwaltung (z.B. mit Git) ist für dich kein Fremdwort\u003c/li\u003e\n\u003cli\u003eDu bist engagiert, hilfsbereit und hast Lust, immer wieder Neues dazuzulernen\u003c/li\u003e\n\u003cli\u003eUni- und FH-Absolventen mit ersten Erfahrungen sind ebenso herzlich Willkommen, wie Personen, die eine abgeschlossene Berufsausbildung (z. B. Fachinformatiker Anwendungsentwicklung o.ä.) mitbringen\u003c/li\u003e\n\u003cli\u003eDu hast sehr gute Deutschkenntnisse (min. Sprachniveau B2)\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eDas bieten wir dir:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eEin durch und durch agiles Unternehmen, in dem Ziele und Meilensteine organisiert werden\u003c/li\u003e\n\u003cli\u003eFlexible Arbeitszeiten\u003c/li\u003e\n\u003cli\u003eDie Möglichkeit, im Home Office zu arbeiten\u003c/li\u003e\n\u003cli\u003eKostenlose Heißgetränke und Obstkörbe\u003c/li\u003e\n\u003cli\u003eEinen mobilen Arbeitsplatz mit Laptop\u003c/li\u003e\n\u003cli\u003eFreie Parkplätze und gute Bus- und Bahnanbindung\u003c/li\u003e\n\u003cli\u003eBetriebliche Altersvorsorge\u003c/li\u003e\n\u003cli\u003eCoachingangebote (Online-Kurse, Konferenzbesuche und individuelle Trainings)\u003c/li\u003e\n\u003cli\u003eFachlicher Austausch in einem breit aufgestellten Unternehmensverbund\u003c/li\u003e\n\u003cli\u003eEin Arbeitsumfeld, in dem du dich stetig fachlich sowie persönlich weiterentwickeln und dich selbst entfalten kannst\u003c/li\u003e\n\u003cli\u003eEin interdisziplinäres Team mit netten Kollegen/innen, in dem du deine Stärken mit einbringen kannst\u003c/li\u003e\n\u003cli\u003eHunde sind bei uns erlaubt\u003c/li\u003e\n\u003cli\u003eMitarbeiterevents, Teamtage und Teambuildingaktivitäten\u003c/li\u003e\n\u003cli\u003eSchau einfach bei uns rein und lerne uns kennen:\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eDu hast Interesse?\u003c/p\u003e\n\u003cp\u003eDann sollten wir uns bald kennenlernen! Wir freuen uns auf deine vollständigen Bewerbungsunterlagen mit Anschreiben und inklusive der Angabe deines frühestmöglichen Eintrittstermins und deiner Gehaltsvorstellung. Bewirb dich hier online oder per E-Mail an \u003ca href=\"mailto:ergovia@hr-partner.com\"\u003eergovia@hr-partner.com\u003c/a\u003e. Für weitere Informationen stehen wir dir selbstverständlich auch gern telefonisch zur Verfügung.\u003c/p\u003e\n\u003cp\u003eAufgrund der aktuellen Lage werden Vorstellungsgespräche via Videokonferenz durchgeführt.\u003c/p\u003e\n\u003cp\u003eDas Bewerbungshandling wird von der Personalberatung FEL GmbH unter der Marke HR-Partner durchgeführt. Hinweise zum Datenschutz unter \u003ca href=\"https://hr-partner.com/datenschutz\"\u003ehttps://hr-partner.com/datenschutz\u003c/a\u003e.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eBewerbung per Online-Formular unter:\n\u003ca href=\"https://hrp.hr4you.org/job/view/2117/\"\u003ehttps://hrp.hr4you.org/job/view/2117/\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eBewerbung per E-Mail an:\n\u003ca href=\"mailto:ergovia@hr-partner.com\"\u003eergovia@hr-partner.com\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eAnsprechpartner:\nMatthis Buschtöns\nLeiter IT\nSuchskrug 10\n24107 Kiel\nTel. 0431 6477550\u003c/p\u003e\n","company_logo":"https://web.archive.org/web/20210507025928/https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaG1pIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--99b7f633bd21e6fc2832f5d823d9236758572dcf/logo.png"},{"id":"e2d89383-d183-4efb-a900-79a49ec4957a","type":"Full Time","url":"https://web.archive.org/web/20210507025928/https://jobs.github.com/positions/e2d89383-d183-4efb-a900-79a49ec4957a","created_at":"Tue Apr 27 04:28:04 UTC 2021","company":"  EngagedMD - a healthtech company","company_url":null,"location":"Remote","title":"Senior Backend Developer (Node.JS)","description":"\u003ch3\u003eFor fastest response, apply on our site:\u003c/h3\u003e\n\u003cp\u003e\u003ca href=\"https://engaged-md.com/careers/#openings\"\u003ehttps://engaged-md.com/careers/#openings\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eRole:\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWe’re looking for an experienced backend developer capable of contributing to the backend build of our next generation microservice-based platform.\u003c/strong\u003e You’ll be responsible for architecting back-end cloud infrastructure, our applications middleware layer, including our internal front-end-to-backend API management, backend data stores, as well as integrations with our healthcare partner applications. You’ll have a direct impact on the direction and culture of an early stage start-up working to modernize healthcare. You’ll begin by working remotely but will have the opportunity to be based in our Washington, DC office once COVID-related conditions permit.\nNote: EngagedMD is able to sponsor current H1B visa holders for this position.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eDuties and Responsibilities\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBuild New Microservices: Build backend microservices supporting multiple business functions and heavy daily usage.\u003c/li\u003e\n\u003cli\u003eDevelop New Features - use Node.JS to deliver back-end features on our new application, including custom plugins to our CMS (strapi) and background processing workers.\u003c/li\u003e\n\u003cli\u003eOwnership of our application’s API middleware, including new feature development, infrastructure optimization, and the ongoing management of existing API’s.\u003c/li\u003e\n\u003cli\u003eIntegrate with new partner applications - Lead the technical implementation of new API integrations with various software companies across the healthcare industry.\u003c/li\u003e\n\u003cli\u003eCollaboration - You will work with a team of developers, project manager, and product managers. You’ll contribute to all aspects of software delivery including scoping, scripting, testing, scaling, security, deployment, and monitoring.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eIdeal Qualifications\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e5+ years of software development experience\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExperience with backend languages including Node.JS,  and preferred experience with JavaScript,  Java, Bash, Shell, and/or Python\u003c/li\u003e\n\u003cli\u003eExperience with API frameworks (REST, GraphQL, Serverless)\u003c/li\u003e\n\u003cli\u003eExperience with Amazon Web Services (API Gateway, Lambda, SQS and S3)\u003c/li\u003e\n\u003cli\u003eDatabase experience with PostgreSQL, MySQL including schema and query optimization\u003c/li\u003e\n\u003cli\u003eExperience creating scalable cloud-based web applications (Caching, Queues, Notifications)\u003c/li\u003e\n\u003cli\u003eExperience using modern build and deployment tools such as Jenkins, Docker, etc.\u003c/li\u003e\n\u003cli\u003eComfort with code repository management (GitHub, BitBucket)\u003c/li\u003e\n\u003cli\u003eFamiliarity with microservice system architecture.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eAbout our Company - EngagedMD\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eEngagedMD is a fast-growing B2B software company that has developed the leading patient journey management solution for the fast-growing fertility sector. Nearly half of fertility patients in the US use our eLearn and eSign tools and also have increasing international presence. Clinics use our software to reduce repetitive, manual tasks and streamline the patient journey, which helps them increase capacity and growth while improving the patient experience and reducing doctor and staff burnout. We are known for having a collaborative, friendly, high energy and fast-moving culture and a focused, start-up atmosphere.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eFor fastest response, apply on our site:\n\u003ca href=\"https://engaged-md.com/careers/#openings\"\u003ehttps://engaged-md.com/careers/#openings\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://web.archive.org/web/20210507025928/https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaGFpIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--d47d51b7a25aedf4ae15250198279794a7e84db4/Screen%20Shot%202021-04-27%20at%2012.26.30%20AM.png"},{"id":"10a3bd7a-f93a-4d20-94b0-d65c6fcaecd4","type":"Full Time","url":"https://web.archive.org/web/20210507025928/https://jobs.github.com/positions/10a3bd7a-f93a-4d20-94b0-d65c6fcaecd4","created_at":"Mon Apr 26 16:44:07 UTC 2021","company":"SuprNation Ltd","company_url":"https://web.archive.org/web/20210507025928/https://www.suprnation.com","location":"Remote","title":"Senior Backend Developer","description":"\u003cp\u003eSuprNation is looking for a backend developer to join our development team at our Malta office. The ideal candidate should have the following qualities:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eIs able to work autonomously – Freedom with Responsibility is the mantra at the SuprNation office!\u003c/li\u003e\n\u003cli\u003eIs passionate about coding and loves to learn and share new concepts and techniques.\u003c/li\u003e\n\u003cli\u003eCan work in a flat organisation where ideas (rather than people) ‘win’ at the end of the day.\u003c/li\u003e\n\u003cli\u003eCan write functional code and understands the benefits of immutability. A sea of immutability with islands of mutability. Odersky! rings a bell? Great!\u003c/li\u003e\n\u003cli\u003eGets excited upon hearing about Event Sourcing, Microservices, CQRS and Actors! If you know who - Eric Evans and Carl Hewitt are you will feel right at home!\u003c/li\u003e\n\u003cli\u003eIs not fixated with a particular language/technology but rather with the underlying concepts and ideas.\u003c/li\u003e\n\u003cli\u003eIs eager to collaborate with other crazy smart people to create an amazing casino product.\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003eEmail your resume at \u003ca href=\"mailto:mark@suprnation.com\"\u003emark@suprnation.com\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://web.archive.org/web/20210507025928/https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaFNpIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--9361a2de34573cd800bdad0e96188952bdfa094c/250558695426_b1e9850bc60befc8c138_132.png"},{"id":"98b06bf7-df44-4c18-937f-bbb68116398b","type":"Full Time","url":"https://web.archive.org/web/20210507025928/https://jobs.github.com/positions/98b06bf7-df44-4c18-937f-bbb68116398b","created_at":"Mon Apr 26 16:03:55 UTC 2021","company":"lawpilots GmbH","company_url":"https://web.archive.org/web/20210507025928/https://www.lawpilots.com/de-de/","location":"Berlin","title":"Software Developer (Backend / Infrastructure) (m/w/d)","description":"\u003cp\u003e\u003cstrong\u003eIntro\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eJoin us in Berlin\u003c/p\u003e\n\u003cp\u003eAt lawpilots, we create digital learning that people love. E-learning is one of the growth markets of the future - even more so during the current crisis.\u003c/p\u003e\n\u003cp\u003eWe are looking for a developer to help us improve our current e-learning solution, build new features, increase the user experience and maintain high standards in terms of our technical setup. We are looking to improve our CI/CD pipeline, improve observability and monitoring and continuously strive to automate what is reasonable to be automated. We work and make decisions together and address mistakes as a chance to learn and improve.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eYour mission\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eHelp maintain and extend our current learning platform\u003c/li\u003e\n\u003cli\u003eParticipate in the design, development and maintenance of new systems and components\u003c/li\u003e\n\u003cli\u003eAutomate our internal and public-facing infrastructure\u003c/li\u003e\n\u003cli\u003eDocument our system landscape, including decision documents and overview diagrams\u003c/li\u003e\n\u003cli\u003eImplement reliable logging and monitoring solutions\u003c/li\u003e\n\u003cli\u003eEnsure security and data compliance throughout our services\u003c/li\u003e\n\u003cli\u003eHelp customers, both prospective and current, to make the best use of our platform by contributing to the user experience\u003c/li\u003e\n\u003cli\u003eWork with our customer success and sales teams to help them onboard and support  customers\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eYour profile\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBachelor’s Degree in Computer Science, Software Engineering, Computer Engineering or demonstrable similar experience\u003c/li\u003e\n\u003cli\u003eStrong English language skills, written as well as oral\u003c/li\u003e\n\u003cli\u003e2+ years of working experience as a service reliability engineer, platform engineer, backend engineer, or similar\u003c/li\u003e\n\u003cli\u003eVery good understanding of Linux server administration, networking, distributed systems, security best practices\u003c/li\u003e\n\u003cli\u003eExperience with log and metric collection\u003c/li\u003e\n\u003cli\u003eExperience with automation (Infrastructure as Code, Configuration Management)\u003c/li\u003e\n\u003cli\u003eExperience with networking, distributed systems and cloud technology\u003c/li\u003e\n\u003cli\u003eExperience or willingness to learn how to design, develop, test and maintain web applications and associated services (for instance with Python, Go or Ruby)\u003c/li\u003e\n\u003cli\u003eAbility to work independently, as well as an effective part of the team\u003c/li\u003e\n\u003cli\u003eAny lack of experience in the above can be compensated by a great attitude towards continuous learning and self-improvement\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWhy us?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWhy us?\nWe take care of our employees and provide you with:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eFlexible working hours with the option to work partially remote (fully remote during the pandemic)\u003c/li\u003e\n\u003cli\u003eModern computer and huge 4k screens\u003c/li\u003e\n\u003cli\u003eA diverse and international environment\u003c/li\u003e\n\u003cli\u003eA modern workplace close to the Berlin central station\u003c/li\u003e\n\u003cli\u003eSpecial employee offers for sports clubs, gadgets, fashion, ....\u003c/li\u003e\n\u003cli\u003eAnd a lot of fun :)\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eOur interview process\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eFirst video call: 1 hour with our IT Team Lead and one backend developer\u003c/li\u003e\n\u003cli\u003eA home assignment which can be done within 1 hour\u003c/li\u003e\n\u003cli\u003eA follow-up video call with a chance to discuss your approach and to meet more of the team\u003c/li\u003e\n\u003cli\u003eA video call with our COO\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWe are looking forward to seeing you!\u003c/p\u003e\n\u003cp\u003e\u003cimg src=\"https://camo.githubusercontent.com/8a7877a43fa91801f1ccdcd63e790769117b8afd/68747470733a2f2f742e676f686972696e672e636f6d2f682f31666161363462633661326430373462313733633630306430313731643762313435343832363632363963663537616537346131376463646130306536323761\"\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://t.gohiring.com/h/7f427001480f1cae28d00b35f2e9bd0924e559b9879c933610c9a4cd3ebdb650\"\u003eapplication form\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://web.archive.org/web/20210507025928/https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaEdpIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--7c379bf64f1fce3dcdbe3bfc67c21a521ab048b7/lawpilots%20GmbH.png"},{"id":"d0afa0c1-2ff5-4bb4-acc6-911eb06a2013","type":"Contract","url":"https://web.archive.org/web/20210507025928/https://jobs.github.com/positions/d0afa0c1-2ff5-4bb4-acc6-911eb06a2013","created_at":"Mon Apr 26 15:33:08 UTC 2021","company":"Fullstack","company_url":"http:","location":"Anywhere","title":"React Native Engineer","description":"\u003cp\u003e\u003cstrong\u003eReact Native Mobile Engineer\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eFullstack is looking for a motivated full-stack mobile engineer who will help develop and contribute to world class applications and products. You will have the opportunity to work on all aspects of our mobile application stack, from mobile app development in react native to backend api development in Ruby on Rails.  You will be joining a close knit group of very talented designers, engineers, and product managers that have a great time building software that makes a difference.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003ePrimary Responsibilities\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDrive development of our mobile applications, from architecture, to coding, to release.\u003c/li\u003e\n\u003cli\u003eTake ownership in developing and improving all aspects of our stack (development, testing, CI, automation, and architecture)\u003c/li\u003e\n\u003cli\u003eRelease to both iOS and Android (Apple App Store, Google Play Store)\u003c/li\u003e\n\u003cli\u003eAssist in development and maintenance of web-based backend API services\u003c/li\u003e\n\u003cli\u003eDesigning and engineering features that deliver value to the people who use them.\u003c/li\u003e\n\u003cli\u003eCollaborating closely with the entire team (designers, product managers, etc.)\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eAbout FullStack\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eOur mission is to make our clients incredibly successful by developing and improving ideas into highly functional and usable web applications. Our team has become renowned in our ability to bring creativity, expertise, and sound development practices to notable and ambitious startups. Our development work focuses on architecting and building new applications as well as scaling existing apps for our clients as they grow.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eLet’s Have A Chat If You…\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eHave developed React Native apps that communicate with Restful APIs, network data synchronization, and user authentication.\u003c/li\u003e\n\u003cli\u003eHave a working knowledge of the Expo platform for React Native.\u003c/li\u003e\n\u003cli\u003eUnderstand and have experience making decisions about mobile application architecture, including data modeling, networking and data synchronization, and concurrency.\u003c/li\u003e\n\u003cli\u003eAre self-directed and able to manage your time effectively\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eBonus points for…\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBeing experienced working in Ruby, and knowing your way around the Rails framework.\u003c/li\u003e\n\u003cli\u003eiOS or Android development experience using Objective-C, Swift, or Android\u003c/li\u003e\n\u003cli\u003eExperience working with high availability server architectures in AWS.\u003c/li\u003e\n\u003cli\u003eKnowing your way around XCode or Android Studio\u003c/li\u003e\n\u003cli\u003ePrevious history of working with a remote, distributed team\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eOther information about this position\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWorking remotely is how we operate\u003c/li\u003e\n\u003cli\u003eThis is a per-project, contract position, with up to 40 hours per week\u003c/li\u003e\n\u003cli\u003eWe are looking for people located within the 4 US time zones.\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003eComplete the online application at \u003ca href=\"https://gofullstack.com/job-application/\"\u003ehttps://gofullstack.com/job-application/\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://web.archive.org/web/20210507025928/https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBZytpIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--b2e8d8a94d87e84139c2b8ba7cbc54469019ee29/fullstack-logo-mark.png"},{"id":"19917880-abc4-4f57-a9e3-27280d430fcc","type":"Full Time","url":"https://web.archive.org/web/20210507025928/https://jobs.github.com/positions/19917880-abc4-4f57-a9e3-27280d430fcc","created_at":"Mon Apr 26 14:06:23 UTC 2021","company":"smartmicro","company_url":"https://web.archive.org/web/20210507025928/https://www.smartmicro.com","location":"Brunswick, Braunschweig, Germany","title":"C++ Developer (m/w/d)","description":"\u003cp\u003esmartmicro entwickelt Radarsensoren für automobile Fahrerassistenzsysteme, die das Autofahren sicherer und bequemer machen, vor allem für das automatische Fahren. smartmicro produziert außerdem Radarsysteme für die Infrastruktur von Smart Cities: zur Verkehrserfassung und -steuerung; für intelligente Kreuzungen und Straßen: Radarsensoren, die jeden Verkehrsteilnehmer, vom Fußgänger bis zum LKW, erfassen und den Verkehr optimal steuern können. In den Connected Vehicles der Zukunft treffen beide smartmicro Technologien zusammen: smarte Infrastruktur sendet per Car-2-X Kommunikation Informationen oder Warnungen an die Fahrzeuge. Autos mit smartmicro Sensorik können die Umgebung 360 Grad rings um ein Fahrzeug erkennen, mit Car-2-X Daten kombinieren und in Gefahrsituationen Unfälle vermeiden. smartmicro ist Innovation. Wir sind mit den modernsten Messverfahren, mit intelligenter Embedded Signalverarbeitungssoftware, führender Antennen- und Hochfrequenztechnologie stark aufgestellt. Wir bieten Produkte mit international führender, patentierter Technologie an.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eAufgaben\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003ePlattformentwicklung für die nächste Generation Radar Sensoren\u003c/li\u003e\n\u003cli\u003eEntwicklung und Integration von Middlewarekomponenten und Kommunikationsstacks\u003c/li\u003e\n\u003cli\u003eVerifikation im Rahmen von Reviews und Anwenden von\u003c/li\u003e\n\u003cli\u003eTestverfahren (Modultests, HIL/SIL-Tests)\u003c/li\u003e\n\u003cli\u003eErstellung von technischen Konzepten und Spezifikationen für die\u003c/li\u003e\n\u003cli\u003eSoftware und Implementierung dieser auf Linux Systemen mittels C++\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eQualifikation\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003emehrjährige Erfahrung in C++\u003c/li\u003e\n\u003cli\u003egute Kenntnisse im Bereich Software Design/Architektur\u003c/li\u003e\n\u003cli\u003eLinux Entwicklung für Embedded Systeme\u003c/li\u003e\n\u003cli\u003eKenntisse unterschiedlicher Prozessor Architekturen\u003c/li\u003e\n\u003cli\u003eFehlersuche auf Embedded Linux Devices (JTAG-Debugging, KDB, GDB, etc..)\u003c/li\u003e\n\u003cli\u003evon Vorteil: Erfahrung in C++11,C++17, Python Erfahrung mit Netzwerkprotokollen Inter Process Communcation(IPC) Protokolle z.B. DBUS,SOME/IP,RPC\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eBenefits\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eNeueste Technologie\u003c/li\u003e\n\u003cli\u003eEin angenehmes Arbeitsumfeld in einem motivierten Team\u003c/li\u003e\n\u003cli\u003eGeräumige Büros und Labore in hochmodernen Gebäuden\u003c/li\u003e\n\u003cli\u003eWeiterbildungsmöglichkeiten, Offenheit für Innovation und keinerlei Bürokratie\u003c/li\u003e\n\u003cli\u003eFlexible Arbeitszeiten und Möglichkeiten für mobiles Arbeiten\u003c/li\u003e\n\u003cli\u003eUnbefristeter Arbeitsplatz\u003c/li\u003e\n\u003cli\u003eFitnesstraining, Firmenevents und noch mehr auf Firmenkosten\u003c/li\u003e\n\u003cli\u003eKostenfreies Laden von Elektro- und Hybridelektrofahrzeugen\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eLassen Sie sich von unserem Erfinder- und Pioniergeist anstecken und arbeiten Sie mit am Ausbau unserer Spitzentechnologie.\u003c/strong\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://smartmicro.join.com/jobs/2179555-c-developer-m-w-d?pid=357a3b4531918760973f\u0026amp;oid=38a90743-0554-46ed-9178-9c5b194ae017\u0026amp;utm_source=github_jobs\u0026amp;utm_medium=paid\u0026amp;utm_campaign=single%2Bposting\u0026amp;utm_content=c%2Bdeveloper%2Bm%2Bw%2Bd\"\u003ehttps://smartmicro.join.com/jobs/2179555-c-developer-m-w-d?pid=357a3b4531918760973f\u0026amp;oid=38a90743-0554-46ed-9178-9c5b194ae017\u0026amp;utm_source=github_jobs\u0026amp;utm_medium=paid\u0026amp;utm_campaign=single%2Bposting\u0026amp;utm_content=c%2Bdeveloper%2Bm%2Bw%2Bd\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://web.archive.org/web/20210507025928/https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBZ21pIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--b3bc1ab6129e72dc53b3d1beed2400032bec650b/smartmicro-logo-l.jpg"},{"id":"01e82177-cb13-4026-bbc3-c309765347e2","type":"Full Time","url":"https://web.archive.org/web/20210507025928/https://jobs.github.com/positions/01e82177-cb13-4026-bbc3-c309765347e2","created_at":"Mon Apr 26 12:50:24 UTC 2021","company":"Kontist GmbH","company_url":"https://web.archive.org/web/20210507025928/https://kontist.com/home/?mrasn=702727.872066.68AozIm3","location":"Berlin","title":"Senior JavaScript Developer (f/m/x)","description":"\u003cp\u003eDo you know how many obstacles freelancers face when it comes to their finances?\u003c/p\u003e\n\u003cp\u003eIt starts with opening a business account and leads to taking care of all the tax issues. We want to make it easy to run your own business when being self-employed and offer tailored services that address the pressing, and unique needs freelancers face.\u003c/p\u003e\n\u003cp\u003eFirst we created a smart mobile bank account with superpowers that helps with finances, taxes and savings. Now we also offer a tax service for the self-employed to really take care of all of their needs. After a Series B funding we’re expanding our engineering team and looking for engineers who want to be part of taxes automation in Germany.\u003c/p\u003e\n\u003cp\u003eYou’ll work as a member in our cross-functional teams and ensure that we create a system and architecture that helps the company and our customers.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eYour tasks:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWork on frontend (mobile and web apps) as well as backend tasks\u003c/li\u003e\n\u003cli\u003eHelp us within the conception, development and optimization of algorithms and applications with a focus on machine learning\u003c/li\u003e\n\u003cli\u003eImplement new features and fix bugs\u003c/li\u003e\n\u003cli\u003eCome up with ideas and suggestions to improve our processes and standards\u003c/li\u003e\n\u003cli\u003eSpread your knowledge in the team and mentor junior developers to fulfill their potential\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eYour profile:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e5+ years of experience in backend/API technologies - we use NodeJS, PostgreSQL and write things in TypeScript\u003c/li\u003e\n\u003cli\u003eStrong frontend skills - we build our web apps with React and our mobile apps with React Native and mainly use Redux and React Hooks.\u003c/li\u003e\n\u003cli\u003eAn eye for quality (automated tests, clean code, striving for improvements)\u003c/li\u003e\n\u003cli\u003eExperience with implementing REST APIs / GraphQL and CI/CD process\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eYour future team:\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe are a team of engineers who are from 10+ countries and enjoy working with each other day by day. Below you can find our beliefs which unite us:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eKnowledge is like good news, it is best if you share it\u003c/li\u003e\n\u003cli\u003eResponsibility is like bad news, it’s best not to be alone\u003c/li\u003e\n\u003cli\u003eWe embrace iteration\u003c/li\u003e\n\u003cli\u003eMultitasking kills efficiency\u003c/li\u003e\n\u003cli\u003eSoftware is not an island\u003c/li\u003e\n\u003cli\u003eAll for one, one for all\u003c/li\u003e\n\u003cli\u003eLet's have fun\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cem\u003eWe expect that everyone in our team:\u003c/em\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eTakes ownership\u003c/li\u003e\n\u003cli\u003eGives constructive feedback\u003c/li\u003e\n\u003cli\u003eEmbraces change\u003c/li\u003e\n\u003cli\u003eCommunicates proactively\u003c/li\u003e\n\u003cli\u003eUnderstands and questions specifications\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eHow we show our love:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDecide if you want to work on-site or 100% remote.\u003c/li\u003e\n\u003cli\u003eFlexible, trust-based working hours\u003c/li\u003e\n\u003cli\u003eGreat team that loves to grow\u003c/li\u003e\n\u003cli\u003eBring in your ideas (from machine learning to deployment)\u003c/li\u003e\n\u003cli\u003ePersonal coaching\u003c/li\u003e\n\u003cli\u003eA multicultural, diverse, and inclusive community where you can grow personally and professionally, including possibilities to move internally within the company\u003c/li\u003e\n\u003cli\u003eLovely, sunny and green office in central Berlin with office dogs\u003c/li\u003e\n\u003cli\u003eRegular team events and company off-sites\u003c/li\u003e\n\u003cli\u003eWeekly German and English classes\u003c/li\u003e\n\u003cli\u003eSponsored daily on-site lunches\u003c/li\u003e\n\u003cli\u003eUrban Sports Club membership\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWe know that time is precious and this is why we try to keep our recruiting process short. You’ll meet directly in the first interview min. 2 of our team leads to get directly an idea about our culture and the people behind. We are looking forward to getting to know you!\u003c/p\u003e\n","how_to_apply":"\u003cp\u003e\u003ca href=\"https://kontist.join.com/jobs/2133729-senior-javascript-developer-f-m-x?pid=357a3b4531918760973f\u0026amp;oid=fec1ffbb-3fa7-4f27-8698-f629520d92bf\u0026amp;utm_source=github_jobs\u0026amp;utm_medium=paid\u0026amp;utm_campaign=single%2Bposting\u0026amp;utm_content=senior%2Bjavascript%2Bdeveloper%2Bf%2Bm%2Bx\"\u003ehttps://kontist.join.com/jobs/2133729-senior-javascript-developer-f-m-x?pid=357a3b4531918760973f\u0026amp;oid=fec1ffbb-3fa7-4f27-8698-f629520d92bf\u0026amp;utm_source=github_jobs\u0026amp;utm_medium=paid\u0026amp;utm_campaign=single%2Bposting\u0026amp;utm_content=senior%2Bjavascript%2Bdeveloper%2Bf%2Bm%2Bx\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://web.archive.org/web/20210507025928/https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBZ1NpIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--74f1f1c648204196ac8d07f8681945813a04b9a3/kontist-squarelogo-1533721173355.png"},{"id":"33fa9582-fbd3-4735-b1f2-dd9d978e2549","type":"Full Time","url":"https://web.archive.org/web/20210507025928/https://jobs.github.com/positions/33fa9582-fbd3-4735-b1f2-dd9d978e2549","created_at":"Sun Apr 25 04:44:57 UTC 2021","company":"DevStar Jobs","company_url":"https://web.archive.org/web/20210507025928/https://devstarjobs.com","location":"Nashville, TN","title":"Senior Engineer Ruby on Rails","description":"\u003cp\u003eBe part of a great team building the next generation hiring platform for software development jobs.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eYour role?\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eCollaborate with team members to solve challenging engineering problems\u003c/li\u003e\n\u003cli\u003eBuild customer-first solutions\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eYour contributions?\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBroad web development experience with Ruby and Rails\u003c/li\u003e\n\u003cli\u003eCrisp communication\u003c/li\u003e\n\u003cli\u003eFocus on project adaptability and manageability at the architecture level\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWhy apply?\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWork on a small, agile (lowercase agile!) team without administrative overhead\u003c/li\u003e\n\u003cli\u003eRemote first, flexibility for Life – because it happens\u003c/li\u003e\n\u003cli\u003eHelp fellow software developers by connecting them with hiring companies with a simple, straightforward process, without all the hassle of spammy notifications\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cem\u003eDiversity and equal opportunity are important to us. We are happy about the interest of all candidates and strive to provide feedback as quickly as possible.\u003c/em\u003e\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eEmail CV and GitHub username to \u003ca href=\"mailto:devstarjobs@protonmail.com\"\u003edevstarjobs@protonmail.com\u003c/a\u003e\u003c/p\u003e\n","company_logo":null},{"id":"21a5ad81-2237-4544-b5d7-258b59d84cd5","type":"Full Time","url":"https://web.archive.org/web/20210507025928/https://jobs.github.com/positions/21a5ad81-2237-4544-b5d7-258b59d84cd5","created_at":"Fri Apr 23 09:02:57 UTC 2021","company":"Randstad Groep Nederland B.V.","company_url":"https://web.archive.org/web/20210507025928/https://www.werkenbijrandstad.nl/","location":"Diemen/Amsterdam","title":"DevOps Engineer","description":"\u003cp\u003eWil jij samen met onze ontwikkelaars kwalitatieve oplossingen realiseren door jouw ervaring als DevOps engineer in te zetten voor de platform services voor onze business applicaties? In een omgeving waarin experimenteren, vrijheid en jouw ontwikkeling centraal staat? Dan is het zeker de moeite waard om verder te lezen!\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eOVER RANDSTAD GROEP NEDERLAND IT\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eDe IT-afdeling van Randstad Groep Nederland is verantwoordelijk voor de volledige ICT-dienstverlening, waaronder het ontwikkelen van applicaties. De developers van RGN IT ontwikkelen IT-oplossingen die mens en werk dichter bij elkaar brengen. Als DevOps engineer ondersteun je hen bij de ontwikkeling van deze applicaties.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWAT GA JE DOEN?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAls DevOps Engineer bij Randstad Groep IT zul je verantwoordelijk zijn voor het optimaal inrichten en opzetten van de platform services binnen RGN-IT. Deze platform services bieden ondersteuning aan de ontwikkelteams op het gebied van:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eMonitoring\u003c/li\u003e\n\u003cli\u003eCI/CD\u003c/li\u003e\n\u003cli\u003eEvent bus\u003c/li\u003e\n\u003cli\u003eIntegratie\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eIn een gemiddelde werkweek hou jij je bezig met het onderhouden van de verschillende platform services, het ondersteunen van de ontwikkelteams, het verbeteren van de platform services, en het implementeren van de platform services binnen RGN-IT. Als je energie krijgt van een cloud omgeving, innovatie en uitdaging, dan zit je goed!\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eMET WIE WERK JE SAMEN?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eBinnen RGN IT zal je werken binnen het Cloud Infra Solutions domein, waar binnen teams met verschillende expertisegebieden werken aan een beter en veiliger Randstad. Zo zijn naast het Cloud Infrastructure Services (CIS)  ook het Security Operations Center (SOC) \u0026amp; Security Test Team (STT) onderdeel van dit domein. Het doel van het domein is om zowel qua infrastructuur als security Randstad Groep Nederland verder te brengen.\u003c/p\u003e\n\u003cp\u003eDaarnaast werk je heel veel samen met meerdere ontwikkel/DevOps teams.In totaal hebben wij zo’n 26 DevOps teams in onze IT organisatie, met in totaal meer dan 250 collega’s. We werken veel samen in cross-functional product teams volgens een agile werkwijze, maar blijven ook graag bij elkaar aangesloten, door bijvoorbeeld onze chapters.\u003c/p\u003e\n\u003cp\u003eWist je trouwens dat ruim 30% van onze IT-professionals vrouw is? Best uitzonderlijk voor een IT-organisatie. En hartstikke mooi. Want we weten: hoe diverser de teams, hoe beter de resultaten.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWIE BEN JE?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eJij zou goed binnen Randstad Groep IT passen wanneer je de interesse hebt om veel te leren en uitdaging ziet in snelle ontwikkelingen. Jij vindt het leuk om verder te kijken dan jouw eigen werkveld en helpt jouw collega’s ook graag verder waar je dat kan. Verder vinden we het belangrijk dat jij:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWerkervaring hebt als developer\u003c/li\u003e\n\u003cli\u003eErvaring hebt met scripting-talen, provisioning tool (zoals puppet, jenkins), test tools (zoals SonarQube)\u003c/li\u003e\n\u003cli\u003eKennis hebt van ELK, Enterprise Bus technologie, source control tools, CI/CD tools\u003c/li\u003e\n\u003cli\u003eEn brede interesse (of nog beter ervaring) hebt in Amazon Web Services, zodat je in meerdere disciplines aan de slag kunt\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWe zoeken iemand met de volgende eigenschappen:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eHBO/WO werk- en denkniveau\u003c/li\u003e\n\u003cli\u003eca. 3 jaar ervaring in het werkgebied\u003c/li\u003e\n\u003cli\u003eAmbitie om je verder te ontwikkelen\u003c/li\u003e\n\u003cli\u003eGoede kennis van de Engelse taal, en bij voorkeur de Nederlandse taal\u003c/li\u003e\n\u003cli\u003eEen analytisch en pragmatisch houding\u003c/li\u003e\n\u003cli\u003eKlant- en oplossingsgericht\u003c/li\u003e\n\u003cli\u003eIn staat om risico's en passende niveaus van urgentie effectief te beoordelen en te communiceren aan zowel management als technisch personeel.\u003c/li\u003e\n\u003cli\u003eJe bent een teamplayer\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWAT BIEDEN WIJ?\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eEen divers applicatielandschap waar alle aspecten van het vakgebied aan bod komen, zodat je je volledig kan ontplooien als encryptie specialist.\u003c/li\u003e\n\u003cli\u003eEen bruto maandsalaris tussen € 2.750 en € 4.000  afhankelijk van werkervaring\u003c/li\u003e\n\u003cli\u003eDe mogelijkheid om vanuit huis te werken.\u003c/li\u003e\n\u003cli\u003eTrainingen, zowel gericht op soft skills als vakinhoudelijk.\u003c/li\u003e\n\u003cli\u003eEen ruim maandelijks benefit budget waarmee je zelf kunt kiezen tussen vrije tijd of geld, of voor inzet van je budget voor oa een fiets, tablet, sportabonnement of opleiding.\u003c/li\u003e\n\u003cli\u003e25 vakantiedagen en 8,5% vakantietoeslag.\u003c/li\u003e\n\u003cli\u003eEen interessante bonusregeling met daarnaast mogelijkheid om 2x per jaar een outperformance bonus te behalen.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWAAROM RGN IT?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAls IT-professional bij een van de grootste uitzendorganisaties ter wereld help je mee de samenleving draaiende te houden. Wij ondersteunen de HR-dienstverlening van Randstad Groep Nederland met software die we continu verbeteren. Wij geloven in de kracht van technologie, maar wél gecombineerd met persoonlijke aandacht. En dat geldt evengoed voor onze eigen medewerkers: wij zien jouw vooruitstrevende ideeën, maar vooral jou. Jouw werkplezier staat voorop.\u003c/p\u003e\n\u003cp\u003eBinnen de IT-organisatie van Randstad Groep Nederland bouwen we aan hechte teams, waarin je alle ruimte krijgt om je ideeën waar te maken en om jezelf te ontwikkelen. Wij bieden je volop mogelijkheden om te groeien. Zo bieden wij niet alleen een baan, maar een carrière. De enorme diversiteit aan functies binnen heel Randstad Groep Nederland biedt interessante doorgroeimogelijkheden. Wist je dat 80% van ons hoger management binnen onze eigen organisatie is opgeklommen? Kom erbij en groei!\u003c/p\u003e\n\u003cp\u003eWord jij onze nieuwe DevOps Engineer?\u003c/p\u003e\n\u003cp\u003eBen jij de persoon die continu de focus zal leggen op het verbeteren van onze dienstverlening voor de medewerkers en klanten van Randstad Groep Nederland? Dan kijken we uit naar je sollicitatie!\u003c/p\u003e\n\u003cp\u003e--\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eGa direct naar \u003ca href=\"https://www.werkenbijrandstad.nl/nl/nl/apply?jobSeqNo=RANEUKR18496EXTERNALNLNL\u0026amp;utm_source=github\u0026amp;utm_medium=paid\u0026amp;utm_campaign=cr-it\"\u003e\u003cstrong\u003ehet sollicitatieformulier\u003c/strong\u003e\u003c/a\u003e!\u003c/p\u003e\n","company_logo":"https://web.archive.org/web/20210507025928/https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdm1oIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--1c244327c16376573a204c24dc4da4a99875f384/randstad-logo-share-blue.png"},{"id":"a19f3597-9ebc-4e05-bc33-1d8c9e5d86bc","type":"Full Time","url":"https://web.archive.org/web/20210507025928/https://jobs.github.com/positions/a19f3597-9ebc-4e05-bc33-1d8c9e5d86bc","created_at":"Fri Apr 23 08:48:46 UTC 2021","company":"Randstad Groep Nederland B.V.","company_url":"https://web.archive.org/web/20210507025928/https://www.werkenbijrandstad.nl/","location":"Diemen/Amsterdam","title":"Java/Hippo Developer","description":"\u003cp\u003eRandstad is een pionier in de hr-dienstverlening. Sinds de oprichting in 1960 zijn wij uitgegroeid tot dé grootste hr-dienstverlener in de wereld. Onze missie is om de wereld van werk te ontwikkelen. Dit doen wij voor iedereen die met werk te maken heeft: onze klanten, kandidaten, medewerkers en de maatschappij als geheel. In de hele wereld, en zeker ook in onze thuismarkt Nederland.\u003c/p\u003e\n\u003cp\u003eDoor onze passie voor mensen te combineren met de kracht van de hedendaagse technologie en innovatie, ondersteunen we mensen en organisaties bij het realiseren van hun ware potentie. Dit noemen we human forward.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eRANDSTAD GROEP NEDERLAND IT\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe werken normaal gesproken vanuit ons hoofdkantoor in Amsterdam (Diemen), op dit moment vanuit ons thuiskantoor. Een ondernemende agile omgeving waar we in meer dan 24 DevOps-teams continu experimenteren met nieuwe technologieën. Hoe wij zorgen dat Randstad Groep Nederland IT wereldwijd voorop blijft lopen als het gaat om IT-innovatie? Door elkaar scherp te houden en te inspireren in onze zogenoemde tribes. Doordat wij met meerdere tribes aan eenzelfde product of dienst werken, ontstaat een interessante kruisbestuiving tussen collega’s van allerlei teams en disciplines binnen én buiten de IT-afdeling. Wat ongetwijfeld ook bijdraagt aan ons succes, is de diversiteit binnen onze teams. Wist je bijvoorbeeld dat ruim 30% van onze IT-professionals vrouw is? Dat kunnen maar weinig IT-organisaties zeggen. Wij zijn er trots op, want we weten: gemengde teams – in de meest brede zin van het woord – presteren beter.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eHET TEAM WAAR JE KOMT TE WERKEN\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eJe komt te werken in het Online Search Experience team. Dit team werkt samen met de product owner aan onze web omgevingen van Randstad Groep Nederland. Het team bestaat uit 4 full stack developers, 1 frontend developer, 1 analist en 1 UX-designer. Naast het team zijn we binnen de IT organisatie bezig met het opzetten van chapters. In het chapter komen medewerkers met dezelfde expertise samen om het vakmanschap binnen onze organisatie te vergroten en om standaarden op gebied van documentatie, werkwijze en coding op elkaar af te stemmen. We gebruiken Hippo als ons CMS, daardoor is het van belang dat je hier al de nodige kennis van hebt.\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWAT GA JE DOEN?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAls Developer werk je met het volgende takenpakket:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eSamen met het team ontwikkelen van user stories op de backlog;\u003c/li\u003e\n\u003cli\u003eSamenwerken met andere online teams;\u003c/li\u003e\n\u003cli\u003eTesten schrijven voor de code die je oplevert.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWIE BEN JE?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWe werken met onderstaande technieken, we verwachten dat je de meeste al onder knie hebt:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eBloomreach / Hippo CMS (must have)\u003c/li\u003e\n\u003cli\u003eSpring, springboot\u003c/li\u003e\n\u003cli\u003eSwagger\u003c/li\u003e\n\u003cli\u003eJava \u0026amp; object oriented\u003c/li\u003e\n\u003cli\u003eJson \u0026amp; rest services\u003c/li\u003e\n\u003cli\u003eSoap-services \u0026amp; wsdl\u003c/li\u003e\n\u003cli\u003eXML, xsd, yaml\u003c/li\u003e\n\u003cli\u003eJenkins\u003c/li\u003e\n\u003cli\u003eGit \u0026amp; gitlab\u003c/li\u003e\n\u003cli\u003eKibana\u003c/li\u003e\n\u003cli\u003eMaven \u0026amp; Gradle\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eSKILLS \u0026amp; COMPETENTIES DIE VOOR DEZE ROL VAN BELANG ZIJN:\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eNederlands en Engels in woord en geschrift;\u003c/li\u003e\n\u003cli\u003eJe hebt een allround mentaliteit / hands-on mentaliteit / self-starting;\u003c/li\u003e\n\u003cli\u003eJe hebt sterke affiniteit met het werken in een dynamische omgeving waarin de gestelde eisen aan kwaliteit hoog zijn en je hebt een Agile mindset;\u003c/li\u003e\n\u003cli\u003eJe werkt gestructureerd, je bent analytisch en je kan outside-the-box zaken benaderen;\u003c/li\u003e\n\u003cli\u003eJe hebt een klant- en oplossingsgerichte instelling en gaat geen uitdaging uit de weg;\u003c/li\u003e\n\u003cli\u003eBeschikt over ambitie en lef; je wilt jezelf continu kunnen (blijven) uitdagen en verbeteren;\u003c/li\u003e\n\u003cli\u003eJe voelt je thuis in een technisch complexe omgeving en je deinst niet terug van het vinden van oplossingen die op dat moment buiten jouw ervaringsgebied liggen.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWAT BIEDEN WIJ?\u003c/strong\u003e\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eEen divers applicatielandschap waar alle aspecten van het vakgebied van een developer aan bod komen, zodat je je volledig kan ontplooien als specialist;\u003c/li\u003e\n\u003cli\u003eEen enthousiast team dat je graag ziet groeien;\u003c/li\u003e\n\u003cli\u003eFlexibel werken, ook na covid, en een werkgever die je hierin ondersteunt;\u003c/li\u003e\n\u003cli\u003eTrainingen, zowel gericht op soft skills als vakinhoudelijk;\u003c/li\u003e\n\u003cli\u003eEen salaris van €3.800 - €5.200, afhankelijk van de ervaring die je meebrengt;\u003c/li\u003e\n\u003cli\u003eEen ruim maandelijks benefit budget (12,347%, inclusief 8,5% vakantiegeld) waarmee je zelf kunt kiezen tussen vrije tijd of geld, of voor inzet van je budget voor oa een fiets, tablet, sportabonnement of opleiding;\u003c/li\u003e\n\u003cli\u003e25 vakantiedagen, met de mogelijkheid er nog eens 26 bij te kopen;\u003c/li\u003e\n\u003cli\u003eDeelname aan onze aandelenregeling;\u003c/li\u003e\n\u003cli\u003eEen interessante bonusregeling met daarnaast mogelijkheid om 2x per jaar een outperformance bonus te behalen.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003e\u003cstrong\u003eWAAROM RGN IT?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAls je als Hippo / Java developer ergens impact hebt, dan is het hier wel. Want als professional bij een van de grootste uitzendorganisaties ter wereld help je mee de samenleving draaiende te houden. Wij ondersteunen de HR-dienstverlening van Randstad Groep Nederland met hightech apps en software, die we continu verbeteren. Zo komt het dat onze innovaties elkaar in sneltreinvaart opvolgen. Wij geloven in de kracht van technologie, maar wél gecombineerd met persoonlijke aandacht. En dat geldt evengoed voor onze eigen medewerkers: wij zien jouw vooruitstrevende ideeën, maar vooral jou. Jouw werkplezier staat voorop.\u003c/p\u003e\n\u003cp\u003eBinnen de IT-organisatie van Randstad Groep Nederland bouwen we aan hechte teams, waarin je alle ruimte krijgt om je ideeën waar te maken. En om jezelf te ontwikkelen. Durf je daar wat lef in te tonen? Top. Wij bieden je volop mogelijkheden om te groeien. Kom erbij en groei!\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003eWAAR KOM JE TERECHT?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eEen warm bad, met fijne en inspirerende collega’s die voor je klaarstaan en hun kennis en ervaring graag met jou delen. Je komt terecht in een uitdagende werkomgeving. En, een nieuw, zeer waardevol netwerk binnen de grootste HR dienstverlener ter wereld!\u003c/p\u003e\n\u003cp\u003eHeb je interesse in deze rol? Reageer dan via de link hiernaast. Wij zien uit naar je sollicitatie.\u003c/p\u003e\n\u003cp\u003e--\u003c/p\u003e\n\u003cp\u003eEen VOG en/of een assessment kan onderdeel uitmaken van het selectieproces.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eGa direct naar \u003ca href=\"https://www.werkenbijrandstad.nl/nl/nl/apply?jobSeqNo=RANEUKR17917EXTERNALNLNL\u0026amp;utm_source=github\u0026amp;utm_medium=paid\u0026amp;utm_campaign=cr-it\"\u003e\u003cstrong\u003ehet sollicitatieformulier\u003c/strong\u003e\u003c/a\u003e!\u003c/p\u003e\n","company_logo":"https://web.archive.org/web/20210507025928/https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdXVoIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--a5004f57dc432a95ce112bc6c5b177e770c9ec0e/randstad-logo-share-blue.png"}]